{
    "Question": "2. 30. A SONAR (sound navigation and ranging) uses ultrasonic waves to detect and locate objects underwater. In a submarine equipped with a SONAR, the time delay between the generation of a probe wave and the reception of its echo after reflection from an enemy submarine is found to be 77.0 s. What is the distance of the enemy submarine? (Speed of sound in water = 1450 m s^–1).\r\n",
    "Original Solution": "Speed of sound in water,v = 1450 m s^–1\r\nThe time between generation and the reception of the echo after reflection, 2t= 77.0 s\r\nTime taken for the sound waves to reach the submarine, t = 77.0/2 = 38. 5 s\r\nThen v = d/t\r\nDistance of enemy submarine, d  = tv\r\nTherefore, d=vt=(1450 x 38. 5) =55825 m=55.8 x 10^3 m or 55.8 km.",
    "Detailed Solution": "Step 1) In this problem, a SONAR device is used to detect an enemy's submarine using ultrasonic waves. We know the speed of sound in water, v, is 1450 m s^-1, and also the time delay between the probe wave's generation and the echo's reception, 2t, which is 77.0 s. These are known or given values. Step 2) Because the time delay is two-way – going to the submarine and then returning – to find the time it takes for sound to reach the submarine, we must divide the given total time by 2. This gives us t = 77.0/2 = 38.5 s. Step 3) We can calculate the distance using the velocity-time relationship formula in physics that states velocity equals distance over time, written as v = d/t. Here, we want to find 'd,' so we rearrange the formula to isolate 'd' on one side of the formula, resulting in d = vt. Step 4) Plug the known values into the equation, t = 38.5 s and v = 1450 m s^-1, which results in d = vt = (1450 * 38.5) = 55825 m. Step 5) This is the distance, but it is usually more significant when expressed in km for such large distances. Therefore, convert meters to km by dividing the calculated value by 1000. This gives the distance as 55.8 x 10^3 m or 55.8 km.",
    "Solution Outline": "Step 1) Start by identifying the known values: the speed of sound in water (v = 1450 m s^-1) and the total time it takes for the echo to return (2t = 77.0 s). Step 2) We need to find the time it takes for the wave to reach the enemy submarine, so we divide the total time by 2 (t = 77.0/2 = 38.5 s). Step 3) The physics formula relating distance to velocity and time is v = d/t. To find the distance, we rearrange this to d = vt. Step 4) Substitute the known velocity and calculated time into the equation to find the distance (d = vt = 1450 * 38.5 = 55825 m). Step 5) Finally, convert the distance into a more appropriate unit, km, by dividing by 1000 (55.8 km). Each step follows logically from the one before, beginning from the given data, performing necessary calculations to arrive at the solution - the distance of the enemy's submarine."
}