{
    "Question": "4: Explain why\r\n(a) To keep a piece of paper horizontal, you should blow over, not under it.\r\n(b) When we try to close a water tap with our fingers, fast jets of water gush through the openings between our fingers.\r\n(c) The size of the needle of a syringe controls the flow rate better than the thumb pressure exerted by a doctor while administering an injection.\r\n(d) A fluid flowing out of a small hole in a vessel results in a backward thrust on the vessel.\r\n(e) A spinning cricket ball in the air does not follow a parabolic trajectory.",
    "Original Solution": "(a) If we blow over a piece of paper, the velocity of air above the paper becomes more than that below it. As the K.E. of air above the paper increases, in accordance with Bernoulli’s theorem, its pressure energy and hence, its pressure decreases.\r\nDue to the greater value of pressure below the piece of paper = atmospheric pressure, it remains horizontal and does not fall.\r\n(b) As per the equation of continuity, area × velocity = constant. When we try to close a water tap with our fingers, the area of the cross-section of the outlet of the water jet is reduced considerably, as the openings between our fingers provide constriction (regions of smaller area).\r\nThus, the velocity of the water increases greatly, and fast jets of water come through the openings between our fingers.\r\n(c) The size of the needle controls the velocity of flow, and the thumb pressure controls pressure.  According to the Bernoulli’s theorem  P + \\(\\begin{array}{l}\\frac{ 1 }{ 2 } pv^{ 2 }\\end{array} \\) = Constant\r\nIn this equation, the pressure P occurs with a single power, whereas the velocity occurs with a square power. Therefore, the velocity is more effective compared to the pressure. It is for this reason that the needle of the syringe controls the flow rate better than the thumb pressure exerted by the doctor.\r\n(d) This is because of the principle of conservation of momentum. While the flowing fluid carries forward momentum, the vessel gets a backward momentum.(e) A spinning cricket ball would have followed a parabolic trajectory had there been no air. But because of air, the Magnus effect takes place. Due to the Magnus effect, the spinning cricket ball deviates from its parabolic trajectory.",
    "Detailed Solution": "Step 1) Let's start with part (a) of the question. Here we're asked to explain why we should blow over, rather than under, a piece of paper to keep it horizontal. The reason lies in the Bernoulli’s Theorem, which states that as the velocity of the air increases, its pressure decreases. By blowing over the paper, we enhance the speed of the air above the paper, reducing the pressure there. Meanwhile, the pressure beneath the paper remains equivalent to the atmospheric pressure, hence creating a pressure differential that keeps the paper horizontal. \nStep 2) Moving on to part (b), it concerns the phenomenon when we attempt to close a water tap with our fingers. Here, we need to understand the principle of the equation of continuity that asserts the product of the area and velocity is constant within a fluid flow. When we decrease the area by covering the water tap with our fingers, essentially it increases the velocity of the water leading to gushing jets through the spaces between our fingers. \nStep 3) Part (c) regards the role of the needle's size in a syringe and the thumb pressure exerted by the doctor in dictating the flow rate. The mathematical base of the explanation here again relies on the Bernoulli’s theorem. As mentioned before, Bernoulli’s theorem encompasses an equation which involves the pressure P and the velocity v squared, denoted by v^2. In this equation, the effect of velocity is more pronounced due to the square power, indicating minor changes in velocity impact the flow rate more than pressure. Hence, the needle’s size has a greater effect on the flow rate than the thumb pressure exerted by the doctor.\nStep 4) In part (d), the principle of conservation of momentum allows us to explain why a fluid flowing out from a small hole in a vessel results in a backward thrust on the vessel. As the fluid moves forward carrying its momentum, an equal and opposite momentum (backward thrust) is imparted onto the vessel to conserve the total momentum.\nStep 5) Finally, in part (e), we must explain why a spinning cricket ball does not follow a parabolic trajectory. In vacuum conditions, the ball would indeed follow a parabolic path. However, the presence of air introduces a factor known as the Magnus effect. Because of the spinning motion, different air velocity is developed on different faces of the ball causing a pressure differential which deviates the ball from its anticipated parabolic path.",
    "Solution Outline": "Step 1) For part (a), use Bernoulli's theorem. Increased velocity leads to decreased pressure, keeping the paper horizontal when we blow over it.\nStep 2) In part (b), apply the principle of continuity, stating that reducing the area of flow increases the velocity, resulting in jets of water shooting out between our fingers.\nStep 3) For part (c), refer again to Bernoulli’s theorem. With the pressure and the square of the velocity involved in the equation, the size of the needle affecting the velocity has more impact on the flow rate compared to the thumb pressure.\nStep 4) In part (d), use the principle of conservation of momentum. As fluid flows out of a vessel carrying momentum, backward momentum (equal and opposite) is imparted onto the vessel.\nStep 5) Lastly, for part (e), invoke the theory of the Magnus effect, which due to air presence, deflects a spinning cricket ball from its parabolic trajectory."
}