{
    "Question": "12. A rocket is fired from the earth towards the sun. At what distance from the earth’s centre is the gravitational force on the rocket zero? Mass of the sun = 2 x 10^30 kg, and the mass of the earth = 6 x 10^24 kg. Neglect the effect of other planets, etc. (Orbital radius = 1.5 x 10^11 m)\r\n",
    "Original Solution": "Mass of Sun, Msun= 2 x 10^30 kg\r\nMass of Earth, Mearth = 6 x 10^24 kg\r\nOrbital radius, r = 1.5 x 10^11 m\r\nMass of the rocket = m\r\nLet P be the point at a distance x at which the gravitational force on the rocket is due to Earth.\r\nApplying Newton’s law of gravitation, the gravitational force acting on the rocket at point P is equated.\r\n\\begin{array}{l}\\frac{GmM_{sun}}{(r-x)^{2}}=\\frac{GmM_{earth}}{x^{2}}\\end{array} = \\begin{array}{l}\\frac{GmM_{sun}}{(r-x)^{2}}=\\frac{GmM_{earth}}{x^{2}}\\end{array}\r\n\\begin{array}{l}\\frac{(r-x)^{2}}{x^{2}}=\\frac{M_{sun}}{M_{earth}}= \\left ( \\frac{2\\times 10^{30}}{60\\times 10^{24}} \\right )^{1/2}=577.35\\end{array} \r\n1.5 x 10^11 – x = 577.35x\r\nx = 1.5 x 10^11/578.35 = 2.59 x 10^8 m",
    "Detailed Solution": "Step 1) First, we need to clearly define all the known values. The known values from the problem are the mass of the sun (Msun = 2 x 10^30 kg), the mass of the earth (Mearth = 6 x 10^24 kg), the orbital radius (r = 1.5 x 10^11 m), and let the mass of the rocket be m. Step 2) We want to find the point P at a distance x from the centre of the earth where the gravitational force on the rocket becomes zero, assuming P is along the line connecting the centers of Earth and Sun. Step 3) By Newton's law of gravitation, the force on an object is given by the formula F = G * (M1 * M2)/d^2, where G is the gravitational constant, M1 and M2 are the masses of the two bodies, and d is the distance between them. At point P, the gravitational forces exerted on the rocket by the Earth and the Sun would be equal but opposite in direction, hence equating them gives us the equation GmMsun/(r-x)^2 = GmMearth/x^2. Step 4) Notice that G and m appear on both sides of the equation. This means we can cancel them out. Step 5) Now we can rearrange the equation to find the value for x: (r-x)^2 / x^2 = Msun/Mearth. Step 6) Substitute the given values for Msun and Mearth into the equation to get our numerical value: (2 x 10^30 kg / 6 x 10^24 kg)^(1/2) = 577.35. Step 7) We can further rearrange the equation to isolate x: r - x = 577.35x so x = r/(578.35). Step 8) Lastly, plug in the given value for r (orbital radius) into the equation for x: (1.5 x 10^11 m) / 578.35 = 2.59 x 10^8 m. Therefore, the point P where gravitational force becomes zero is at a distance of 2.59 x 10^8 m from the earth's centre.",
    "Solution Outline": "Step 1) Clearly identify the known values from the problem: Msun, Mearth, r, and m. Step 2) Aim to find the point P, a distance x from the Earth's centre, where net gravitational force on the rocket is zero. Step 3) Apply Newton's law of gravitation to set up an equation where the gravitational forces from the Sun and Earth on the rocket are equal, understanding that these forces should have opposite directions at point P. Step 4) Cancel out G and m from both sides of the equation as they are common. Step 5) Rearrange the equation to isolate x: (r-x)^2 / x^2 = Msun/Mearth. Step 6) Substitute the given values for Msun and Mearth into the equation. Step 7) Further rearrange the equation to solve for x: r - x = 577.35x so x = r/(578.35). Step 8) Finally, substitute the value for r (orbital radius) into the equation for x to find the point P where gravitational force becomes zero."
}