{
    "Question": "Q.22: A hot ball cools from 90 C to 10 C in 5 minutes. If the surrounding temperature is 20C, what is the time taken to cool from 60 C to 30 C?",
    "Original Solution": "Using Newton’s law of cooling, the cooling rate is directly proportional to the difference in temperature.\r\nHere, average of 90C and 40 C = 50 C\r\nSurrounding temperature = 20 C\r\nDifference = 50 – 20= 30 C\r\nUnder the given conditions, the ball cools to 80° C for 5 minutes\r\nTherefore, \\(\\begin{array}{l}\\frac{Change\\, in\\, temperature}{Time} = k\\Delta t\\end{array} \\)\r\n\\(\\begin{array}{l}\\Rightarrow\\end{array} \\)   \\(\\begin{array}{l}\\frac{30}{5}\\end{array} \\) = K × 30 . . . . . . . . . . . . . (1)Where the value of  K is a constant.\r\nThe average of 60 C and 30 C = 45 C\r\n\\(\\begin{array}{l}\\Rightarrow\\end{array} \\)  45 C – 20 C = 25 C above the room temperature and the body cools by 30 C [ 60 C – 30 C ] within time t ( Assume )\r\nTherefore, \\(\\begin{array}{l}\\frac{30}{t}\\end{array} \\) = K × 25 . . . . . . . . . . . . . . . . . . (2) \r\nDividing equation (1)  by (2), we have \\begin{array}{l}\\frac{\\frac{30}{5}}{\\frac{30}{t}}=\\frac{K \\times 30}{K\\times 25}\\end{array} \r\nTherefore, t = 6 mins.",
    "Detailed Solution": "Step 1) We first have to identify the key parameters, which are the initial temperature (90 C), the final temperature (10 C), the cooling time (5 minutes), and the surrounding temperature (20 C). Step 2) Newton's law of cooling states that the rate of change of temperature is proportional to the difference in temperatures between the object and the surrounding. Thus, we will consider the average temperature of the initial and final temperatures, which is (90C + 10C) / 2 = 50C. Step 3) The difference in temperature between the object and the surrounding is 50C - 20C = 30C. And the time it took to reach from 90C to 10C was 5 minutes. So we can write Newton's law of cooling as Change in temperature / Time = k*Δt, where k is a proportionality constant and Δt is the temperature difference. This gives us 30C / 5 min = k*30C, or k = 30C / 5 min / 30C. Step 4) Similarly, for the cooling from 60C to 30C, we first calculate the average temperature (60C + 30C) / 2 = 45C. The difference in temperature from the surrounding becomes 45C - 20C = 25C. For this case, we still don't know the time, so we denote it with t. We set up the same equation as before: Change in temperature / Time = k*Δt, or 30C / t = k*25C. Step 5) Now, we can compare these two conditions by dividing Equation 1 by Equation 2, which gives us 30C/5 min / 30C/t = 30C/25C. Cancelling out the similar terms, we can find the value of the unknown t, which comes out to be 6 minutes. Hence, it takes 6 minutes for the object to cool from 60C to 30C.",
    "Solution Outline": "Step 1) Identify the key given parameters: initial temperature, final temperature, cooling time and surrounding temperature. Step 2) Use Newton's law of cooling that states the rate of change of temperature is proportional to the difference between the object and surrounding temperatures. Step 3) Apply the law of cooling to the given cooling from 90C to 10C by first finding the average temperature and then the difference from the surrounding temperature. Divide this difference by the time to define the proportionality constant k. Step 4) Apply the law of cooling similarly to the temperature drop from 60C to 30C and set up an equation like the previous one, but this time with the unknown time t. Step 5) Solve for time t by comparing the two conditions through a ratio. That gives us t = 6 minutes, the time it takes to cool from 60C to 30C."
}