{
    "Question": "Q14: In a harbour, the wind is blowing at the speed of 72 km/h and the flag on the mast of a boat anchored in the harbour flutters along the N-E direction. If the boat starts moving at a speed of 51 km/h to the north, what is the direction of the flag on the mast of the boat? \r\n",
    "Original Solution": "Velocity of the boat = \\(\\begin{array}{l}v_{b}\\end{array} \\) = 51 km/h\r\nVelocity of the wind = \\(\\begin{array}{l}v_{w}\\end{array} \\) = 72 km/h\r\nThe flag is fluttering in the northeast direction. It shows that the wind is blowing towards the northeast direction. When the ship begins sailing toward the north, the flag will move along the direction of the relative velocity (\\(\\begin{array}{l}v_{wb}\\end{array} \\)) of the wind with respect to the boat.\r\n\r\nThe angle between \\(\\begin{array}{l}v_{w}\\end{array} \\) and \\(\\begin{array}{l}\\left (-v_{b} \\right )\\end{array} \\) = \\(\\begin{array}{l}90^{\\circ} + 45^{\\circ}\\end{array} \\)\r\n\\(\\begin{array}{l}\\tan \\beta = \\frac{51 \\sin \\left ( 90 + 45 \\right )}{72 + 51\\cos \\left ( 90 + 45 \\right )}\\end{array} \\)\r\n= \\(\\begin{array}{l}\\frac{51 \\sin 45}{72 + 51\\left ( -\\cos 45 \\right )}\\end{array} \\)\r\n= \\(\\begin{array}{l}\\frac{51 \\times \\frac{1}{\\sqrt{2}} }{72 – 51 \\times \\frac{1}{\\sqrt{2}}}\\end{array} \\)\r\n= \\(\\begin{array}{l}\\frac{51}{72\\sqrt{2} – 51}\\end{array} \\)\r\n= \\(\\begin{array}{l}\\frac{51}{72 \\times 1.414 – 51}\\end{array} \\)\r\n= \\(\\begin{array}{l}\\frac{51}{50.800}\\end{array} \\)\r\n= \\(\\begin{array}{l}\\tan ^{-1}\\left ( 1.0038 \\right )\\end{array} \\) = 45.11°\r\nAngle with respect to the east direction = 45.11° – 45° = 0.11°\r\nHence, the flag will flutter almost due east.",
    "Detailed Solution": "Step 1) Start by noting down the given values: velocity of the boat (v_b) is 51 km/h and velocity of the wind (v_w) is 72 km/h. Step 2) Next, form an intuition that when the boat moves north and the wind blows northeast, the direction of the flag will be determined by the resultant of the two velocities, i.e., the relative velocity of the wind with respect to the boat (v_wb). Step 3) Realise that the angle between v_w and -v_b is 90 degrees (north to east) + 45 degrees (east to northeast) which adds up to 135 degrees. Step 4) Use the formula for the resultant of two vectors, in which we relate the tangent of the angle beta (β) that v_wb makes with v_w (east) to the magnitudes of v_w and v_b and their angle via formula: tanβ = ((51 km/h)sin(90+45))/(72 km/h + (51 km/h)cos(90+45)). Step 5) Proceed to solve the equation. Remembering that the sine of 135 degrees equals cosine of 45 degrees and the cosine of 135 degrees equals -sine of 45 degrees. Then we have tanβ = (51km/h * sin45) / (72km/h - 51km/h*cos45). Step 6) Plug sin 45 and cos 45 as 1/√2 to proceed, i.e., tanβ = 51/(72*√2 - 51). Step 7) Substitute √2 as approximately 1.414 and divide to achieve tanβ = 51/50.800. Step 8) Compute arc tangent of this ratio to get the angle β in degrees, which is approximately 45.11 degrees. Step 9) However, since we have been calculating the angle with respect to East, the actual angle with respect to North will be 45 degrees (East to North) - our calculated angle (East to wind). Hence, we subtract 45 degrees to get 0.11 degrees. Step 10) This final result implies that the wind blows almost exactly East (relative to the boat), as its deviation from due East is just 0.11 degrees.",
    "Solution Outline": "Step 1) Identify the given values, velocity of the boat and the wind. Step 2) Understand the resultant velocity will determine the direction of the flag. Step 3) Add the angles due to the north direction of the boat and northeast direction of the wind. Step 4) Use the formula for the resultant of two particular vectors to calculate the direction of wind with respect to east. Step 5) Substitute for sin(135 degrees) and cos(135 degrees) by noting their relations with sin(45 degrees) and cos(45 degrees). Step 6) Substituting sin45 and cos45 as reciprocal of square root of 2. Step 7) Simplify √2 as approximately 1.414 to proceed further. Step 8) Calculate the arctan of the obtained ratio to get the approximate angle. Step 9) Subtract 45 degrees because we want the direction relative to the north instead of the east. Step 10) Interpret the meaning of the obtained angle."
}