{
    "Question": "Q11. Read each statement below carefully and state with reasons and examples, if it is true or false; A particle in one-dimensional motion(a) with zero speed at an instant may have non-zero acceleration at that instant(b) with zero speed may have non-zero velocity(c) with constant speed must have zero acceleration(d) with positive value of acceleration must be speeding up",
    "Original Solution": "(a) True\r\n(b) False\r\n(c) True (if the particle rebounds instantly with the same speed, it implies infinite acceleration, which is unphysical)\r\n(d) False (true only when the chosen positive direction is along the direction of motion)",
    "Detailed Solution": "Step 1) Let's consider each statement one at a time. The first statement is: 'A particle in one-dimensional motion with zero speed at an instant may have non-zero acceleration at that instant.' - We know that the acceleration of a particle is the rate of change of its velocity. Hence, even when the speed (the magnitude of velocity) is zero at an instant, the acceleration could be non-zero if the velocity of the particle is changing direction. For example, when you throw a ball up in the air, at its highest point the speed is zero, but it still has a downward acceleration due to gravity. So, this statement is true. Step 2) Next, 'A particle with zero speed may have non-zero velocity.' - Velocity is a vector quantity; it has both magnitude (speed) and direction. But if the speed is zero, the magnitude of velocity is zero. So it is impossible for a particle with zero speed to have non-zero velocity. So, this statement is false. Step 3) Now, consider 'A particle with constant speed must have zero acceleration.' - If a particle is moving at a constant speed, it means its speed is not changing with time. Acceleration is the rate of change of velocity with respect to time. If the velocity is not changing, then the acceleration must be zero. Further, even if the direction of motion changes but the speed remains the same, acceleration will be non-zero as velocity (which has direction) is changing, but such a case will be unphysical. Hence this statement is true. Step 4) Finally, 'A particle with positive value of acceleration must be speeding up.' - This statement depends on the chosen positive direction. If the positive direction is along the direction of motion and speed is increasing, then acceleration is positive and the particle is speeding up. However, if the positive direction is opposite to the direction of motion, then a positive acceleration could be slowing down the particle. Therefore, this statement is false.",
    "Solution Outline": "Step 1) Analyze the statement 'A particle in one-dimensional motion with zero speed at an instant may have non-zero acceleration at that instant'. Remember that acceleration is change in velocity, so even at zero speed, if there's change in velocity (like changing direction), acceleration can be non-zero; so the statement is true. Step 2) Look at 'A particle with zero speed may have non-zero velocity'. Velocity is speed with direction; thus, having speed of zero means velocity is also zero, making this statement false. Step 3) For 'A particle with constant speed must have zero acceleration', bear in mind that if speed doesn't change, its acceleration (rate of change of velocity) must be zero; so this statement is also true. Step 4) For the final statement 'A particle with positive value of acceleration must be speeding up', realize that the whether it speeds up or slows down depends on the direction of motion in relation to the positive direction; this could make the statement false."
}