{
    "Question": "5. An air bubble of volume 1.0 cm^3 rises from the bottom of a lake 40 m deep at a temperature of 12 C. To what volume does it grow when it reaches the surface, which is at a temperature of 35 C?",
    "Original Solution": "The volume of the air bubble, V1 = 1.0 cm^3\r\n= 1.0 x 10^-6 m^3\r\nAir bubble rises to height, d = 40 m\r\nThe temperature at a depth of 40 m, T1 = 120 C = 285 K\r\nThe temperature at the surface of the lake, T2 = 350 C = 308 K\r\nThe pressure on the surface of the lake\r\nP2 = 1 atm = 1.013 x 10^5 Pa\r\nThe pressure at a depth of 40 m\r\nP1= 1 atm + dρg\r\nWhere,\r\nρ is the density of water = 10^3 kg / m^3\r\ng is the acceleration due to gravity = 9.8 m/s^2\r\nHence,\r\nP1 = 1.013 x 10^5 + 40 x 10^3 x 9.8\r\nWe get,\r\n= 493300 Pa\r\nWe have\r\nP1V1 / T1 = P2V2 / T2\r\nWhere, V2 is the volume of the air bubble when it reaches the surface\r\nV2 = P1V1T2 / T1P2\r\n= 493300 x 1 x 10^(-6) x 308 / (285 x 1.013 x 10^5)\r\nWe get,\r\n= 5.263 x 10^(-6) m^3 or 5.263 cm^3\r\nHence, when the air bubble reaches the surface, its volume becomes 5.263 cm^3",
    "Detailed Solution": "Step 1) Firstly, we should recognize what's given in the problem. The initial volume of the air bubble, V1, is given as 1.0 cm^3. As we will deal with SI units in our equations, it's necessary to convert this to m^3 which gives us 1.0 x 10^-6 m^3. The air bubble rises from a depth, d, of 40 m in the lake. The initial temperature at this depth, T1, is 12 C. Converting this temperature to Kelvin, which is the SI unit for temperature, gives us 285 K. The surface temperature, T2, is given as 35 C, and converting to Kelvin gives us 308 K. Step 2) The pressure on the surface of the lake, P2, is given as 1 atm, and we convert this to the SI unit of pressure, Pascal, to get 1.013 x 10^5 Pa. To find the pressure 40 m underwater where the bubble forms, P1, we need to account for the pressure caused by the weight of the water above. This is calculated using the formula P1= 1 atm + dρg, where ρ is the density of water (10^3 kg / m^3) and g is the acceleration due to gravity (9.8 m/s^2). After calculating, we get P1 as 493300 Pa. Step 3) We use the ideal gas law equation P1V1 / T1 = P2V2 / T2, where V2 is, what we want to find - the volume of the air bubble when it reaches the surface. Rearranging the equation to solve for V2, we get V2 = P1V1T2 / T1P2. Plugging all known values into this equation yields V2 as 5.263 x 10^(-6) m^3, or, converting back to cm^3 for ease of understanding, 5.263 cm^3. This is the volume of the air bubble when it reaches the surface.",
    "Solution Outline": "Step 1) Identify and convert the known values. The given initial volume of the air bubble (V1) is 1.0 cm^3, convert to m^3. The depth from which the bubble rises (d) is 40 m. The initial temperature (T1) is 12 C, convert to K. The temperature at the lake surface (T2) is 35 C, convert to K. Step 2) Identify and calculate the pressures. The surface pressure (P2) is 1 atm, convert to Pa. The pressure at 40 m depth (P1) is calculated using the formula P1= 1 atm + dρg, substituting the values for density of water (ρ) and acceleration due to gravity (g), results in P1 as 493300 Pa. Step 3) Use the ideal gas law P1V1 / T1 = P2V2 / T2 to find the volume of the bubble at the surface (V2). Rearrange to solve for V2 giving V2 = P1V1T2 / T1P2. Using the calculated and given values, results in V2 being 5.263 x 10^(-6) m^3 or 5.263 cm^3."
}