{
    "Question": "Q.21. Answer the following questions based on the P-T phase diagram of carbon dioxide:(a) At what temperature and pressure can the solid, liquid and vapour phases of CO2 co-exist in equilibrium?(b) What is the effect of the decrease of pressure on the fusion and boiling point of CO2?(c) What are the critical temperatures and pressure for CO2? What is its significance?(d) Is CO2 solid, liquid or gas at (a) –70 °C under 1 atm, (b) –60 °C under 10 atm, (c) 15 °C under 56 atm?\r\n",
    "Original Solution": "(a) Liquid and vapour phases of CO2 co-exist at the triple point temperature = – 56.6 °C and pressure = 5.11 atm.\r\n(b) Both the boiling point and freezing point of CO2 decrease if pressure decreases.\r\n(c) The critical temperature and pressure of CO2 are 31.1C and 73.0 atm, respectively.\r\nAbove this temperature, CO2 will not liquefy, even if compressed to high pressures.\r\n(d) (a) vapour (b) solid (c) liquid",
    "Detailed Solution": "Step 1) Understanding the P-T phase diagram of CO2 requires recognizing the different regions of the graph which correspond to different phases of CO2: solid, liquid, and gas, as well as the lines that represent phase changes. It also includes points such as the triple point, where all three phases can exist in equilibrium, and the critical point, beyond which gas and liquid phases become indistinguishable. Step 2) The triple point of CO2, where solid, liquid, and gas coexist, is identified on the phase diagram at a specific temperature and pressure. In this case, the triple point occurs at -56.6°C and 5.11 atm. Step 3) The phase diagram also indicates that the fusion (melting) and boiling points of CO2 decrease as pressure decreases. This is because reducing the pressure reduces the kinetic energy of the molecules, leading to changes in phase at lower temperatures. Step 4) The critical temperature and pressure can be found, which is the point beyond which the liquid and gas phases of a substance become indistinguishable. For CO2, these are 31.1°C and 73 atm respectively. Above this temperature, and regardless of pressure, CO2 behaves as a gas due to the kinetic energy of its molecules being too high for them to be forced into a liquid state. Step 5) Finally, we can use this understanding of the phase diagram to determine the phase of CO2 at different temperatures and pressures. At -70°C and 1 atm, CO2 is a gas (below the line of sublimation). At -60°C and 10 atm, CO2 is solid (located in the solid area of the diagram). At 15°C and 56 atm, CO2 is a liquid (located in the liquid area of the diagram).",
    "Solution Outline": "Step 1) Understand the P-T phase diagram of CO2, including the different regions for solid, liquid, and gas phases, and the lines and points representing phase transitions. Step 2) Identify the triple point on the diagram, where all three phases coexist, in this case at -56.6°C and 5.11 atm. Step 3) Recognize that the fusion and boiling points of CO2 on the diagram reduce as pressure decreases. Step 4) Locate the critical temperature and pressure, the point beyond which liquid and gas phases become indistinguishable, here at 31.1°C and 73 atm. Above this temperature, CO2 cannot be liquefied, regardless of pressure. Step 5) Determine the phase of CO2 at given temperatures and pressures using the diagram: at -70°C and 1 atm it is a gas, at -60°C and 10 atm it is a solid, and at 15°C and 56 atm it is a liquid."
}