{
    "Question": "11.  A body constrained to move along the z-axis of a coordinate system is subject to a constant force F given by\r\n\\(\\begin{array}{l}F =-\\hat{i}+2\\hat{j}+3\\hat{k}\\end{array} \\) N\r\nwhere i, j, k, are unit vectors along the x- y- and z-axis of the system, respectively. What is the work done by this force in moving the body at a distance of 4 m along the z-axis?",
    "Original Solution": "The body is displaced by 4 m along the z-axis.\r\n \r\nWork done,\r\nW = \\(\\begin{array}{l}\\vec{F}.\\vec{S} = (0\\hat{i}+0\\hat{j}+4\\hat{k})(-\\hat{i}+2\\hat{j}+3\\hat{k})\\end{array} \\)\r\n\r\n= \\(\\begin{array}{l}12(\\hat{k}.\\hat{k})\\end{array} \\) J = 12 J",
    "Detailed Solution": "Step 1) The problem states that a body is moving along the z-axis under the influence of a force F given as F = -i +2j +3k N. This force is a vector and i, j, k represent the unit vectors along the x-, y- and z-axis, respectively.\n\nStep 2) It is specified that the body moves a distance of 4 meters along the z-axis, the body is displaced by 4 m. We have to find out the work done during this movement, which is given by the dot product of the force vector and the displacement vector. \n\nStep 3) The displacement occurred only in the z-direction, meaning there is no displacement in the x and y directions. So, we express this displacement as a vector, S, as 0i + 0j + 4k.\n\nStep 4) To calculate the work done, we have to calculate the dot product of the force vector and the displacement vector. This results in W = F.S = (0i + 0j + 4k) . (-i +2j +3k) N. \n\nStep 5) The dot product essentially takes the product of the components of the vectors along the three respective axes and adds them up. While multiplying, the x and y components result in zero (as their corresponding displacement is zero) and only the product of the z components remains. The result is 12(k.k) which, by definition of dot product, turns into 12, as the dot product of a unit vector by itself is always 1.\n\nStep 6) Therefore, the work done by the force on the body as it moved 4 meters along the z-axis, is 12 Joules.",
    "Solution Outline": "Step 1) Extract the given force vector (-i +2j +3k N) from the problem.\n\nStep 2) Determine the displacement vector by acknowledging the movement of 4 meters along the z-axis (0i + 0j + 4k).\n\nStep 3) Realize that the work done could be found through the dot product of the force and displacement vectors.\n\nStep 4) Calculate the dot product of the vectors. You essentially multiply components of each vector along the same axis and sum up the products. \n\nStep 5) Get the work done as 12 Joules, which is the result of the product of z-components of force and displacement vectors."
}