{
    "Question": "13. A man of mass 70 kg, stands on a weighing machine in a lift, which is moving\r\n(a) upwards with a uniform speed of 10 ms^(-1).\r\n(b) downwards with a uniform acceleration of 5 ms^(-2).\r\n(c) upwards with a uniform acceleration of 5 ms^(-2).\r\nWhat would be the readings on the scale in each case?\r\n(d) What would be the reading if the lift mechanism failed and it hurtled down freely under gravity?",
    "Original Solution": "Mass of the man, m = 70 kg,\r\ng = 10 m/s^2\r\nThe weighing machine in each case measures the reaction R, i.e., the apparent weight.\r\n(a) When the lift moves upwards with a uniform speed of 10 m/s, it’s acceleration= 0.\r\nR = mg = 70 x 10 = 700 N\r\n(b) Lift moving downwards with a = 5 ms^(-2)\r\nUsing Newton’s second law of motion, the equation of motion can be written as\r\nR+mg = ma\r\nR = m (g – a) = 70 (10 – 5) = 350 N\r\n(c) Lift moving upwards with a = 5 ms^(-2)\r\nR = m (g + a) = 70 (10 + 5) = 1050 N\r\n(d) If the lift were to come down freely under gravity, downward . a = g\r\nR = m(g -a) = m(g – g) = 0\r\nThe man will be in a state of weightlessness",
    "Detailed Solution": "Step 1) Identify the known values. In this problem, the mass of the man (m) is given as 70 kg, the gravity (g) is provided to be 10 m/s^2, and the velocity or acceleration under different scenarios is also provided. Step 2) Understand that what the weighing machine measures in this scenario is the reaction or the apparent weight of the man in the lift. Step 3) In case (a) where the lift is moving upwards with a uniform speed of 10 m/s, the acceleration (a) becomes 0 because the speed is constant. Hence, to calculate the reading (R) on the weighing machine, the formula R = mg is used, which gives 70 kg * 10 m/s^2 = 700 N. Step 4) In case (b), where the lift is moving downwards with an acceleration of 5 m/s^(-2), we apply Newton's second law of motion. The equation of motion becomes R+mg = ma. To isolate R, we rearrange the equation as, R = m (g - a), and plug in the values to get R = 70 kg*(10 m/s^2 - 5 m/s^2) = 350 N. Step 5) In case (c), where the lift is moving upwards with an acceleration of 5 m/s^(-2), using the same Newton's law, the equation of motion is the same as in Step 4, but the weight increases instead of decreasing due to the upward acceleration. We calculate R = m (g + a), plug in the values to obtain R = 70 kg*(10 m/s^2 + 5 m/s^2) = 1050 N. Step 6) In case (d), where the lift is in freefall under gravity (that is acceleration becomes equal to the gravitational pull, a=g), the man is weightless. Hence, calculating with our equation from previous steps, R = m (g - a), it becomes R = 70 kg*(10 m/s^2 - 10 m/s^2) = 0. Because the acceleration exactly matches the force of gravity, the scale reads as 0, meaning the man is effectively weightless.",
    "Solution Outline": "Step 1) Recognize the known values which are the mass of the man, gravity and the changing value of velocity or acceleration. Step 2) Understand the principle that the weighing machine measures the apparent weight. Step 3) Apply the formula for weight (R = mg) when the lift is moving at a consistent speed, which means no acceleration. Step 4) When the lift is accelerating downwards, use Newton's 2nd law of motion (R + mg = ma), rearrange terms to solve for R (R = m (g - a)), and calculate the reading on the scale. Step 5) Similarly, when the lift is accelerating upwards, still use Newton's law, but remember that acceleration increases the effective weight (R = m (g + a)), and calculate accordingly. Step 6) When the lift is in freefall, the individual appears weightless on the scale. Use the formula from Step 4, but understand a equals g, so R equals zero."
}