{
    "Question": "11. A metre-long narrow bore held horizontally (and closed at one end) contains a 76 cm long mercury thread, which traps a 15 cm column of air. What happens if the tube is held vertically with the open end at the bottom?",
    "Original Solution": "Length of the narrow bore, L = 1 m = 100 cm\r\nLength of the mercury thread, l = 76 cm\r\nLength of the air column between mercury and the closed end, la = 15 cm\r\nSince the bore is held vertically in the air with the open end at the bottom, the mercury length that occupies the air space is\r\n= 100 – (76 + 15)\r\n= 9 cm\r\nTherefore,\r\nThe total length of the air column = 15 + 9 = 24 cm\r\nLet h cm of mercury flow out as a result of atmospheric pressure.\r\nSo,\r\nLength of the air column in the bore = 24 + h cm\r\nAnd,\r\nLength of the mercury column = 76 – h cm\r\nInitial pressure, V1 = 15 cm^3\r\nFinal pressure, P2 = 76 – (76 – h)\r\n= h cm of mercury\r\nFinal volume, V2 = (24 + h) cm^3\r\nThe temperature remains constant throughout the process.\r\nTherefore,\r\nP1V1 = P2V2\r\nOn substituting, we get\r\n76 x 15 = h (24 + h)\r\nh2 + 24h – 11410 = 0\r\nSolving further, we get\r\n= 23.8 cm or -47.8 cm\r\nSince height cannot be negative. Hence, 23.8 cm of mercury will flow out from the bore.\r\nLength of the air column = 24 + 23.8 = 47.8 cm",
    "Detailed Solution": "Step 1) Start by identifying the important values given in the problem, the length of the entire bore tube is stated as 1 meter, but for this problem, we will convert it to 100 cm to keep consistent units. The mercury thread and air column lengths are given as 76 cm and 15 cm, respectively. Step 2) Consider the scenario when the tube is held vertical with its open end at the bottom. We need to find the effectiveness of the trapped air space which is obtained from the total length of the bore tube decreased by both the mercury thread and air column. This will result in a 9 cm void. Step 3) Additionally, when held vertically, the length of the air column will increase by these 9 cm, totaling 24 cm. Step 4) Consider an unknown amount 'h' cm of mercury displaced due to atmospheric pressure. This will alter both the air and the mercury column lengths to 24 + h cm and 76 - h cm respectively. Step 5) Now correlate everything using Boyle's law (P1V1 = P2V2) which applies here since temperature is constant throughout the process. The initial pressure corresponds to 15 cm (taking one dimension length as the volume) and the final pressure (P2) is obtained given the final height of the mercury column, which is meant by h cm. The final volume (V2) is the final length of the air column which comes out to (24 + h) cm. Step 6) Substituting these values into the Boyle's law equation gives us a quadratic equation in terms of 'h'. Step 7) Using basic algebraic knowledge, solve the quadratic equation to find 'h'. We obtain the two roots, 23.8 cm or -47.8 cm. Step 8) Since 'h', representing a length, can't be negative, discard the negative value, so 23.8 cm of mercury flows out. Step 9) Add this value to the length of the air column calculated in Step 3, so we get our final air column length as 47.8 cm.",
    "Solution Outline": "Step 1) Identify the given data and convert length to a uniform measure (cm). Step 2) Consider the tube held vertically, verify how much space the air and mercury occupy. Step 3) Determine the new length of the air column when the tube is vertical. Step 4) Acknowledge that an unknown amount 'h' cm of mercury will be influenced due to atmospheric pressure, thus modifying the lengths of both the air and the mercury column. Step 5) Apply Boyle's Law, implying a constant temperature to build an equation using the given and new circumstances. Step 6) Solve for 'h' by substituting the lengths of the present air and mercury columns into the equation. Step 7) Resolve the quadratic equation of 'h'. Step 8) Recognize 'h' as a length, and hence discard the negative root. Determine the amount of mercury displaced. Step 9) Add this value to the initially calculated length of the air column to get the final answer."
}