{
    "Question": "1. Give the location of the centre of mass of a (i) sphere, (ii) cylinder, (iii) ring, and (iv) cube, each of uniform mass density. Does the centre of mass of a body necessarily lie inside the body?",
    "Original Solution": "All the given structures are symmetric bodies having a very uniform mass density. Thus, for all the above bodies, their centre of mass will lie in their geometric centres.\r\nIt is not always necessary for a body’s centre of mass to lie inside it; for example, the centre of mass of a circular ring is at its centre.\r\n",
    "Detailed Solution": "Step 1) We need to find the centre of mass for a sphere, cylinder, ring, and cube. Here, it is important to understand what the centre of mass means. The centre of mass is a precise point in an object around which its mass is equally balanced or distributed. This would be in the center of the object if its mass is uniformly dispersed everywhere. Step 2) Since the masses distributed in these given shapes (sphere, cylinder, ring, and cube) are uniform, their mass is uniformly spread out. Step 3) This means that the distribution of mass in each shape is symmetric. Therefore, we can conclude that the centre of mass for these symmetric items is in their respective geometric centres. Step 4) Moving on to whether the centre of mass of a body necessarily lies inside the body, it's important to recognize that this is not always the case. The location of the centre of mass is dependent on the distribution of matter within the body. As a concrete case, consider a hollow circular ring. The mass is uniformly distributed along its circumference, but there's no mass in its geometric centre. Yet the center of the circular ring, where no mass exists, is still its centre of mass. This is because the centre of mass accounts for the distribution of the mass within the object but does not necessarily coincide with physical matter.",
    "Solution Outline": "Step 1) Understand the concept of centre of mass as a point where an object's mass is evenly spread out. Step 2) Note that the sphere, cylinder, ring, and cube have uniform mass which means the mass is evenly distributed. Step 3) Conclude that the centre of mass is at the geometric centre of these shapes because of the symmetric distribution of their mass. Step 4) Recognize that it is not always necessary for the centre of mass of a body to be located inside it, for instance, in a hollow circular ring, the centre of mass is at the geometric centre where there's no actual mass."
}