{
    "Question": "Q14. A string clamped at both ends is stretched out, it is then made to vibrate in its fundamental mode at a frequency of 45 Hz. The linear mass density of the string is 4.0 × 10^-2 kg/ m, and its mass is 2 × 10^-2 kg. Calculate:\r\n(i) The velocity of a transverse wave on the string\r\n(ii) The tension in the string",
    "Original Solution": "Given,\r\nMass of the string, m = 2 x 10^-2 kg\r\nLinear density of the string = 4 x 10^-2 kg\r\nFrequency, vF = 45 Hz\r\nWe know the length of the wire = m/µ\r\n= (2 x 10^-2)/ (4 x 10^-2) = 0.5 m\r\nWe know, λ = 2l/n\r\nWhere, n = number of nodes in the wire.\r\nFor the fundamental node, n =1\r\n=> λ = 2l\r\n= 2 x 0.5 = 1m\r\n(i) Therefore, the speed of the transverse wave, v = λ vF\r\n= 1 x 45 = 45 m/s.\r\n(ii) Tension in the string = µ v^2\r\n= 4 x10^-2 x 45 = 81",
    "Detailed Solution": "Step 1) Start by noting the given values from the problem. The mass of the string is 2 x 10^-2 kg, its linear mass density is 4 x 10^-2 kg/m, and the frequency at which it vibrates in its fundamental mode is 45 Hz. \n\nStep 2) First, you need to calculate the length of the string. This is done using the formula l = m/µ, where m is the mass and µ is the linear density of the string. Substituting the given values into the formula gives l = (2 x 10^-2) / (4 x 10^-2) = 0.5 m. It's an important property of the string that also determines how the waves move on it.\n\nStep 3) Next, you need to determine the wavelength of the wave produced when the string is vibrating in its fundamental mode. This can be calculated using the formula λ = 2l/n, where l is the length of the string and n is the number of nodes (regions of zero displacement on a standing wave). In the fundamental, or first mode, there is only one node (n = 1), so the wavelength is λ = 2 * l = 2 * 0.5 = 1 m. The wavelength also describes the distance between repeating units of a wave pattern.\n\nStep 4) Now that you have the wavelength, you can calculate the speed of the transverse wave. The formula to use here is v = λ vF, where vF is the frequency and λ is the wavelength. Substituting in the given and calculated values gives: v = 1 x 45 = 45 m/s. The speed of the wave tells you how fast a point on the wave (like a crest) is moving.\n\nStep 5) Finally, to determine the tension in the string, you can use the equation T = µ v^2, where µ is the linear mass density and v is the speed of the wave. Plugging in the given and calculated values gives: T = 4 x10^-2 x 45^2 = 81 N. Tension is the pulling force transmitted along the string.",
    "Solution Outline": "Step 1) Begin by noting the given values in the question: mass, linear mass density, and frequency of vibration. \n\nStep 2) Use the equation for length of the string (l = m/µ) to calculate its length. This value is crucial as it determines the behavior of waves on the string.\n\nStep 3) Calculate the wavelength of the fundamental mode wave using λ = 2l/n. For the fundamental node, we know n = 1. The wavelength describes the length of one full wave cycle. \n\nStep 4) Find the speed of the transverse wave using the equation v = λ vF. Here, you are simply multiplying the wavelength by the frequency.\n\nStep 5) Compute the string tension using the equation T = µ v^2. This provides the force that's being transmitted along the length of the vibrating string."
}