{
    "Question": "24. A body describes simple harmonic motion with an amplitude of 5 cm and a period of 0.2 s. Find the acceleration and velocity of the body when the displacement is (a) 5 cm (b) 3 cm (c) 0 cm.",
    "Original Solution": "Amplitude = 5 cm = 0.05 m\r\nTime period = 0.2 s\r\nWhen the displacement is y, then\r\nacceleration, A = -ω2y\r\nVelocity, \\(\\begin{array}{l}v = \\omega \\sqrt{r^{2}-y^{2}}\\end{array} \\)\r\n\r\nω = 2π/T\r\n= 2π/0.2 = 10π rad/s\r\n(a) When the displacement y = 5 cm = 0.05 m\r\nAcceleration, A = – (10π)2(0.05) = 5π2 m/s2\r\nVelocity, \\(\\begin{array}{l}V = 10\\pi \\sqrt{(0.05)^{2}-(0.05)^{2}}=0\\end{array} \\)\r\n\r\n(b) When the displacement y = 3 cm = 0.03 m\r\nAcceleration, A = – (10π)2(0.03) = 3π2 m/s2\r\nVelocity, \\(\\begin{array}{l}V = 10\\pi \\sqrt{(0.05)^{2}-(0.03)^{2}}=10\\pi \\times 0.04 = 0.4\\pi m/s\\end{array} \\)\r\n\r\n(c) When the displacement y = 0\r\nAcceleration, A =  – (10π)2(0) = 0\r\nVelocity, \\(\\begin{array}{l}V = 10\\pi \\sqrt{(0.05)^{2}-(0)^{2}}=10\\pi \\times 0.05 = 0.5\\pi m/s\\end{array} \\)\r\n",
    "Detailed Solution": "Step 1) Our task is to find the acceleration and velocity of a body which describes simple harmonic motion with given parameters. We start with identifying our known variables. We have the amplitude as 5 cm which we convert to meters for consistency, giving us 0.05 m. We also know the time period is 0.2 s. Step 2) We need to remember the key formulas for acceleration and velocity for harmonic motion. The acceleration formula is A = -ω²y, and the velocity formula is v = ω√(r²-y²). Here, y is the displacement, ω represents angular velocity, and r is the amplitude. Step 3) We calculate ω, which is the angular velocity, using ω = 2π/T. Plugging in the time period, T = 0.2 s, we get ω = 10π rad/s. Step 4) For each of the 3 cases, we use the given displacement (the y in our formulas) and calculate acceleration and velocity. (a) With y = 5 cm = 0.05 m, the displacement is equal to the amplitude. Substituting these values into the acceleration equation yields A = -(10π)²*(0.05) = 5π² m/s². Plugging the same values into the velocity equation, we find that v = 0, as the square root term equals zero. (b) For y = 3 cm = 0.03 m, the displacement is less than the amplitude. Using the same procedure, we find A = - (10π)²*(0.03) = 3π² m/s² and v = 10π*√((0.05)²-(0.03)²) = 10π*0.04 = 0.4π m/s. (c) Finally, for y = 0, the displacement is zero, so acceleration is also zero (since the displacement term in the acceleration formula become zero). However, velocity for this scenario is not zero (as the displacement term is subtracted in the velocity formula). Plugging in the values, we get v = 10π*√((0.05)²-0) = 10π*0.05 = 0.5π m/s.",
    "Solution Outline": "Step 1) Identify the given quantities: amplitude (r = 0.05 m) and time period (T = 0.2 s). Step 2) Recall the formulas for acceleration (A = -ω²y) and velocity (v = ω√(r²-y²)) in simple harmonic motion. Step 3) Find the angular velocity (ω = 2π/T). Since T = 0.2 s, ω = 10π rad/s. Step 4) For each case (a, b, c), substitute the given displacement for y (in meters) and the calculated ω into the acceleration and velocity formulas. For case (a), y = r = 0.05 m. As a result, acceleration is 5π² m/s², but velocity is zero due to the square root term in the velocity formula. For case (b), y = 0.03 m. Acceleration is 3π² m/s², and velocity is 0.4π m/s. For case (c), y = 0. As a result, acceleration is zero, but velocity is 0.5π m/s."
}