{
    "Question": "Q.19. Explain why:\r\n(a) a body with large reflectivity is a poor emitter.\r\n(b) a brass tumbler feels much colder than a wooden tray on a chilly day.\r\n(c) an optical pyrometer (for measuring high temperatures) calibrated for ideal black body radiation gives too low a value for the temperature of a red-hot iron piece in the open but gives a correct value for the temperature when the same piece is in the furnace.\r\n(d) the earth without its atmosphere would be inhospitably cold.\r\n(e) heating systems based on the circulation of steam are more efficient in warming a building than those based on the circulation of hot water.",
    "Original Solution": "(a) A body with a large reflectivity is a poor absorber of heat radiation. A poor absorber will be a poor emitter of radiation. Therefore, a body with a large reflectivity is a poor emitter.\r\n(b) Brass is a good conductor of heat, and wood is a poor conductor of heat. When we touch a brass tumbler, heat is conducted from our hand to the tumbler, and there is a drop in the body temperature; therefore, we feel cold.  When a wooden tray is touched on a chilly day, very less heat is conducted from the hand to the wooden tray, and body temperature is not decreased much. So we do not feel cold.\r\n(c) The radiation energy from a red-hot iron piece placed in a furnace is given by the relation\r\nE=σT4\r\nWhen the iron piece is placed in the open, the radiation energy is given by the relation\r\nE=σ(T4−T04)\r\nHere, E is the energy radiation.\r\nT is the temperature of the optical pyrometer.\r\nσ is a constant.\r\nT0 is the temperature of the open space.\r\nThe increase in the temperature of the open space reduces the radiation energy.\r\n(d)  If there is no atmosphere, extra heat will not be trapped. All the heat from the sun will be radiated back from the surface of the earth. So without the atmosphere, the earth would be inhospitably cold.\r\n(e) Steam at 100 0C is much hotter than water at 100 0C. This is because steam will have a lot of heat in the form of latent heat (540 cal/g).  Therefore, heating systems based on the circulation of steam are more efficient in warming a building than those based on the circulation of hot water.",
    "Detailed Solution": "Step 1) Consider the body with large reflectivity. Recall that reflectivity refers to the amount of light or heat that a surface can reflect back. This would mean that such a body absorbs less heat or light since most of it is reflected back. Now, according to Kirchhoff's law, the absorption coefficient and emission coefficient are equal. Hence, if a body is a poor absorber of heat, it will also be a poor emitter of heat. Thus, a body with a large reflectivity is a poor emitter. Step 2) Discuss the difference between touching a brass tumbler and a wooden tray on a chilly day. Brass is a good conductor of heat, meaning it allows heat to pass through it easily. When you touch the brass tumbler, heat from your hand is quickly conducted to the brass, making your hand feel colder as heat leaves your body. Conversely, wood is a poor conductor of heat, so less heat is transferred from your hand to the wooden tray. Your hand maintains its body temperature better and doesn't feel as cold as when touching the brass. Step 3) Understand the operation of an optical pyrometer. This device is used to measure the temperature of a body by detecting the intensity of the radiation it emits. When the pyrometer is calibrated for ideal black body radiation, it assumes no heat is being absorbed by the surrounding atmosphere. However, if we measure the temperature of a red-hot iron piece placed in the open, the open atmosphere will absorb some of the radiation, thereby decreasing the observed intensity of the radiation. This results in a lower measured temperature than the actual temperature of the iron piece. On the other hand, when the same iron piece is in a furnace, the influence of the surrounding atmosphere is negligible and the pyrometer gives a correct reading. This is explained through the equations E=σT4 for the furnace condition and E=σ(T4−T04) for the open condition, where E is energy radiation, T is the temperature measured by the pyrometer, σ is a constant, and T0 is the temperature of the open space. Step 4) Contemplate the earth without its atmosphere. Remember that the earth's atmosphere traps heat, preventing some of it from radiating back out into space and thereby warming the earth. If the earth did not have an atmosphere, it would not trap this heat, and all heat from the sun would be radiated back from the surface of the earth, leaving the earth exceedingly cold. Step 5) Compare heating systems based on hot water circulation and steam circulation. Steam is at a higher energy state than water at the same temperature due to its high latent heat (540 cal/g). This makes steam-based heating systems more efficient in warming a building than those based on circulating hot water.",
    "Solution Outline": "Step 1) Understand the correlation between reflectivity, absorptivity, and emissivity of a body. A body with large reflectivity reflects more and absorbs less. If a body is a poor absorber, it will also be a poor emitter according to Kirchhoff's law. Step 2) Differentiate between good and poor conductors of heat. Brass, a good conductor, absorbs heat from your hand quickly making your hand feel colder. Wood, being a poor conductor, absorbs less heat from your hand, resulting in less decrease in hand temperature. Step 3) Discuss the functioning of an optical pyrometer in different conditions. In an open atmosphere, some heat is absorbed by the surroundings, leading to a lower reading on the pyrometer, whereas, in a furnace, negligible heat is absorbed by the surroundings, and the pyrometer reading is accurate. The difference is explained by the equations E=σT4 and E=σ(T4−T04). Step 4) Recognize the role of the earth's atmosphere in maintaining the planet's temperature. Without an atmosphere, the earth would not trap heat, all sun's heat would be radiated back, resulting in a frigid earth. Step 5) Recognize the higher energy state of steam compared to water at the same temperature. Steam contains more heat in the form of latent heat, thus steam-based heating systems are more efficient than water-based heating systems for warming buildings."
}