{
    "Question": "39. A 70 kg man stands in contact against the inner wall of a hollow cylindrical drum of radius 3 m rotating about its vertical axis with 200 rev/min. The coefficient of friction between the wall and his clothing is 0.15. What is the minimum rotational speed of the cylinder to enable the man to remain stuck to the wall (without falling) when the floor is suddenly removed?",
    "Original Solution": "Mass of the man, m = 70 kg\r\nRadius of the drum, r = 3 m\r\nCoefficient of friction between the wall and his clothing, μ = 0.15\r\nNumber of revolution of hollow cylindrical drum = 200 rev/min= 200/60 = 10/3 rev/s\r\nThe centripetal force required is provided by the normal N of the wall on the man\r\nN = mv^2/R = mω^2R\r\nWhen the floor revolves, the man sticks to the wall of the drum. Hence, the weight of the man (mg) acting downward is balanced by the frictional force acting vertically upwards.\r\nThe man will not fall if mg ≤ limiting frictional force fe (μN)\r\nmg ≤ μN\r\nmg ≤ μ (mω^2R)\r\nω^2 ≥ g/Rμ\r\nTherefore, for minimum rotational speed of the cylinder\r\nω^2 = g/Rμ = 10/(0.15 x 3) = 22. 2\r\nω =√22.2 = 4.7 rad/s",
    "Detailed Solution": "Step 1) Start by noting down the quantities given in the problem. The mass of the man is 70 kg, the radius of the drum is 3 m, and the coefficient of friction between the man's clothes and the wall is 0.15. The cylinder is initially rotating at 200 rev/min. \n\n  Step 2) Convert the given rotation speed of the cylinder from rev/min to rev/s. We do this by dividing by 60 since there are 60 seconds in a minute. This gives us a speed of 10/3 rev/s. \n\n  Step 3) We should recognize that the force keeping the man in place against the wall as the floor is removed is the centripetal or 'center-seeking' force, which causes an object moving in a circular path to constantly accelerate towards the center of the circle. This force is given by the equation mω^2R, where m is the mass of the object, ω is the angular velocity in rad/s, and R is the radius of the circle. \n\n  Step 4) When the floor of the drum is removed, the man still won't fall as long as his weight (mg) is equal to or less than the frictional force pulling him up. The maximum amount of frictional force (fe) that can occur is equal to the product of the normal force (N) and the static friction coefficient (μ), or fe = μN. \n\n  Step 5) Because the man is not falling, we know that his weight cannot exceed the limiting frictional force. In terms of the centripetal force equation from Step 3 and the frictional force equation from Step 4, this gives us the inequality mg ≤ μmω^2R.\n\n  Step 6) We can now solve the inequality for ω, the angular velocity. We first cancel the mass from both sides to get g ≤ μω^2R. Then, we divide both sides by μ and R to get ω^2 ≥ g/(μR). Taking the square root of both sides, and noting that we want the minimum ω for which the inequality holds, we find that ω must be equal to or greater than the square root of g/(μR), or ω ≥ √(g/(μR)).\n\n  Step 7) Plugging in the given values, we find that the minimum ω = √(10/(0.15 x 3)) ≈ 4.7 rad/s. So, in order for the man to remain stuck to the wall and not fall, the cylinder must rotate at a minimum speed of 4.7 rad/s.",
    "Solution Outline": "Step 1) Write down the given quantities of mass, radius of circle, coefficient of friction and rotation speed. \n\n  Step 2) Convert the rotation speed from rev/min to rev/s for standard units. \n\n  Step 3) Apply the concept of centripetal force given by mω^2R knowing that this force keeps the man against the wall as the floor is removed. \n\n  Step 4) Consider the limiting case where the man's weight is equal to the maximum frictional force possible, given by fe = μN. \n\n  Step 5) Equate the man's weight and maximum possible frictional force to get an inequality in terms of the angular velocity ω, mg ≤ μmω^2R.\n\n  Step 6) Solve the inequality for ω to get that the angular velocity must be equal to or greater than the square root of g/(μR), or ω ≥ √(g/(μR)).\n\n  Step 7) Input the given values to find the minimum speed the cylinder must rotate at for the man to remain pressed to the wall, resulting in ω ≈ 4.7 rad/s."
}