{
    "Question": "23. Explain why\r\n(a) a horse cannot pull a cart and run in empty space\r\n(b) passengers are thrown forward from their seats when a speeding bus stops suddenly\r\n(c) it is easier to pull a lawnmower than to push it\r\n(d) a cricketer moves his hands backwards while holding a catch",
    "Original Solution": "The horse pushes the ground with a certain force when it pulls the cart. By applying the third law of motion, the ground will exert an equal and opposite reaction force upon the feet of the horse. This causes the horse to move forward. In empty space, the horse will not experience a reaction force. Therefore, the horse cannot pull the cart in empty space.\r\nDue to inertia of motion. When a bus stops all of a sudden, the lower part of a person’s body that is in contact with the seat comes to rest suddenly but the upper part will continue to be in motion. As a result, the person’s upper half of the body is thrown forward in the direction of the motion of the bus.\r\nWhen the lawnmower is pulled, the vertical component of the applied force acts upwards. This reduces the effective weight of the lawnmower. When the lawn mower is pushed, the vertical component acts in the direction of the weight of the mower. Therefore, there is an increase in the weight of the mower. So, it is easier to pull a lawnmower than to push it.\r\nWhen the batsman hits the ball, the ball will have a large momentum. When he moves his hands backwards the time of impact is increased contact, so the force is reduced.",
    "Detailed Solution": "Step 1) Let's analyze why a horse cannot pull a cart and run in empty space. The major concept involved here is Newton's third law of motion which states 'for every action there is an equal and opposite reaction'. As a horse tries to pull a cart, it pushes the ground backward with a certain force. Due to Newton's third law, the ground exerts an equal and opposite force on the horse's feet propelling it forward. In empty space, there's no ground to push against, so no opposite force is generated to help the horse move forward, hence it could not pull a cart there.\n\nStep 2) Now let's consider why passengers are thrown forward from their seats when a speeding bus stops suddenly. This involves the concept of 'Inertia of Motion', a property of matter by which it continues in its existing state of rest or uniform motion unless that state is changed by an external force. When the bus stops abruptly, the lower part of a person's body connected to the seat, halts, but the upper part wanting to continue its motion due to inertia, moves forwards. Resulting in a passenger being thrown forward.\n\nStep 3) Next, why it's easier to pull a lawnmower than to push it. When pulling a lawnmower, the vertical component of the force applied acts upward, lowering the effective weight of the lawnmower. On the contrary, while pushing, the vertical component of the force applied acts downward, increasing the mower's effective weight. Hence, it is easier to pull than to push a lawnmower.\n\nStep 4) Finally, let's understand the need for a cricketer to move his hands backward while catching a ball. The momentum of a cricket ball is significantly high when hit by a batsman. When the cricketer moves his hands backwards, the time of contact between the hands and the ball is increased. According to the Physics principle, force is inversely proportional to time (F = m*deltaV/deltaT), if contact time is increased, the force experienced decreases. This reduces the stinging effect while the cricketer catches the high momentum cricket ball.",
    "Solution Outline": "Step 1) Newton's third law of motion is involved while a horse pulls a cart. The horse applies force on the ground, and due to the law, the ground applies an equal and opposite force that moves the horse forward. In empty space, there's no such thing to exert the reaction force on, hence the horse can't move.\n\nStep 2) The principle of inertia applies when a bus stops suddenly. The lower part of passengers' bodies stop with the bus, but the upper part retains its forward motion due to inertia, causing passengers to be thrown forward.\n\nStep 3) When pulling a lawnmower, the vertical force component acts upward, reducing the effective weight of the lawnmower. Conversely, when pushing, the vertical force component acts downward, increasing the effective weight of the lawnmower.\n\nStep 4) A cricketer moves his hands backward while catching a ball to increase the contact time, hence decreasing the force exerted on his hands. This stems from the physics principle that force is inversely proportional to time."
}