{
    "Question": "Q9. Two towns, A and B, are connected by regular bus service, with a bus leaving in either direction every T minutes. A man cycling with a speed of 20 km h^–1 in the direction A to B notices that a bus goes past him every 18 min in the direction of his motion and every 6 min in the opposite direction. What is the period T of the bus service, and with what speed (assumed constant) do the buses ply on the road? \r\n",
    "Original Solution": "Speed of each bus = Vb\r\nSpeed of the cyclist = Vc = 20 km/h\r\nThe relative velocity of the buses plying in the direction of motion of the cyclist is Vb – Vc.\r\nThe buses playing in the direction of motion of the cyclist go past him after every 18 minutes, i.e. (18/60) s.\r\nDistance covered = (Vb – Vc ) x 18/60\r\nSince the buses are leaving every T minutes. Therefore, the distance is equal to Vb x (T/60)\r\n(Vb – Vc ) x 18/60 = Vb x (T/60) ——(1)\r\nThe relative velocity of the buses plying in the direction opposite to the motion of the cyclist is Vb + Vc\r\nThe buses go past the cyclist every 6 minutes, i.e. (6/60) s.\r\nDistance covered = (Vb + Vc ) x 6/60\r\nTherefore, (Vb +Vc ) x 6/60 = Vb x (T/60)——(2)\r\nDividing (2) by (1)\r\n(Vb – Vc ) 18/(Vb +Vc ) 6 = 1\r\n(Vb – Vc )3 = (Vb +Vc )\r\nSubstituting  the value of Vc\r\n(Vb – 20 )3= (Vb + 20 )\r\n3Vb – 60 = Vb + 20\r\n2Vb = 80\r\nVb = 80/2 = 40 km/h\r\nTo find the value of T, substitute the values of Vb and Vc in equation (1)\r\n(Vb – Vc ) x 18/60 = Vb x (T/60)\r\n(40 – 20) x (18/60) = 40 x (T/60)\r\nT = (20 x 18) /40 = 9 minutes",
    "Detailed Solution": "Step 1) We'll start by labeling our variables. The variable for the speed of each bus is Vb, and the speed of the cyclist is Vc, which we already know to be 20 km/h. Step 2) We calculate the relative velocity of the buses going in the same direction as the cyclist which is Vb - Vc. Step 3) Buses passing in the same direction do so every 18 minutes, and since velocity is distance over time, we have Distance = (Vb - Vc) x 18/60. Step 4) We also know that the buses leave every T minutes, so the distance each bus travels is also equal to Vb x (T/60). Step 5) Setting those two equations equal to each other we get (Vb - Vc) x 18/60 = Vb x (T/60). We'll call this equation (1). Step 6) For buses going in the opposite direction, the relative velocity to the cyclist is Vb + Vc. Step 7) These buses pass the cyclist every 6 minutes, so our equation for distance covered becomes (Vb + Vc) x 6/60. Step 8) Since these buses also leave every T minutes, we make this equal to Vb x (T/60) giving us equation (2): (Vb + Vc) x 6/60 = Vb x (T/60). Step 9) We divide equation (2) by equation (1), this leaves (Vb - Vc) x 18 / (Vb + Vc) x 6 = 1. Simplifying this gives us (Vb - Vc) x 3 = (Vb + Vc). Step 10) We can now substitute our known speed of the cyclist (20 km/h) into the equation, giving us (Vb - 20) x 3 = (Vb + 20). Step 11) Simplifying further we arrive at 2Vb = 80, so Vb, the speed of the buses, = 80/2 = 40 km/h. Step 12) To solve for T, we substitute the values of Vb and Vc into equation (1). We get (40 – 20) x 18/60 = 40 x (T/60). Simplifying gives us T = (20 x 18) /40 = 9 minutes.",
    "Solution Outline": "Step 1) Define the variables for speeds: Vb for the bus and Vc for the cyclist which is already known. Step 2) Calculate the relative velocity for buses moving with the cyclist as Vb - Vc. Step 3) Express the distance covered by buses moving with the cyclist using the known time of 18 minutes. Step 4) Also represent the same distance in terms of bus frequency T. Step 5) Creating equation (1) by equating the two expressions for distance. Step 6) For buses moving opposite to the cyclist, calculate the relative velocity as Vb + Vc. Step 7) Express the distance covered by these buses using the known time of 6 minutes. Step 8) Represent this distance also in terms of T. Step 9) Create equation (2) by equating these two distances. Step 10) Divide equation (2) by (1) and simplify to find an equation in terms of Vb. Step 11) Substituting known value of cyclist's speed into this equation to solve for Vb. Step 12) Substitute solved values of Vb and known Vc into equation (1) to solve for T."
}