{
    "Question": "2. Which of the following examples represent (nearly) simple harmonic motion and which represent periodic but not simple harmonic motion? (a) the rotation of earth about its axis.(b) motion of an oscillating mercury column in a U-tube.(c) motion of a ball bearing inside a smooth curved bowl, when released from a point slightly above the lower most point. (d) general vibrations of a polyatomic molecule about its equilibrium position.",
    "Original Solution": "(a) Rotation of the earth is not to and fro motion about a fixed point. Therefore, it is periodic but not S.H.M.\r\n(b) Simple harmonic motion\r\n(c) Simple harmonic motion\r\n(d) General vibrations of a polyatomic molecule about its equilibrium position is periodic but not SHM. A polyatomic molecule has a number of natural frequencies. Therefore, its vibration is a superposition of simple harmonic motions of a number of different frequencies.",
    "Detailed Solution": "\nStep 1) We're provided with four scenarios and asked to determine which ones represent simple harmonic motion (S.H.M.) and which represent periodic motion, but not S.H.M. To understand the distinction, we need to know what S.H.M. is. Simple Harmonic Motion is a type of periodic motion where the restoring force is directly proportional to the displacement and acts in the direction opposite to that of displacement.\nStep 2) For (a) the rotation of the Earth about its axis, we observe that it isn't motion about a fixed point, and there doesn't exist a restoring force that's proportional to the displacement. The Earth's rotation is definitely a periodic motion as it repeats itself after a specified interval (one day), but it lacks qualities to be Simple Harmonic. So, it's classified as periodic but not S.H.M.\nStep 3) Let's move to (b) the motion of an oscillating mercury column in a U-tube. Here, the force that the mercury experiences is directly proportional and opposite to the displacement from its equilibrium position, hence it represents S.H.M.\nStep 4) For (c), the motion of a ball bearing inside a smooth curved bowl released from a point slightly above the lowermost point. Here, the motion of the ball is also to and fro and the restoring force on the ball from the bowl is proportional to the displacement. Hence, it can be classified as S.H.M.\nStep 5) Lastly, in (d) the general vibrations of a polyatomic molecule about its equilibrium position aren't exactly simple S.H.M because a polyatomic molecule has several natural frequencies, which means that the vibration is a superposition of S.H.M.s of several different frequencies. So, it's periodic but not simple harmonic.\n",
    "Solution Outline": "\nStep 1) Review the definition of Simple Harmonic Motion (S.H.M.), a type of periodic motion where the restoring force is directly proportional to the displacement and acts in the direction opposite to that of displacement.\nStep 2) Analyze example (a), the rotation of the Earth about its axis. It's a periodic motion, not S.H.M., because it doesn't show motion about a fixed point with a proportional and opposite restoring force.\nStep 3) Consider example (b), the motion of an oscillating mercury column in a U-tube. This is S.H.M. since the mercury's restoring force is directly proportional and opposite to its displacement.\nStep 4) Look at example (c), the motion of a ball bearing inside a smooth curved bowl. Again, this is S.H.M. as the ball's restoring force from the bowl is proportional and opposite to displacement.\nStep 5) Evaluate example (d), the general vibrations of a polyatomic molecule. This isn't S.H.M., as the molecule exhibits numerous natural frequencies, thus the vibrations are superpositions of multiple S.H.M. Hence, it's periodic, but not simple harmonic."
}