{
    "Question": "Q.18.A brass boiler has a base area of 0.15 m^2 and a thickness of 1.0 cm. It boils water at the rate of 6.0 kg/min when placed on a gas stove. Estimate the temperature of the part of the flame in contact with the boiler. Thermal conductivity of brass = 109 J s^–1 m^–1 K^–1; Heat of vaporisation of water = 2256 × 10^3 J kg^–1.",
    "Original Solution": "The base area of the brass boiler, A= 0.15 m^2\r\nThe thickness of the boiler, d =1.0 cm=0.01 m\r\nThe brass boiler boils water at the rate, R=6.0 kg/min\r\nTime, t = 60 sec\r\nMass = 6 kg\r\nThe thermal conductivity of brass, K =109 Js^(−1) m^(−1) k^(−1)\r\nThe heat of vaporisation of water, L = 2256×10^3 Jkg^(−1)\r\nLet  T1 be the temperature of the flame in contact with the boiler.\r\nLet T2 be the boiling point of water = 100 C\r\nLet Q be the amount of heat flowing into the water through the base of the boiler.\r\nQ =KA(T1 −T2)t/d\r\nQ = [109 x 0.15 x (T1 – 100) x 60]/ 0.01 ——-(1)\r\nHeat received by water\r\nQ=mL\r\nQ = 6 x 2256×10^3 ——-(2)\r\nEquating equations (1) and (2), we get\r\nmL  = KA(T1 −T2)t/d\r\n6 x 2256×10^3 = [109 x 0.15 x (T1 – 100) x 60]/ 0.01\r\n​13536 ×10^3 x 0.01 = 981 (T1 – 100)\r\nT1 – 100 = 13536 ×10^3 x 0.01/ 981\r\nT1 = 137.9 + 100\r\n= 237. 9 C\r\nTherefore, the temperature of the part of the flame in contact with the boiler is 237.98 C.",
    "Detailed Solution": "Step 1) Begin by identifying the known values given by the problem. The base area of the brass boiler (A) is 0.15 m^2. The thickness of the boiler (d) is 1.0 cm, but note that we need to convert this to meters to align with the SI units, giving us 0.01 m. The brass boiler is said to boil water at a rate (R) of 6.0 kg/min. From this, deduce that the mass (m) boiled in one minute is 6 kg. The thermal conductivity of brass (K) is confirmed to be 109 Js^(−1)m^(−1)K^(−1) and the heat of vaporisation of water (L) is given as 2256 × 10^3 Jkg^(−1). Finally, recognize that the boiling point of water (T2) is 100 degrees Celsius. \nStep 2) Understand the quest: we need to identify T1, which is the temperature of the flame in contact with the boiler.\nStep 3) Apply the formula for heat conduction Q = KA(T1 −T2)t/d. This formula suggests that the amount of heat (Q) entering the water through the base of the boiler is contributed by thermal conductivity, area, temperature difference, time, and thickness of the boiler. Plugging the known values, we have equation (1) as Q = [109 x 0.15 x (T1 – 100) x 60]/ 0.01.\nStep 4) Consider the heat absorbed by the water to change phases using the equation Q=mL. Here, Q is the heat absorbed, m is the mass of water, and L is the heat of vaporisation. Substituting the given values, our equation (2) reads Q = 6 x 2256 × 10^3.\nStep 5) As the heat entering the water is the same as the heat absorbed by the water, equate equations (1) and (2). This yields 6 x 2256 × 10^3 = [109 x 0.15 x (T1 – 100) x 60]/ 0.01.\nStep 6) Solve for T1 by isolating the variable on one side of the equation. Start by multiplying both sides of the equation by 0.01 to clear the denominator on the right side, then rearrange to isolate (T1-100) and finally, solve for T1. This culminates in T1 = 137.9 + 100, or T1 = 237.9 C",
    "Solution Outline": "Step 1) Recognize the known values, which are the area, thickness, rate of boiling, thermal conductivity of brass, and heat of vaporisation of water. Note the SI unit conversions.\nStep 2) Understand that the goal is to find the temperature of the flame (T1).\nStep 3) Use the formula for heat conduction, Q = KA(T1 −T2)t/d, to set up the first equation to represent the heat entering the water.\nStep 4) Set up a second equation representing the heat received by water using Q=mL.\nStep 5) Since the heat entering the water is equal to the heat absorbed by water, equate the two equations and isolate T1.\nStep 6) Solve for T1 and note that it turns out to be above boiling point, which is logical considering the flame and boiler setup."
}