{
    "Question": "Q19: Read each statement below carefully and state, with reasons, if it is true or false:\r\n(a) The net acceleration of a particle in a circular motion is always along the radius of the circle towards the centre.\r\n(b) The velocity vector of a particle at a point is always along the tangent to the path of the particle at that point. \r\n(c) The acceleration vector of a particle in uniform circular motion averaged over one cycle is a null vector.",
    "Original Solution": "(a) False\r\nThe net acceleration of a particle in a circular motion is always directed along the radius of the circle toward the centre only in the case of uniform circular motion.\r\n(b) True\r\nAt a point on a circular path, a particle appears to move tangentially to the circular path.\r\n(c) True\r\nIn uniform circular motion (UCM), the direction of the acceleration vector points toward the centre of the circle. However, it constantly changes with time. The average of these vectors over one cycle is a null vector.\r\n",
    "Detailed Solution": "Step 1) We start with examining the statement (a), which says 'The net acceleration of a particle in a circular motion is always along the radius of the circle towards the centre.' This statement is false since it holds true only in the case of uniform circular motion. To understand why, remember that in a circular motion, there are two components of acceleration: the radial or centripetal acceleration (always directed towards the centre of the circle) and the tangential acceleration (responsible for the change in speed). In uniform circular motion, the speed remains constant, which means that the tangential acceleration is zero. This leaves us with only the centripetal acceleration which is always directed along the radius of the circle towards the centre.\nStep 2) For the statement (b) which says 'The velocity vector of a particle at a point is always along the tangent to the path of the particle at that point', it is true. This can be understood visually. If you draw a circular path, the velocity vector is always tangent to the path at any point in time, following the direction of the motion of the particle. Essentially, the velocity is the rate of change of displacement, and since the displacement is tangential to the direction of motion, the velocity vector also follows an equivalent path.\nStep 3) Lastly, we look at statement (c) 'The acceleration vector of a particle in uniform circular motion averaged over one cycle is a null vector.' This statement is true. In uniform circular motion, while the speed of the particle remains constant, the direction of the velocity vector constantly changes, thus leading to a non-zero acceleration that is taken towards the center of the circular path. However, when you average these vectors over a complete cycle, you would realize that equally sized acceleration vectors are pointing in opposite directions at opposite points in the circle, cancelling each other out. After cancelling out all the acceleration vectors over the whole cycle, the net result is a null vector.",
    "Solution Outline": "Step 1) The statement (a) 'The net acceleration of a particle in a circular motion is always along the radius of the circle towards the centre' is false, the truth of which depends on whether the circular motion is uniform or non-uniform, the acceleration in uniform circular motion is always directed towards the centre of the circle, while in nonuniform circular motion there is also a tangential component of acceleration.\nStep 2) For statement (b) 'The velocity vector of a particle at a point is always along the tangent to the path of the particle at that point', it important to know that in circular motion, the direction of the velocity vector is always tangent to the path of the particle, creating the truth of this statement. This is due to the concept of velocity being the rate of change of displacement. \nStep 3) In regards to statement (c) 'The acceleration vector of a particle in uniform circular motion averaged over one cycle is a null vector', it is true because the vectors over one complete cycle cancel each other out leading to a null vector."
}