{
    "Question": "Q24. One end of a long string of linear mass density 8.0 × 10^–3 kg m^–1 is connected to an electrically driven tuning fork of frequency 256 Hz. The other end passes over a pulley and is tied to a pan containing a mass of 90 kg. The pulley end absorbs all the incoming energy so that reflected waves at this end have negligible amplitude. At t = 0, the left end (fork end) of the string x = 0 has zero transverse displacements (y = 0) and is moving along the positive y-direction. The amplitude of the wave is 5.0 cm. Write down the transverse displacement y as a function of x and t that describes the wave on the string.\r\n",
    "Original Solution": "Linear mass density of the string, μ= 8.0 × 10^–3 kg m^–1\r\nFrequency of the tuning fork = 256 Hz\r\nMass on the pan = 90 kg\r\nTension on the string, T = 90 x 9.8 = 882 N\r\nAmplitude, A = 0.05 m\r\nFor a transverse wave, the velocity is given by the relation.\r\n= 332 m/s\r\nAngular frequency, ω = 2πf\r\n= 2 x 3.14 x 256 = 1608.5 rad/sec\r\nWavelength, λ = v/f = 332/256 = 1.296 m\r\nPropagation constant, k = 2π/λ  = (2 x 3.14)/ 1.296\r\n= 4.845 m^-1\r\n​The general equation of the wave is\r\ny (x,t) = A sin (ωt – kx)\r\nSubstituting all the values, we get\r\ny(x,t) = A sin (1608.5t -4.845x)\r\nx and y are in metres, and t is in seconds.",
    "Detailed Solution": "Step 1) Identify the given values. The linear mass density of the string is given as μ = 8.0 × 10^-3 kg m^-1, the frequency of the tuning fork is 256 Hz, the mass on the pan is 90 kg, and the amplitude of the wave is 5.0 cm or 0.05 m. Step 2) Calculate the tension on the string, T. This can be found using the equation T = m*g, where m is the mass and g is the acceleration due to gravity, which is approximately 9.8 m/s^2. So, T = 90 kg * 9.8 m/s^2 = 882 N. Step 3) Use this tension to find the velocity of the wave on the string. For transverse waves, velocity can be found using the equation v = sqrt(T/μ), where T is tension and μ is the linear mass density. Therefore, v = sqrt(882 N / 0.008 kg/m) = 332 m/s. Step 4) Compute the angular frequency, ω, with the formula ω = 2πf, where f is frequency. Substituting in the given frequency, we get ω = 2* 3.14 * 256 = 1608.5 rad/sec. Step 5) Obtain the wavelength of the wave, λ. This can be calculated using the relation λ = v/f = 332 m/s / 256 Hz = 1.296 m. Step 6) Determine the propagation constant, k, which is found using the relation k = 2π / λ = 2 * 3.14 / 1.296 m = 4.845 m^-1. Step 7) Construct the general equation of the wave using y(x,t) = A sin (ωt - kx), where A is amplitude, ω is angular frequency, k is propagation constant, and x and t are distance and time, respectively. After substituting the values, we get y(x,t) = 0.05 m * sin (1608.5 rad/sec * t - 4.845 m^-1 * x). Thus, we have described transverse displacement y as a function of x and t which characterizes the wave on the string.",
    "Solution Outline": "Step 1) Recognize the known quantities: linear mass density, frequency of tuning fork, mass on the pan, and amplitude. Step 2) Compute the tension on the string, using the formula for gravitational force, where T = m*g. Step 3) Calculate wave velocity on the string by using the formula for the speed of a wave on a string, v = sqrt(T/μ). Step 4) Derive the angular frequency using the formula ω = 2π * frequency. Step 5) Determine the wavelength of the wave using the formula λ = v/f. Step 6) Compute the propagation constant k using the formula k = 2π / λ. Step 7) Substitute all computed and given quantities into the general wave equation: y(x,t) = A sin (ωt - kx) to describe the wave on the string, where A is amplitude, ω is angular frequency, t is time, k is propagation constant, and x is position."
}