{
    "Question": "An artificial satellite orbiting the earth in a very thin atmosphere loses its energy gradually due to dissipation against atmospheric resistance, however small. Why, then, does its speed increase progressively as it comes closer and closer to the earth? ",
    "Original Solution": "The potential energy of the satellite revolving around the Earth decreases as it approaches the Earth, and since the system’s total energy should remain constant, the kinetic energy increases. Thus, the satellite’s velocity increases. In spite of this, the total energy of the system is reduced by a fraction due to atmospheric friction.",
    "Detailed Solution": "Step 1) Understand that an artificial satellite orbiting the earth resides in a system where energy remains constant. This means the sum of the kinetic and potential energies stay the same, even when displaced. This is the principle of conservation of mechanical energy. Step 2) Comprehend that as the satellite moves closer to Earth, its potential energy decreases. The potential energy of a satellite is given by the formula, PE = -GMm/r, where G is the gravitational constant, M is the Earth’s mass, m is the satellite's mass, and r is the distance from the center of the Earth to the satellite. As r decreases, PE decreases. Step 3) Recognize that due to the conservation of energy in the system, if potential energy decreases, then kinetic energy must increase to compensate. This is because the sum of the kinetic and potential energies must remain constant (given no external work is done). The kinetic energy (KE = 1/2 mV^2), is directly related to the satellite's speed. Thus, as the kinetic energy increases, the speed of the satellite also increases. Step 4) Understand that despite the spectral increase in kinetic energy and speed, the total energy of the system does decrease slightly due to the work done against atmospheric friction. This energy is not lost, but dissipated as thermal energy.",
    "Solution Outline": "Step 1) Acknowledge that a satellite exists in a system where the total energy remains constant. Step 2) Understand that as a satellite gets closer to the earth, its potential energy decreases due to the nature of the gravitational potential energy equation. Step 3) Take into account the energy's conservation rule and recognize that the decrease in potential energy would result in an increase in kinetic energy, and hence the speed of the satellite, to maintain the total energy's constant value. Step 4) Admit that the total energy of the system decreases slightly due to atmospheric friction which causes energy dissipation."
}