{
    "Question": "Q24. A boy, standing on a stationary lift (open from above), throws a ball upwards with the maximum initial speed he can, equal to 49 m s^-1. How much time does the ball take to return to his hands? If the lift starts moving up with a uniform speed of 5 m s^-1 and the boy again throws the ball up with the maximum speed he can, how long does the ball take to return to his hands?\r\n",
    "Original Solution": "The initial velocity of the ball, u = 49 m/s\r\nCase: I\r\nThe boy throws the ball upwards when the lift is stationary. The vertically upward direction is taken as the positive direction. The displacement of the ball is zero.\r\nConsidering the equation of motion\r\ns=ut + (1/2)at2\r\n0 = (49)t + (1/2) (-9.8)t^2\r\nt = (49 x 2)/9.8 = 98/9.8 = 10 sec\r\nCase: II\r\nAs the lift starts moving with a speed of 5 m/s, the initial speed of the ball will be 49 m/s + 5 m/s = 54 m/s\r\nThe displacement of the ball will be s =  5t’\r\nTherefore, the time taken can be calculated using the formula\r\ns = ut + (1/2) at^2\r\n5t’ = (54) t’ + (1/2)(-9.8) (t')^2\r\nt’ = 2(54 – 5)/9.8 = 10 sec\r\nThe time taken will remain the same in both cases.",
    "Detailed Solution": "Step 1) The first thing we must establish is the known quantity, which is the initial velocity of the ball and is given as 49 m/s. The lifting speed of the lift in the second case is also known and is provided as 5 m/s.  Step 2) Let's examine the first scenario once the values are known. In this case, the boy throws the ball upward while the lift is stationary. We're considering upward movement as positive here. Since the ball returns to the boy's hands, we understand that the total displacement (s) is zero during this journey. Step 3) With these quantities, we can use the second equation of motion, which is s = ut + (1/2)at^2. 'u' is the initial velocity, 't' is the time, 'a' is the acceleration, and 's' equal to the displacement. Step 4) We insert the known values into the equation, which gives us 0 = (49)t + (1/2) (-9.8)t^2. The negative sign indicates that the acceleration is acting downward, opposite to the direction of the ball's initial velocity. Step 5) By solving this equation, we find that t = (49 x 2)/9.8 = 10 seconds, which is the time it takes for the ball to return to the boy's hands when the lift is stationary. Step 6) Now, let's analyze the second case. Here, as the lift begins to move upward at a uniform velocity of 5m/s, the initial speed of the ball becomes 54 m/s (49 m/s + 5 m/s). Since the lift is moving upwards, the displacement of the ball would be different, and we'll mark it as s = 5t'. Step 7) With these new values, we can return to our second equation of motion, s = ut + (1/2) at^2. Looking at it, we plug in the values which gives us 5t = (54) t + (1/2)(-9.8) (t')^2. Solving this equation, we find that t' = 2(54 - 5)/9.8 = 10 seconds. Surprisingly, the time remains the same even though the lift begins to move upward. This shows the effect of relative motion.",
    "Solution Outline": "Step 1) Identify the known quantities, such as the initial velocity of the ball and the speed of the lift. Step 2) Study the first scenario, where the lift is stationary and the ball is thrown upward, considering upward movement as positive. Step 3) Use the second equation of motion, s=ut + (1/2)at^2, where 's' is the displacement, 'u' is the initial velocity, 't' is the time, and 'a' is the acceleration. Step 4) Insert the known values into the equation and isolate 't' on one side to find how long the ball takes to return to the boy's hands. Step 5) Study the second scenario, where the lift starts moving upwards with a speed of 5m/s which causes the initial speed of the ball to change. Apply the relative motion concept to calculate the ball's displacement against the lift. Step 6) Reuse the second equation of motion with the new values to find the time. Despite the lift being in motion, the time remains the same; thus illustrating the concept of relative motion."
}