{
    "Question": "Q21. A train, standing in a station yard, blows a whistle of frequency 400 Hz in still air. The wind starts blowing in the direction from the yard to the station with a speed of 10 m s^–1. What are the frequency, wavelength, and speed of sound for an observer standing on the station’s platform? Is the situation exactly identical to the case when the air is still, and the observer runs towards the yard at a speed of 10 m s^–1? The speed of sound in still air can be taken as 340 m s^–1.",
    "Original Solution": "Frequency of the whistle = 400 Hz\r\nSpeed of wind, vw= 10 m/s\r\nSpeed of sound in still air,v= 340 m/s\r\nThe effective speed of the sound for an observer standing on the platform\r\nv’ = v + vw = 340 + 10 = 350 m/s\r\nThere is no relative motion between the source and the observer; therefore, the frequency of the sound heard by the observer will be the same.\r\nTherefore, f = 400 Hz\r\nWavelength of the sound heard by the observer = speed of wave/frequency = 350/400 = 0.875 m\r\nWhen the air is still, and the observer runs towards the yard at a speed of 10 m s–1, then there is a relative motion between the observer and the source with respect to the medium.\r\nThe medium is at rest. Therefore,\r\nv’ = v = 340 m/s\r\nThe change in frequency, f ‘ =[ (v + v0)/ v ] x f\r\n= [(340 + 10)/340] x 400 = 411.76 Hz\r\nWavelength = 340/411.76 =  0.826  m\r\nObviously, the situations in the two cases are entirely different.",
    "Detailed Solution": "Step 1) Let's start by identifying the given information from the problem. The initial frequency of the whistle is 400 Hz, the speed of the wind is 10 m/s, and the speed of sound in still air is 340 m/s.\n Step 2) To find the effective speed of sound for an observer on the platform, we have to sum the speed of sound in still air and the speed of the wind. This is because the wind is blowing in the same direction as the sound, thus making the sound travel faster. So, we add v + vw = 340 m/s + 10 m/s = 350 m/s.\n Step 3) As there is no relative motion between the source of sound (whistle) and observer (person standing on the platform), the frequency of the sound heard by the observer remains the same as the source frequency, which is f = 400 Hz.\n Step 4) Now, we need to calculate the wavelength of the sound heard by the observer. The wavelength is given by the speed of the wave divided by its frequency. Plugging our values in, we get the wavelength as 350 m/s divided by 400 Hz, which is 0.875 m.\n Step 5) The problem also asks to consider the scenario where the air is still, and the observer runs towards the sound source at a speed of 10 m/s. In this case, there is a relative motion of the observer towards the source.\n Step 6) But the medium (air) is at rest, so the effective speed of the sound is the same as the speed of sound in still air, which is v' = v = 340 m/s.\n Step 7) The change in the frequency experienced by the observer can be calculated using the Doppler effect formula, (v + v0)/v x f. Plugging in our values, we get ((340 m/s + 10 m/s) / 340 m/s) x 400 Hz = 411.76 Hz.\n Step 8) Subsequently, we calculate the wavelength of the sound using this modified frequency. The new wavelength = 340 m/s divided by 411.76 Hz, which gives us 0.826 m. \n Step 9) Comparing the results from the two scenarios, it's clear that they are entirely different, contrary what one might intuitively think. The motion of the observer alters the observed frequency and wavelength, even if the relative speed to the source is the same in both scenarios due to the Doppler Effect",
    "Solution Outline": "Step 1) Identify the given quantities: the frequency of the whistle, speed of the wind, and speed of sound in still air.\n Step 2) Calculate the effective speed of the sound for an observer on the platform by adding the speed of sound and wind speed.\n Step 3) State that, since there's no relative motion between the source and the observer, the observer hears the same frequency as the source.\n Step 4) Calculate the wavelength of the sound heard by the observer using the formula speed/frequency.\n Step 5) Consider the scenario where the air is still but the observer moves towards the source at 10 m/s. Clarify that this causes relative motion between the observer and source.\n Step 6) State that, as the air is still now, the effective speed of sound is just the speed of sound in still air.\n Step 7) Calculate the modified frequency experienced by the moving observer using the Doppler effect formula.\n Step 8) Calculate the wavelength of the sound using this modified frequency. \n Step 9) Conclude that the outcomes are significantly different in these two scenarios, to highlight the practical implications of the Doppler Effect."
}