{
    "Question": "Q.12: A 10 kW drilling machine is used to drill a bore in a small aluminium block of mass 8.0 kg. How much is the rise in temperature of the block in 2.5 minutes, assuming 50% of power is used up in heating the machine itself or lost to the surroundings? Specific heat of aluminium = 0.91 J g^(–1) K^–1.",
    "Original Solution": "Power = 10 kW\r\nMass of the small aluminium block, m = 8 kg = 8 x 10^3 g\r\nTime = 2.5×60=150 s\r\nSpecific heat of aluminium, c= 0.91 J g^–1 K^–1\r\nTotal energy =P×t=10^4 ×150=15×10^5 J\r\nAs 50% of the energy is used in the heating or lost to the surrounding,\r\nTherefore, thermal energy available, ΔQ= (1/2) x 15×10^5\r\n= 7.5 x 10^5\r\nAs ΔQ=mcΔT\r\nΔT= ΔQ/mc\r\n=  7.5 x 10^5/ (8 x 10^3 ×0.91)\r\n= 7.5 x 10^5/ 7.28 x 10^3\r\n= 1.03 x 10^2 \r\nRise in the temperature of the block, ΔT = 103 C",
    "Detailed Solution": "Step 1) We know the power (P) of the machine is 10 kW. We also convert it to Watts by multiplying by 1000 because a kilowatt is 1000 Watts. Therefore, P = 10^4 W.\nStep 2) The mass (m) of the aluminum block we are dealing with is given as 8 kg, but we need to convert this to grams because specific heat capacity is given in terms of grams. We use the fact that 1 kg is equal to 10^3 grams. Hence, m = 8 x 10^3g.\nStep 3) The time the machine operates is given as 2.5 minutes. We convert this to seconds because power is in Watts, which is Joules per second. Therefore, time, t = 2.5 x 60 = 150s.\nStep 4) We consider the total energy produced by the machine. This can be calculated using the formula for power, which is power (P) equals energy (E) divided by time(t). Rearranging for energy gives us the formula E = P x t. Hence, total energy = 10^4 x 150 = 15 x 10^5 J.\nStep 5) It's given that 50% of the total energy is either used up in heating the machine or lost to the surroundings. This means only half of the total energy is available for heating the block, represented by ΔQ. So, ΔQ = 1/2 x 15 x 10^5 = 7.5 x 10^5 J.\nStep 6) The increase in temperature (ΔT) can be found from the relation ΔQ = mcΔT, where c is the specific heat capacity of aluminum, m is the mass, and ΔT is change in the temperature. We rearrange the equation to solve for ΔT. So, ΔT = ΔQ/(mc).\nStep 7) Substituting the values for ΔQ, m, and c (which is 0.91 J g^(–1) K^–1 for aluminum), we get ΔT = 7.5 x 10^5 / (8 x 10^3 x 0.91) = 7.5 x 10^5 / 7.28 x 10^3 = 1.03 x 10^2.\nStep 8) Simplifying, we find that the rise in temperature ΔT = 103 degrees Celsius. As a result, under the stated conditions, our aluminum block will heat up by 103 degrees Celsius.",
    "Solution Outline": "Step 1) Convert power to Watts and mass to grams, and time to seconds to be consistent with units in specific heat capacity. \nStep 2) Calculate the total energy output of the machine using the formula for power, E = P x t. \nStep 3) Determine the energy available for heating the block (ΔQ), using the information that 50% of the total energy is lost or used in heating the machine. \nStep 4) Determine the increase in temperature (ΔT) using the energy used in heating the block (ΔQ), the mass of the block (m), and the specific heat capacity of aluminum (c) in the formula ΔQ = mcΔT. Rearrange and solve for ΔT. \nStep 5) Substitute the values for ΔQ, m, and c into the above equation to compute the increase in temperature ΔT = ΔQ/(mc). \nStep 6) Simplify to find the final rise in temperature of the aluminum block."
}