{
    "Question": "Q21. The Marina trench is located in the Pacific Ocean, and in one place, it is nearly eleven km beneath the surface of the water. The water pressure at the bottom of the trench is about 1.1 × 10^8 Pa. A steel ball of initial volume 0.32 m^3 is dropped into the ocean and falls to the bottom of the trench. What is the change in the volume of the ball when itreaches the bottom?",
    "Original Solution": "Water pressure at the bottom of the trench, p=1.1×10^8 Pa\r\nInitial volume of the steel ball, V=0.32m^3\r\nBulk modulus of steel, B=1.6×10^11 Nm^−2\r\nThe ball falls at the bottom of the trench, which is nearly 11 km beneath the surface of the water.\r\nThe volume change of the ball after reaching the bottom of the trench is  △V.\r\nBulk modulus, B=p/(△V/V) = pV/△V\r\n△V= pV/B\r\n=(1.1×10^8×0.32)/(1.6×10^11)\r\n= 0.352 ×10^8/1.6×10^11\r\n= 0.22 x 10^(-3) m^3\r\nThe change in volume of the ball on reaching the bottom of the trench is 0.22 x 10^(-3) m^3",
    "Detailed Solution": "Step 1) We start by identifying the known quantities. The pressure at the bottom of the trench is 1.1 x 10^8 Pa, which is given in the problem. The initial volume of the steel ball is provided as 0.32 m^3. The Bulk Modulus of steel is a known value which is 1.6 x 10^11 N/m^2. We also take note that the objective is to find the change in volume of the ball, which we’ll symbolize as ΔV. \n\nStep 2) We need to use the formula related to the concepts of pressure, volume, and Bulk Modulus. The formula is B = p / (ΔV / V). In this formula, B stands for the Bulk Modulus, p is the pressure, ΔV is the change in volume, and V is the initial volume. \n\nStep 3) However, we’re not looking for the Bulk Modulus (B), we need to find ΔV. To find this, we solve the formula for ΔV. By cross-multiplying and flipping the equation around, we get ΔV = pV / B. \n\nStep 4) We substitute the known values into the equation. This gives us ΔV = (1.1 x 10^8 x 0.32) / 1.6 x 10^11. \n\nStep 5) We perform the calculator operations to find the value of ΔV. Make sure these calculations are carefully carried out to maintain accuracy throughout the problem solving process. We find that ΔV = 0.22 x 10^-3 m^3. \n\nStep 6) So, the change in volume of the ball when it reaches the bottom of the trench is 0.22 x 10^-3 m^3. This is the change in volume, a compression, that the steel ball undergoes due to the pressure at the bottom of the trench.",
    "Solution Outline": "Step 1) Identify the given values from the problem and the quantity we need to find, which is the change in volume, ΔV. \n\nStep 2) Make use of the Bulk Modulus formula, B = p / (ΔV / V), where B is Bulk Modulus, p is pressure, ΔV is change in volume, and V is volume. \n\nStep 3) As we're interested in finding ΔV, rearrange the formula to ΔV = pV / B, in order to express ΔV, our unknown, in terms of other known quantities. \n\nStep 4) Substitute the known values into the formula ΔV = (1.1 x 10^8 x 0.32) / 1.6 x 10^11. Perform the calculation to get ΔV. \n\nStep 5) The calculated value obtained, ΔV = 0.22 x 10^-3 m^3, is the change in volume of the ball when it reaches the bottom of the trench."
}