{
    "Question": "2. A body of mass 2 kg initially at rest moves under the action of an applied horizontal force of 7 N on a table with the coefficient of kinetic friction = 0.1. Compute the(a) work done by the applied force in 10 s.(b) work done by friction in 10 s.(c) work done by the net force on the body in 10 s.(d) change in kinetic energy of the body in 10 s.",
    "Original Solution": "The mass of the body = 2 kg\r\nHorizontal force applied = 7 N\r\nCoefficient of kinetic friction = 0.1\r\nAcceleration produced by the applied force, a1= F/m = 7/2 = 3.5 m/s^2\r\nForce of friction, f = μR = μmg = 0.1 x 2 x 9.8\r\nRetardation produced by friction, a2 = -f/m = -196/2 = -0.98\r\nNet acceleration with which the body moves,\r\na = a1 + a2 =  3.5 – 9.8 = 2.5\r\nDistance moved by the body in 10 seconds,\r\ns = ut + (1/2)at^2 = 0 + (1/2) x 2.52 x (10)^2= 126 m\r\n(a) The time at which work has to be determined is t = 10 s\r\nWork = Force x displacement\r\n= 7 x 126 = 882 J\r\n(b) Work done by the friction in 10 s\r\nW = -f x s = -1.96 x 126\r\n(c) Work done by the net force in 10 s\r\nW = (F – f)s = (7 – 1.96) 126 = 635 J\r\n(d) From v = u + at\r\nv = 0 + 2.52 x 10 = 25.2 m/s\r\nFinal Kinetic Energy = (1/2) mv^2 = (1/2) x 2 x (25.2)^2 = 635 J\r\nInitial Kinetic Energy= (1/2) mu^2 = 0\r\nChange in Kinetic energy = 635 – 0 = 635 J\r\nThe work done by the net force is equal to the final kinetic energy.",
    "Detailed Solution": "Step 1) From the problem, we're given the following known values: the mass of the body (m = 2 kg), the horizontal force applied (F = 7 N), and the coefficient of kinetic friction (μ = 0.1).  We're also told the body was initially at rest, and that we want to calculate the work done after 10 seconds (t = 10 s). Step 2) For a body under force, acceleration is given by the Net Force divided by the mass of the body (a = F/m). Here, acceleration due to the applied force (a1) is F/m = 7/2 = 3.5 m/s^2. Step 3) The opposing force, friction, is given by the formula f = μmg, where m is the mass of the object and g (≈ 9.8 m/s^2) is the acceleration due to gravity. Calculating this, we have f = μmg = 0.1 * 2 * 9.8. Step 4) The retardation due to this frictional force (a2) is -f/m, giving us a2 = -f/m = -196/2 = -0.98 m/s^2 - an opposing force, hence the negative sign. Step 5) The net acceleration (a) of the body is the sum of these two accelerations a1 and a2; therefore it's a = a1 + a2 = 3.5 - 0.98 = 2.52 m/s^2. Step 6) The next step is to calculate the distance moved by this body during the 10 seconds. This is given by formula s = ut + (1/2)at^2. Since the body is initially at rest u=0, hence the distance is s = (1/2)*a*t^2 = (1/2)*2.52*(10)^2 = 126 m. Step 7) Work done by the applied force in 10 s (a) is given by the formula work = Force x displacement, therefore it's 7 x 126 = 882 J. Step 8) Work done by the friction (b) is given by -f x s = -1.96 x 126, negative because it's an opposing force. Step 9) Work done by the net force (c) in 10 s is W = (F – f)s = (7 – 1.96) * 126 = 635 J. Step 10) From equation of motion v = u + at, final velocity v after t=10 s is v = 0 + 2.52*10 = 25.2 m/s, since body was initially at rest. Step 11) Final kinetic energy (KE_f) will be (1/2)mv^2 = (1/2)*2*(25.2)^2 = 635 J. Step 12) The body was initially at rest, so initial kinetic energy (KE_i) will equal (1/2)mu^2 = 0. Step 13) The change in kinetic energy (d) is the final kinetic energy minus the initial kinetic energy, KE_f - KE_i = 635 J - 0 = 635 J. The work done by the net force is equal to the final kinetic energy.",
    "Solution Outline": "Step 1) Identify known values: mass (m), force applied (F), coefficient of kinetic friction (μ), and time (t). Step 2) Compute the acceleration produced by the applied force (a1) with formula a = F/m. Step 3) Calculate force of friction (f) with the formula f = μmg. Step 4) Find the negative acceleration (retardation) due to friction (a2) using a2 = -f/m. Step 5) Compute the net acceleration (a) by adding the accelerations a1 and a2. Step 6) Calculate the distance moved in 10s (s) using the formula of motion s = ut + (1/2)at^2. Step 7) Calculate the work done by the applied force using W = F*s. Step 8) Determine the work done by friction with the formula W = -f*s. Step 9) Compute the work done by the net force with W = (F - f)s. Step 10) Determine the final velocity (v) using the equation of motion v = u + at. Step 11) Calculate the final kinetic energy with KE_f = (1/2)mv^2. Step 12) Find the initial kinetic energy with KE_i = (1/2)mu^2. Step 13) Compute the change in kinetic energy as the difference between the final and initial kinetic energies. The work done by the net force equals the final kinetic energy."
}