{
    "Question": "38. You may have seen in a circus a motorcyclist driving in vertical loops inside a ‘death well’ (a hollow spherical chamber with holes, so the spectators can watch from outside). Explain clearly why the motorcyclist does not drop down when he is at the uppermost point, with no support from below. What is the minimum speed required at the uppermost position to perform a vertical loop if the radius of the chamber is 25 m?",
    "Original Solution": "When the motorcyclist is at the uppermost point of the death-well, the normal reaction R on the motorcyclist by the ceiling of the chamber acts downwards. His weight mg also acts downwards. The outward centrifugal force acting on the motorcyclist is balanced by these two forces.\r\nR + mg = mv^2/r ———(1)\r\nHere, v is the velocity of the motorcyclist\r\nm is the mass of the motorcyclist and the motorcycle\r\nBecause of the balance between the forces, the motorcyclist does not fall\r\nThe minimum speed required at the uppermost position to perform a vertical loop is given by the equation (1) when R = 0\r\nmg = m(Vmin)^2/r\r\n(Vmin)^2 = gr\r\nVmin = √(10 x 25) = 15.8 m/s",
    "Detailed Solution": "Step 1) Imagine the scene where the motorcyclist is exactly at the top of the spherical chamber, here the motorcyclist experiences two forces. First, his weight (the force of gravity) is pulling him downwards and, second, the normal reaction (the force due to the contact of the motorcyclist with the ceiling of the chamber) is also acting downwards. This is crucial to understanding why he doesn't fall. Step 2) The centrifugal force is acting outwards, which is towards the center of the sphere. Thus, at the uppermost point, this force pulls the motorcyclist upwards, against gravity. Step 3) The balance of forces for the motorcyclist can be represented by the equation R + mg = mv^2/r, where R is the normal reaction, m is the mass of the motorcyclist, g is the acceleration due to gravity, v is the speed of the motorcyclist, and r is the radius of the chamber. Step 4) When the motorcyclist moves with a speed such that the normal reaction R becomes zero, he is just in contact with the chamber, but without any weight. This is the minimum speed required to stay at the top of the spherical chamber. Step 5) This situation can be mathematically represented by setting R = 0 in our balance of forces equation. Here, you get mg = m(Vmin)^2/r. Here, Vmin represents the minimum speed required for the motorcyclist. Step 6) We rearrange this equation to solve for Vmin, which gives us (Vmin)^2 = gr. Taking the square root of both sides, we have Vmin = √(10 x 25) = 15.8 m/s, which is the minimum speed the motorcyclist must maintain in order to not fall on the uppermost position.",
    "Solution Outline": "Step 1) Understand that at the top of the loop the motorcyclist experiences his weight and the normal reaction force both acting downwards. The centrifugal force generated due to the motion also acts upwards. Step 2) Recognize that these forces are balanced, represented by the equation R + mg = mv^2/r. Step 3) Realize that the minimum speed at the topmost point is when the normal reaction becomes zero. Step 4) Represent this situation mathematically by setting R = 0 in our equation to get mg = m(Vmin)^2/r. Step 5) Rearrange this equation to solve for Vmin, which leads us to (Vmin)^2 = gr, taking square root gives the minimum speed."
}