{
    "Question": "7. A body of mass 5 kg is acted upon by two perpendicular forces 8 N and 6 N. Give the magnitude and direction of the acceleration of the body.",
    "Original Solution": "Given,\r\nMass, m = 5 kg\r\nForce, F1 = 8N and F2 = 6N\r\nThe resultant force of the body \\begin{array}{l}F = \\sqrt{F_{1}^{2}+F_{2}^{2}}=\\sqrt{8^{2}+6^{2}}= \\sqrt{64+36}=10N\\end{array}\r\nAcceleration, a = F/m\r\na = 10/ 5 = 2m/s in the direction of the resultant force\r\nThe direction of the acceleration,\r\ntan β = 6/8 = 0.75\r\nβ = tan-1 (0.75)\r\nβ = 37 degree with 8N",
    "Detailed Solution": "Step 1) The problem provides us with known values for the mass of the body (m=5 kg) and the magnitudes of two perpendicular forces acting on the body (F1=8N and F2=6N). Step 2) Remember from Newton's second law of motion that the acceleration of the body will be determined by the resultant force acting on it divided by the mass of the body. We know that the resultant force when two forces are acting at right angles to each other is calculated using Pythagoras' theorem: F = sqrt(F1^2 + F2^2). In our case, this results in F = sqrt(8^2 + 6^2) = sqrt(64 + 36) = 10N. Step 3) Now, we can find the acceleration a = F/m = 10N/5kg = 2 m/s, in the direction of the resultant force. Step 4) The angle of the resultant force with respect to the horizontal can be calculated using the definition of the tangent function. The direction of acceleration will be the same as that of the resultant force and can be calculated as tan β = F2/F1 = 6N/8N = 0.75. Doing the inverse tangent calculation, we get β = tan-1 (0.75) = 37 degrees. So, the acceleration is 2m/s directed at 37 degrees relative to the force of 8N.",
    "Solution Outline": "Step 1) Note the known values for mass and the two perpendicular forces provided in the problem. Step 2) We combine the two perpendicular forces to get the resultant force using Pythagoras' theorem, as the forces are at right angles to each other. Step 3) Apply Newton's second law of motion, F=ma, to find the acceleration. Divide the resultant force by the mass of the body to get the acceleration and note it's in the direction of the resultant force. Step 4) Calculate the direction of the resultant force (and hence the acceleration). This is done by taking the punch level of the forces (which are at right angles), calculating the tangent of the angle relative to one of the forces and taking the inverse tangent to get the direction in degrees."
}