{
    "Question": "14:  In a test experiment on a model aeroplane in a wind tunnel, the flow speeds on the upper and lower surfaces of the wing are 70 m s^–1 and 63 m s^-1, respectively. What is the lift on the wing if its area is 2.5 m^2? Take the density of air to be 1.3 kg m^–3 ",
    "Original Solution": "Given:\r\nSpeed of wind on the upper side of the wing, V1 = 70 m/s\r\nSpeed of wind on the lower side of the wing, V2 = 63 m/s\r\nArea of the wing, A = 2.5 m^2\r\nDensity of air, ρ = 1.3 kg m^-3\r\nUsing Bernoulli’s theorem, we get\\(\\begin{array}{l}P_{ 1 } + \\frac{ 1 }{ 2 }\\rho V_{ 1 }^{ 2 } = P_{ 2 } + \\frac{ 1 }{ 2 }\\rho V_{ 2 }^{ 2 }\\end{array} \\)\r\n\r\nWhere, P1 = Pressure on the upper side of the wing\r\nP2 = Pressure on the lower side of the wing \r\nNow, the lift on the wing = ( P2 – P1 ) x Area\r\n= \\(\\begin{array}{l}\\frac{ 1 }{ 2 }\\rho \\left ( V_{ 1 }^{ 2 } – V_{ 2 }^{ 2 } \\right ) \\times A\\end{array} \\)\r\n= \\(\\begin{array}{l}\\frac{ 1 }{ 2 }\\times 1.3 \\left ( \\left ( 70 \\right )^{ 2 } – \\left ( 63 \\right )^{ 2 } \\right ) \\times 2.5\r\n \r\nTherefore, the lift experienced by the wings of the aircraft is 1.51 x 10^3 N.",
    "Detailed Solution": "Step 1) Start by identifying the known values given in the problem. The speed of the wind on the upper side of the wing, V1, is 70 m/s. The speed of the wind on the lower side of the wing, V2, is 63 m/s. The area of the wing, A, is 2.5 m^2. The density of air, denoted as ρ, is 1.3 kg/m^3. Step 2) Apply Bernoulli’s theorem. This is a principle fundamental to fluid dynamics, stating that the sum of the pressure, gravitational potential energy per unit volume, and kinetic energy per unit volume is constant. The formula for this theorem is P1 + 1/2ρV1^2 = P2 + 1/2ρV2^2. In this equation, P1 and P2 represent the pressure on the upper and lower sides of the wing, respectively. Step 3) Understand that the lift on the wing is the result of a difference in pressure across the wing, multiplied by the wing's area. Mathematically, this can be expressed as (P2 - P1) x A. Substitute Bernoulli’s theorem into this equation and we get 1/2ρ(V1^2 - V2^2) x A. This equation helps us to calculate the lift experienced by the wings of the aircraft. Step 4) Substitute the known values into the equation. 1/2 x 1.3 (70^2 - 63^2) x 2.5. By performing the arithmetic, we end up with the lift experienced by the wings, which is 1.51 x 10^3 N.",
    "Solution Outline": "Step 1) Recognize the known values provided in the problem: the wind flow speeds on the upper and lower surfaces of the wing, the wing's area, and the air's density. Step 2) Apply Bernoulli’s theorem. This theorem is a statement of the conservation of energy principle for flowing fluids and can be used to understand the relationship between pressure, velocity, and elevation. Step 3) Recognize that the lift on the wing can be calculated by finding the difference in pressure across the wing and multiplying it by the wing's area. You can use Bernoulli's theorem to express this in terms of wind speeds and the air's density. Step 4) Substitute the known values into the equation we derived from Bernoulli's theorem to calculate the lift on the wing."
}