{
    "Question": "Q1: State whether the following physical quantities are scalar or vector.                     \r\n(i) Mass \r\n(ii) Volume \r\n(iii) Speed\r\n(iv) Acceleration\r\n(v) Density\r\n(vi) Number of moles\r\n(vii) Velocity\r\n(viii) Angular frequency\r\n(ix) Displacement\r\n(x) Angular velocity",
    "Original Solution": "Scalar: Density, mass, speed, volume, angular frequency, number of moles.\r\nVector: Velocity, acceleration, angular velocity, displacement.\r\nA scalar quantity depends only on the magnitude, and it is independent of the direction. Density, mass, speed, volume, angular frequency and number of moles are scalar quantities.\r\nA vector quantity depends on the magnitude as well as the direction. Velocity, acceleration, angular velocity, and displacement comes under this.",
    "Detailed Solution": "Step 1) Create two categories: one for scalar quantities and one for vector quantities. A scalar quantity is defined by its magnitude alone, it does not depend on the direction. On the other hand, a vector quantity is specified by both its magnitude and direction. Step 2) Evaluate each of the physical quantities and assign them to their proper category based on their definition and properties. In evaluating, you would need to understand what each quantity represents. For instance, 'mass' refers to the amount of matter in a body, which does not require direction, thus it is a scalar quantity. Step 3) Density, mass, speed, volume, angular frequency, and number of moles belong to the category of scalar quantities. For instance, 'speed' represents how fast an object moves, without considering the direction of the movement, which makes it a scalar quantity. Similarly, volume and density, being measurements of space occupied and mass per unit volume respectively, do not require a direction. Step 4) Velocity, acceleration, angular velocity, and displacement are classified as vector quantities. This is because each of these quantities not only has a magnitude but also comes with a specific directional aspect. For example, 'velocity' describes both how fast and in which direction an object is moving.",
    "Solution Outline": "Step 1) Define the properties of scalar and vector quantities. Step 2) Understand the meaning of each presented physical quantity. Step 3) Classify each quantity into either 'scalar' or 'vector' based on their definitions and properties. Scalar quantities, such as 'mass' and 'speed', have magnitude only. Step 4) Identify the quantities that show both magnitude and direction as vector quantities, such as 'velocity' and 'acceleration'."
}