{
    "Question": "Q.20. A body cools from 80 C to 50 C in 5 minutes. Calculate the time it takes to cool from 60C to 30 C. The temperature of the surroundings is 20 C.",
    "Original Solution": "Here,\r\nThe initial temperature of the body, T1=80 C\r\nThe final temperature of the body, T2 = =50 C\r\nAverage temperature, (T1 + T2) /2\r\n= (80 + 50)/2 = 65 C\r\nThe temperature of the surrounding, T0 =20 C\r\nThe temperature difference, ΔT= 65 C  – 20 C = 45 C\r\nt=5 min.\r\nAccording to Newton’s law of cooling, the rate of cooling is proportional to the difference in temperature\r\nChange in temperature/ Time = K ΔT\r\n(T2 – T1)/t = KΔT\r\n(80 – 50)/5 = K(45)\r\n6 = K(45)\r\nK = 6/45\r\nK = 2/15\r\nIn the second condition,\r\nThe initial temperature of the body, T1 =60 C\r\nThe final temperature of the body, T2 =30 C\r\nLet t be the time taken for cooling.\r\nAverage temperature, (T1 + T2)/2 = (60 + 30)/2 = 45 C\r\nTemperature difference, ΔT = 45 0C – 20 0C = 25 C\r\nAccording to Newton’s law of cooling, the rate of cooling is proportional to the difference in temperature\r\nChange in temperature/ Time = K ΔT\r\n(T2 – T1)/t = KΔT\r\n(60 – 30)/t = (2/15) (25)\r\n30/t = 3.33\r\nt = 30/3.33 = 9 min",
    "Detailed Solution": "Step 1) Begin by identifying the known quantities from the problem. These are the initial temperature of the body, T1=80 C, and the final temperature of the body, T2=50 C. The time it takes to cool these temperatures, t, equals 5 minutes. Also, the temperature of the surroundings, T0, is 20 C. Step 2) Next, calculate the average temperature. This is done by adding the initial and final temperatures together and dividing by 2: (T1 + T2) /2 = (80 + 50)/2 = 65 C. Step 3) Calculate the temperature difference, ΔT, by subtracting the surrounding temperature from the average temperature: ΔT= 65 C  – 20 C = 45 C. Step 4) Use Newton’s law of cooling to find the rate of cooling, K. According to Newton’s law of cooling, the rate of cooling is directly proportional to the difference in temperature. This can be formulated as: Change in temperature/ Time = K ΔT. By substituting the given values into this equation, we can solve for K: (T2 – T1)/t = KΔT yields (80 – 50)/5 =K(45). Solve for K: K = (80 – 50)/5 / 45 = K = 2/15. Step 5) The next part of the problem requires finding the time it will take for the body to cool from 60C to 30C. Start by identifying the new initial temperature of the body, T1=60 C, and the new final temperature of the body, T2=30 C. Step 6) Next, calculate the new average temperature to be (T1 + T2)/2 = (60 + 30)/2 = 45 C. By subtracting the surrounding temperature you should get the new temperature difference, ΔT= 45 C – 20 C = 25 C. Step 7) Utilize Newton’s law of cooling again, but this time solve for t since we now know K. Substitute the identified and calculated values into the equation to begin solving for t: (T2 – T1)/t = KΔT yields (60 – 30)/t = (2/15) (25). Solving for t, we find t = 30 / (2/15 * 25) = 9 minutes.",
    "Solution Outline": "Step 1) Identify the known quantities: the initial temperature (T1=80 C), final temperature of the body (T2=50 C), the time of cooling (t=5 mins), and the temperature of the surroundings (T0 =20 C). Step 2) Compute the average temperature with the formula: (T1 + T2) /2. Step 3) Obtain the temperature difference, ΔT, by subtracting the surrounding temperature (T0) from the calculated average. Step 4) Apply Newton’s law of cooling to find the rate of cooling, K by using the formula: (T2 – T1)/t = KΔT. Once all quantities are substituted, solve for K. Step 5) Now, shift to the second part of the problem, which is finding the time it takes for the body to cool from 60C to 30C. Identify the new average temperature by calculating: (T1 + T2)/2. Subtract the environment temperature (T0 = 20 C) from this average to find ∆T. Step 6) Apply Newton’s law of cooling once again, yet this time solve for the time, t by substituting the values into the equation (T2 – T1)/t = KΔT, and solve for t."
}