{
    "Question": "28. A stream of water flowing horizontally with a speed of 15 m/s pushes out of a tube of cross-sectional area 10^(-2) m^2 and hits at a vertical wall nearby. What is the force exerted on the wall by the impact of water, assuming that it does not rebound?\r\n",
    "Original Solution": "Speed of water flowing, v= 15 m/s\r\nCross-sectional area of the tube, A= 10^(-2) m^2\r\nIn one second, the distance travelled is equal to the velocity v\r\nDensity of water, ρ = 1000 kgm^(-3)\r\nMass of water hitting the wall per second = ρ x A x v\r\n= 1000 kgm-3 x 10-2 m2 x 15 m/s = 150 kg/s\r\nForce exerted on the wall because of the impact of water = momentum loss of water per second\r\n= Mass x velocity\r\n= 150 kg/s x 15 m/s = 2250 N",
    "Detailed Solution": "Step 1) First, we state the known quantities: The speed of the water is given as v = 15 m/s, and the cross-sectional area of the tube is given as A = 10^(-2) m^2. Step 2) We note that the distance covered by the flowing water per second is its velocity (v). This is because speed is defined as the distance traveled per unit time, or in this case, per second. Step 3) Next, we know the density of water, ρ, to be 1000 kgm^(-3). This is a standard physical value. Step 4) We calculate the mass of the water hitting the wall per second by multiplying the density, cross-sectional area, and velocity. In physical terms, this is because mass is equivalent to density multiplied by volume, and the volume flow rate here is the cross-sectional area multiplied by the velocity. The answer comes out to be 150 kg/s. Step 5) Then, we apply the fundamental concept in physics where the force exerted on the wall due to the water flow is equivalent to the momentum loss of the water per second. This is based on Newton's Second Law, which states that the rate of change of momentum of a body is directly proportional to the force applied and is in the direction of the force. Step 6) So, we calculate the force by multiplying the mass of the water hitting the wall per second (that we found in step 4) by the velocity. The answer is 2250 N. This is the force exerted by the water on the wall.",
    "Solution Outline": "Step 1) Identify the known quantities: speed of water (v = 15 m/s) and cross-sectional area of the tube (A = 10^(-2) m^2). Step 2) Acknowledge that the water's distance traveled per second is equal to its velocity. Step 3) Recall the standard value for the density of water (ρ = 1000 kgm^(-3)). Step 4) Find the mass of water impacting the wall each second by multiplying the density, area, and velocity. We use the physical understanding that mass equals density times volume, with volume flow rate being area times velocity. Step 5) Understand that the force on the wall from the water impact is the momentum change of the water each second, following Newton's Second Law. Step 6) Calculate the force, using the mass per second value found in step 4, and the velocity. This results in the final force exerted on the wall."
}