{
    "Question": "19. A shell of mass 0.020 kg is fired by a gun of mass 100 kg. If the muzzle speed of the shell is 80 ms^(-1).What is the recoil speed of the gun?",
    "Original Solution": "Mass of the shell, m = 0.020 kg\r\nMass of the gun, M = 100 Kg\r\nSpeed of the shell = 80 m/s\r\nThe initial velocity of the shell and the gun is zero. So, the initial momentum of the system is zero.\r\nApplying the law of conservation of momentum, the initial momentum is equal to the final momentum.\r\nSo,\r\n0 = mv – MV\r\nRecoil speed of the gun, v = mv/M\r\nv = (0.020 x 80)/100\r\nv = 0.016 m/s",
    "Detailed Solution": "Step 1) The problem involves a shell of mass 0.020 kg that is fired from a 100 kg gun with a speed of 80 m/s. These are the known values given in the problem. Step 2) Initially, both the gun and the shell are stationary. Thus, the initial momentum of the system, which is the sum of the momentum of the gun and the shell, is zero. This is because momentum, given by the product of mass and velocity, will be zero when the velocity is zero. Step 3) When the shell is fired, the system's momentum needs to remain unchanged due to the law of conservation of momentum. The final momentum of the system is given by the momentum of the shell (mass of shell times velocity of shell) minus the momentum of the gun (mass of gun times recoil speed of the gun), which must still equal to zero. Thus, we get the equation 0 = mv - MV, where m is the mass of the shell, v is the speed of the shell, M is the mass of the gun, and V is the recoil speed of the gun. Step 4) We can rearrange our equation to solve for the unknown variable we are interested in, which in this case is the recoil speed of the gun, V. We get V = mv/M. Step 5) At this point, we plug in the known values into our equation. Thus, V = (0.020 kg x 80 ms^(-1))/(100 kg). Step 6) Solving this expression, we find the recoil speed of the gun is 0.016 m/s. So, the gun moves backwards at a speed of 0.016 m/s as the shell is fired.",
    "Solution Outline": "Step 1) Identify known values: Mass of shell = 0.020 kg, mass of gun = 100 kg, and speed of shell = 80 m/s. Step 2) Understand that initially, the momentum of the system is zero as both gun and shell are stationary. Step 3) Apply the law of conservation of momentum. This leads to the equation 0 = mv - MV, since the momentum after firing is the momentum of the shell moving forward subtracted by the momentum of the gun recoiling backward. Step 4) Rearrange this equation to solve for recoil speed of the gun, V = mv/M. Step 5) Substitute the known values into this equation to find recoil speed of the gun. According to the solution, the result is 0.016 m/s."
}