{
    "Question": "Q13. ( i ) A child stands at the centre of a turntable with his two arms outstretched. The turntable is set to rotate with an angular speed of 40 rev/min. How much is the angular speed of the child if he folds his hands back and thereby reduces his moment of inertia to 2/5 times the initial value? Assume that the turntable rotates without friction\r\n( ii ) Show that the child’s new kinetic energy of rotation is more than the initial kinetic energy of rotation. How do you account for this increase in kinetic energy?",
    "Original Solution": "(a) Given,\r\nInitial angular velocity, ω1= 40 rev/min\r\nlet the final angular velocity = ω2\r\nLet the boy’s moment of inertia with hands stretched out = I1\r\nLet the boy’s moment of inertia with hands folded in = I2\r\nWe know :\r\nI2 = (2/5) I1\r\nAs no external forces are acting on the boy, the angular momentum will be constant.\r\nThus,  we can write\r\nI2 ω2  =  I1 ω1\r\nω2 = (I1/I2) ω1\r\n= [ I1 / (2/5)I1 ] × 40  =  ( 5/2 ) × 40  =  100 rev/min\r\n(b)  Final kinetic energy of rotation, EF = (1/2) I2 (ω2)^2\r\nInitial kinetic energy of rotation, EI =  (1/2) I1 (ω1)^2\r\nEF / EI = (1/2) I2 (ω2)^2 / (1/2) I1 (ω1)^2\r\n= (2/5) I1 (100)^2 / I1 (40)^2\r\n= 2.5\r\n∴ EF = 2.5 EI\r\nIt is clear that there is an increase in the kinetic energy of rotation, and it can be attributed to the internal energy used by the boy to fold his hands.",
    "Detailed Solution": "Step 1) We begin by identifying the known values. The initial angular speed ω1 is given as 40 rev/min. The child's moment of inertia is reduced to 2/5 its initial value when he folds his hands, so we'll call the initial moment of inertia I1 and the final moment of inertia I2. We can express I2 as (2/5)I1, according to the information given in the problem. Step 2) In the absence of external forces, the principle of conservation of angular momentum states that the initial and the final angular momentum of the system must be equal. We can express this condition mathematically as I1 ω1 = I2 ω2. Step 3) Here, we isolate the final angular speed ω2 on one side of the equation by dividing both sides by I2. The equation becomes ω2 = (I1/I2) ω1. Step 4) We substitute I2 = (2/5)I1 into the equation to find ω2 = (5/2) ω1. Replacing the known angular velocity from Step 1 ω1 = 40 rev/min gives ω2 = (5/2) × 40 = 100 rev/min. This is the new angular speed of the child when he folds his hands. Step 5) To assess the change in kinetic energy, we start by stating the formulas for the initial kinetic energy of rotation EI = (1/2)I1(ω1)^2 and the final kinetic energy of rotation EF = (1/2)I2(ω2)^2. Step 6) By dividing the equation for EF by the equation for EI, we can compare the initial and final kinetic energy. The result is EF / EI = (1/2)I2(ω2)^2 / (1/2)I1(ω1)^2, which simplifies to EF / EI = I2(ω2)^2 / I1(ω1)^2 since the 1/2 terms cancel out on each side. Step 7) Substituting our known values and ratios, we find EF / EI = (2/5)I1 (100)^2 / I1 (40)^2, which simplifies to EF / EI = 2.5. Step 8) Multiply both sides of the equation by EI to get EF = 2.5EI. This means the final kinetic energy of rotation is 2.5 times greater than the initial value. The increase in kinetic energy comes from the internal energy used by the child to contract his arms.",
    "Solution Outline": "Step 1) Identify known values including initial angular velocity ω1 and how the child's moment of inertia changes when he folds his hands. Step 2) Apply the conservation of angular momentum to express the constancy of the system's angular momentum, I1 ω1 = I2 ω2. Step 3) Rearrange this equation to solve for final angular velocity ω2 = (I1/I2) ω1. Step 4) Substitute the given relationship between initial and final moments of inertia to find the new angular speed. Step 5) Write out formulas for initial and final kinetic energies of rotation EI = (1/2)I1(ω1)^2 and EF = (1/2)I2(ω2)^2. Step 6) Create a comparative ratio of final to initial kinetic energies EF / EI and simplify the equation. Step 7) Substitute in known values and ratios to find the relationship between the initial and final kinetic energies. Step 8) Determine the final kinetic energy is 2.5 times the initial, indicating an increase due to the child's expended energy to move his arms."
}