{
    "Question": "16. Answer the following questions :(a) Time period of a particle in SHM depends on the force constant k and mass m of the particle:T = = 2π (√m/√k)A simple pendulum executes SHM approximately. Why then is the time period of a pendulum independent of the mass of the pendulum?\r\n(b) The motion of a simple pendulum is approximately simple harmonic for small-angle oscillations. For larger angles of oscillation, a more involved analysis shows that T is greater than 2π(√l/√g). Think of a qualitative argument to appreciate this result.\r\n(c) A man with a wristwatch on his hand falls from the top of a tower. Does the watch give the correct time during the free fall?\r\n(d) What is the frequency of oscillation of a simple pendulum mounted in a cabin that is freely falling under gravity?",
    "Original Solution": "(a)  In the case of a simple pendulum, the spring constant k is proportional to the mass. The m is the numerator and the denominator will cancel each other. Therefore, the time period of the simple pendulum is independent of the mass of the bob.\r\n(b) The restoring force acting on the bob of a simple pendulum is given by the expression\r\nF=−mgsinθ\r\nF is the restoring force\r\nm is the mass of the bob\r\ng is the acceleration due to gravity\r\nθ is the angle of displacement\r\nWhen θ is small, sinθ≈θ.\r\nThen the expression for the time period of a simple pendulum is given by T=2π(√l/√g)\r\nWhen θ is large, sinθ<θ. Therefore, the above equation will not be valid. There will be an increase in the time period T.\r\n(c) Wristwatch works on spring action and does not depend on the acceleration due to gravity. Therefore, the watch will show the correct time.\r\n(d) During the free fall of the cabin, the acceleration due to gravity will be zero. Therefore the frequency of oscillation of the simple pendulum will also be zero.",
    "Detailed Solution": "Step 1) Upon given the formula for the time period of a particle in simple harmonic motion (SHM) as T = 2π (√m/√k), we gather that the time period T depends on both the force constant k and the mass m of the particle. We need to determine why, when it comes to a simple pendulum (which executes SHM), the time period T doesn't rely on the mass of the pendulum. Looking into the formula, the mass (m) and the force constant (k) appear in ratio under the square root. If any system possesses a force constant proportional to its mass (like in the case of a pendulum), the effect of mass in the ratio √m/√k will cancel out, since the mass in numerator and denominator nullify each other. This explains why the time period of a simple pendulum is independent of its mass. \nStep 2) The time period of a simple pendulum can be formulated as T=2π(√l/√g) where 'l' represents the length of the pendulum and 'g' is the acceleration due to gravity. The derivation of this formula makes certain assumptions - one being that the pendulum oscillates in such small angles that the sinθ is approximately equal to θ. When the pendulum oscillates in larger angles, these assumptions do not hold any longer, making the derived formula invalid. In such cases, sinθ itself is less than θ which leads to an increase in the time period T of the pendulum. \nStep 3) When a man with a wristwatch falls from a tower, we need to determine whether the watch will show the correct time during the fall. The wristwatch works based on the spring action which is independent of gravitational acceleration. Thus, even during the fall where gravity plays a significant role, the wristwatch isn't affected by it and continues to function normally, showing the correct time. \nStep 4) In case of a simple pendulum being mounted in a freely falling cabin, would it show any frequency of oscillation? In free fall scenarios, the effective gravitational acceleration becomes zero as the cabin is falling with the same acceleration. In the absence of gravitational pull, the pendulum would not oscillate, leading to the frequency of oscillation being zero.",
    "Solution Outline": "Step 1) Recognize that the time period T = 2π (√m/√k) given in the question is applicable for a particle in simple harmonic motion (SHM). For a simple pendulum executing SHM, the force constant k is proportional to the mass m. This characteristic property causes cancellation between the mass present in the numerator and denominator, thus making T independent of m. \nStep 2) Understand the assumptions made in calculating the time period of a simple pendulum as T=2π(√l/√g). For small angles of oscillation, as assumed in derivation, sinθ is approximated to θ. But for larger angles, sinθ becomes less than θ, which hence invalidates the formula and increases the time period. \nStep 3) Acknowledge the fact that a wristwatch works on spring action, which is unaffected by gravity. So, even in free fall scenarios where gravity plays a significant role, the wristwatch shows the correct time. \nStep 4) During free fall, as in the case of a cabin, it maintains zero acceleration with respect to gravitational pull. In such a scenario, a pendulum inside the cabin would not oscillate, resulting in zero frequency."
}