{
    "Question": "3: Fill in the blanks using the word(s) from the list appended with each statement.\r\n(a) The surface tension of liquids generally … with temperatures. (increases/decreases)\r\n(b) The viscosity of gases … with temperature, whereas the viscosity of liquids … with temperature. (increases/decreases)\r\n(c) For solids with an elastic modulus of rigidity, the shearing force is proportional to …, while for fluids, it is proportional to … (shear strain/rate of shear strain)\r\n(d) For a fluid in a steady flow, the increase in flow speed at a constriction follows. (conservation of mass/Bernoulli’s principle)\r\n(e) For the model of a plane in a wind tunnel, turbulence occurs at a … speed for turbulence for an actual plane. (greater/smaller)",
    "Original Solution": "(a) decreases\r\n(b) increases; decreases\r\n(c) shear strain; rate of shear strain\r\n(d) conservation of mass; Bernoulli’s principle\r\n(e) greater",
    "Detailed Solution": "Step 1) We start with statement (a). The surface tension of liquids generally decreases with temperature. Imagine a pan of water on a hot stove; as the water becomes hotter (its temperature increases), it begins to boil, breaking the surface tension that held the molecules together. So, the correct word to fill the blank is 'decreases'. Step 2) Moving on to statement (b), the first part of the sentence deals with gases. As the temperature of a gas increases, the kinetic energy of its molecules also increases, causing the molecules to bump into each other more frequently and with more force. This results in an increased resistance to flow, or what is commonly known as an increase in viscosity. So, the correct word for the first blank is 'increases'. When it comes to liquids, it's a bit of a different story. As temperature increases, the kinetic energy of the molecules also increases, but this allows the molecules to slide past each other more easily, effectively decreasing the resistance to flow, or viscosity. Therefore, the correct word to fill the second blank is 'decreases'. Step 3) Statement (c) discusses the shearing force for solids and fluids. In solids, the shearing force is proportional to the shear strain i.e., the deformation of the solid under the applied force. But in the case of fluids, the shearing force is proportional to the rate of shear strain as it indicates not just the amount of deformation, but how that deformation changes with time. Thus, the words to fill in the blanks are 'shear strain' and 'rate of shear strain' respectively. Step 4) Now, let's take a look at statement (d). The behavior of a fluid in a steady flow at a point of constriction follows the conservation of mass, and more complexly, Bernoulli’s principle. According to Bernoulli’s principle, an increase in the speed of a fluid occurs simultaneously with a decrease in pressure or decrease in the fluid's potential energy. So, the correct phrases to fill in the blank are 'conservation of mass' and 'Bernoulli’s principle'. Step 5) Lastly, statement (e) talks about turbulence in a wind tunnel. Turbulence at such a contained and small scale will occur at a greater speed in comparison to a full-scale, real-world scenario because the model of a plane in the wind tunnel is much smaller and hence requires greater speed to replicate the same conditions as an actual plane. Thus, the correct word to fill in the blank is 'greater'.",
    "Solution Outline": "Step 1) In statement (a), the surface tension of liquids decreases with temperature. Step 2) In statement (b), the viscosity of gases increases with temperature and the viscosity of liquids decreases with temperature due to the changes in molecular kinetic energy. Step 3) In statement (c), the shearing force for solids is proportional to shear strain and for fluids it is proportional to the rate of shear strain. Step 4) In statement (d), fluid behavior at constrictions follows the conservation of mass and Bernoulli’s principle. Step 5) In  statement (e), turbulence occurs at a greater speed for a model plane in a wind tunnel compared to an actual plane."
}