{
    "Question": "Q1. A string of mass 2.50 kg is under a tension of 200 N. The length of the stretched string is 20.0 m. If the transverse jerk is struck at one end of the string, how long does the disturbance take to reach the other end?",
    "Original Solution": "Given,\r\nMass of the string, M = 2.50 kg\r\nTension in the string, T = 200 N\r\nLength of the string, l = 20.0 m\r\nMass per unit length, μ = M /l = 5/40 = 0.125 kg / m\r\nWe know,\r\nVelocity  of the transverse wave , v = \\(\\begin{array}{l}\\sqrt{\\frac{T}{\\mu }}\\end{array} \\)\r\n= \\(\\begin{array}{l}\\sqrt{\\frac{200}{0.125 }}\\end{array} \\) = 40 m/s\r\nTherefore, the time taken by the transverse wave to reach the other side is 40 m/s.",
    "Detailed Solution": "Step 1) To start off, let’s clearly state the known values that are given in the problem. These are: the mass of the string (M) which equals 2.50 kg, the tension in the string (T) which equals 200 N, and the length of the string (l) which equals 20.0 m. Step 2) Next up, we need to determine mass per unit length (μ). We can find this by dividing the total mass of the string by its total length. In mathematical terms, we perform μ = M / l, resulting in 0.125 kg / m. This calculation gives us the density of the string - showing how much mass it contains in each metre. Step 3) We then use the formula for the velocity of the transverse wave (v). This formula is v = √(T / μ). The velocity of a wave is determined by the root of the tension divided by the mass density. Higher tension and lower density will result in a faster wave. Step 4) By plugging in the given tension (200 N) and our calculated mass per unit length (0.125 kg / m) into the equation, we get v = √(200 / 0.125). This results in a wave velocity of 40 m/s. Step 5) Lastly, we know that the disturbance travels at the speed of the wave and therefore the time it takes to reach the other side is simply the length (20m) divided by the wave's velocity (40 m/s). As we've determined v to be 40 m/s, this implies that the disturbance takes half a second to reach the other end.",
    "Solution Outline": "Step 1) Begin by identifying and stating the known values: Mass of the string (M) is 2.50 kg, tension in the string (T) is 200 N and length of the string (l) is 20.0 m. Step 2) Calculate the mass per unit length (μ) of the string by dividing the total mass M by length l, giving us 0.125 kg / m. This allows us to determine the wave's density. Step 3) Use the wave speed formula, v = √(T / μ), to determine how fast the disturbance will travel along the string. This step combines the string's period and its characteristics. Step 4) Substitute the given tension (T = 200 N) and your calculated mass per unit length (μ = 0.125 kg / m) into the formula from Step 3 to solve for v, ultimately finding a velocity of 40 m/s. Step 5) By knowing that the disturbance moves at the speed of the wave, determine the time it takes to reach the other side. We simply divide the length (l = 20m) by the wave's velocity (v = 40 m/s). This results in the disturbance taking half a second to reach the other end of the string."
}