{
    "Question": "Q6.  A bat emits the ultrasonic sound of frequency 1000 kHz in air. If the sound meets a water surface, what is the wavelength of (a) the reflected sound and (b) the transmitted sound? The speed of sound in air is 340 m s^–1, and in water, 1486 m s^–1.",
    "Original Solution": "Given,\r\nFrequency of the ultrasonic sound, ν = 1000 kHz = 10^6 Hz\r\nSpeed of sound in air, vA = 340 m/s\r\nWe know,\r\n(a) The wavelength ( λR ) of the reflected sound is:\r\nλR = vA /v\r\n= 340/10^6 = 3.4 x 10^-4 m\r\n(b) Speed of sound in water, vW = 1486 m/s\r\nTherefore, the wavelength (λT )of the transmitted sound is:\r\nλT = 1486 / 10^6\r\n= 1.49 x 10^-3 m.",
    "Detailed Solution": "Step 1) Let's begin by reviewing the given information. We know that the frequency of the ultrasonic sound (ν) emitted by the bat is 1000 kHz or 10^6 Hz (since 1 kHz is equal to 10^3 Hz). We also know that the speed of sound in air (vA) is 340 m/s and in water (vW) it is 1486 m/s. \n\nStep 2) Now, to figure out the wavelength of the reflected sound (λR) in the air, we need to remember the fundamental formula related to wave theory, which is λ = v/ν, where v is the speed of the wave, and ν is the frequency. Here, as the speed of sound in air is given, we substitute vA for v in the equation.\n\nStep 3) Here, we plug the values into the formula λR = vA/ν, substituting the given values 340 m/s for vA and 10^6 Hz for ν. So, after calculation, we have λR equals 3.4 x 10^-4 m. So, the wavelength of the reflected sound in the air is 3.4 x 10^-4 m.\n\nStep 4) Let's now figure out the wavelength of the transmitted sound into the water (λT). Keeping to the same formula λ = v/ν, this time we will use the speed of sound in water, vW. \n\nStep 5) Substitute the known values into the equation λT = vW/ν, using 1486 m/s for vW and 10^6 Hz for ν. The calculation gives us λT equals 1.49 x 10^-3 m. So, the wavelength of the transmitted sound in the water is 1.49 x 10^-3 m.",
    "Solution Outline": "Step 1) Go through the given information which includes the frequency of the ultrasonic sound emitted by the bat, the speed of sound in air, and in water.\n\nStep 2) To find the wavelength of the reflected sound, we use the equation λ = v/ν, where v is the speed of the wave, and ν is its frequency.\n\nStep 3) Substitute the given values into the formula λR = vA/ν to find the wavelength of the reflected sound in the air.\n\nStep 4) To calculate the wavelength of the transmitted sound in the water, use the same λ = v/ν, this time with the speed of sound in water, vW. \n\nStep 5) Input the known values into the equation λT = vW/ν to calculate the wavelength of sound after it penetrates the water."
}