{
    "Question": "5. A particle is in linear simple harmonic motion between two points, A and B, 10 cm apart. Take the direction from A to B as the positive direction and give the signs of velocity, acceleration and force on the particle when it is \r\n(a) at the end A\r\n(b) at the end B\r\n(c) at the mid-point of AB going towards A\r\n(d) at 2 cm away from B going towards A\r\n(e) at 3 cm away from A going towards B\r\n(f) at 4 cm away from B going towards A",
    "Original Solution": "(a) Zero, Positive, Positive\r\n(b) Zero, Negative, Negative\r\n(c) Negative, Zero, Zero\r\n(d) Negative, Negative, Negative\r\n(e) Positive, Positive, Positive\r\n(f) Negative, Negative, Negative\r\n\r\nExplanation:\r\n\r\n(a), (b) The given situation is shown in the following figure. Points A and B are the two end points, with AB = 10 cm, where ‘O’ is the midpoint of the path.\r\n\r\nA particle is in linear simple harmonic motion between the end points. At the extreme point A, the particle is at rest momentarily. Therefore, its velocity is zero at this point. Its acceleration is positive as it is directed along AO. Force is also positive in this case as the particle is directed rightward.\r\n\r\nAt the extreme point B, the particle is at rest momentarily. Therefore, its velocity is zero at this point\r\n\r\n(c) The particle is executing a simple harmonic motion. ‘O’ is the mean position of the particle. Its velocity at the mean position O is the maximum. The value for velocity is negative since the particle is directed leftward. The acceleration and force of a particle executing SHM is zero at the mean position.\r\n\r\n(d) The particle is moving toward point O from the end B. This direction of motion is opposite to the conventional positive direction, which is from A and B. Therefore, the particle’s velocity and acceleration, and the force on it are all negative.\r\n\r\n(e) The particle is moving toward point O from the end A. This direction of motion is from A to B, which is the conventional positive direction. Therefore, the values for velocity, acceleration and force are all positive.\r\n\r\n(f) This case is similar to the one mentioned in (d)",
    "Detailed Solution": "Step 1) Firstly, identify the known values. The end points A and B are 10 cm apart, and the positive direction is from A to B. The particle is moving in a simple harmonic motion (SHM), its extremities being A and B. In the SHM, there's a point of equilibrium or the mid-point, denoted as 'O'. Step 2) For point A, observe that the particle momentarily comes to rest at the extremities in SHM, hence the velocity is Zero. The acceleration and force are directed towards the mean position which in this scenario is in the direction from A to B, hence they are Positive. Step 3) For point B, as with A, the velocity is Zero. However, in this case, the acceleration and force are directed towards the mean position which is in the direction from B to A, contrary to our defined positive direction, hence both are Negative. Step 4) At mid-point 'O', the particle will be moving at its highest velocity which is directed towards A, hence is Negative. The acceleration and force at the mid-point in SHM are both Zero since the particle is at equilibrium or the mean position. Step 5) When the particle is 2 cm away from B and moving towards A, the direction of motion, acceleration, and force on it are all contrary to the defined positive direction and therefore, Negative. Step 6) When the particle is 3 cm away from A and moving towards B, the direction of motion, acceleration, and force on it are all similarly in the positive direction and thus, Positive. Step 7) At 4 cm away from B going towards A, the direction of motion, acceleration, and force on it are all opposite to the positive direction, hence they are Negative.",
    "Solution Outline": "Step 1) Define known values. The end points A and B are 10 cm apart, and the positive direction is from A to B. The point of equilibrium in SHM is 'O'. Step 2) For point A, the velocity is Zero as it's momentarily at rest, and the acceleration and force are Positive as they are in the direction from A to B. Step 3) For point B, we find a similar situation but the acceleration and force are directed in the opposite direction hence are Negative. Step 4) At equilibrium or mid-point 'O', the velocity is Negative and is at its maximum, and the particle is not being forced or accelerated hence the acceleration and force are both Zero. Step 5) At points 2 cm away from B, 3 cm away from A, and 4 cm away from B with specified directions, the direction agreed upon is checked, and the force, velocity, and acceleration are designated as either positive or negative depending on whether they are in line with or against the positive direction."
}