{
    "Question": "23: A star 2.5 times the mass of the sun and collapsed to a size of 12 km rotates with a speed of 1.2 rev. per second. (Extremely compact stars of this kind are known as neutron stars. Certain stellar objects called pulsars belong to this category.) Will an object placed on its equator remain stuck to its surface due to gravity? (Mass of the sun = 2×10^30 kg)   ",
    "Original Solution": "Any matter/object will remain stuck to the surface, if the outward centrifugal force is lesser than the inward gravitational pull.\r\nGravitational force, fG = \\(\\begin{array}{l}\\frac{GM\\;m}{R^{2}}\\end{array} \\) [Neglecting negative sign]\r\n\r\nHere,\r\nM = Mass of the star = 2.5× 2 × 10^30 = 5 × 10^31 kg\r\nm = Mass of the object\r\nR = Radius of the star = 12 km = 1.2 ×10^4 m\r\nTherefore, fG = \\(\\begin{array}{l}\\frac{(6.67\\times 10^{-11})\\times (5\\times 10^{31})\\;m}{(1.2\\times 10^{4})^{2}}=1.334\\times 10^{13}m\\;N\\end{array} \\)\r\n\r\nNow, Centrifugal force, fc= m r ω^2\r\nHere, ω = Angular speed = 2πν\r\nν = Angular frequency = 10 rev s^–1\r\nfc = m R (2πν)^2\r\nfc = m × (1.2 x 10^4) × 4 × (3.14)^2 × (1.2)^2 = (6.82 ×10^5m) N\r\nAs fG > fC, the object will remain stuck to the surface of the black hole.",
    "Detailed Solution": "Step 1) The first thing we need to do is establish the problem: we are trying to determine whether an object will be able to stay affixed to the surface of a neutron star. For the object to stay on the surface of the star, the inward pull of gravity needs to be stronger than the outward push of centrifugal force. Therefore, we need to calculate both of these forces and compare them. Step 2) We begin by calculating the gravitational force. The formula to calculate the gravity force is fG = GMm/R^2. In this formula, G is the universal gravitational constant, M is the mass of the star, m is the mass of the object that we want to stick to the star, and R is the radius of the star. Step 3) We know the M, G, and R values. M is given as 2.5 times the mass of the sun, or 5 x 10^30 kg (we get this by multiplying 2.5 by the known mass of the sun, which is 2 x 10^30 kg). The sun mass is a standard value that you should remember or can look up. Converting the star radius from kilometers to meters gives us 1.2 x 10^4 m. Finally, G is the universal gravitational constant, which is 6.67 x 10^-11 N(m/Kg)^2. Step 4) Substituting these values into the formula gives us fG = (6.67x10^-11)x(5x10^30)m/(1.2x10^4)^2 = 1.334x10^13mN. So, this is the gravitational pull on the object. Step 5) Now let's calculate the centrifugal force. The centrifugal force fc can be represented as fc = mRω^2, where m is the mass of the object, R is the radius of the star, and ω is the angular speed. Step 6) We convert the revolutions per second to angular speed, ω = 2πν, where ν is the revolution frequency, given as 1.2 rev/s. Plugging these values into the formula gives us fc = m x (1.2 x 10^4) x 4π^2 x (1.2)^2 = (6.82 x 10^5m) N. Step 7) Now we have the gravitational force and the centrifugal force. By comparing these two forces, we see that the gravitational force is greater than the centrifugal force (1.334x10^13N > 6.82x10^5N), meaning that the object will remain stuck to the surface of the neutron star.",
    "Solution Outline": "Step 1) For an object to stick to a rotating body, the body's gravitational pull should be greater than the centrifugal force. Step 2) Compute the gravitational pull using the formula fG = GMm/R^2, where G is the gravitational constant, M is the star's mass, m is the object's mass, and R is the star's radius. Step 3) Plug the known values into the formula to get the gravitational force fG. Step 4) Compute the centrifugal force using the formula fc = mRω^2, where m is the object's mass, R is the star's radius, and ω is the angular speed. Step 5) Convert the given revolution speed per second to the angular speed, ω. Step 6) Plug these values into the formula to calculate the centrifugal force, fc. Step 7) Compare the gravitational and centrifugal forces. The object stays on the neutron star's surface if the gravitational force is larger."
}