{
    "Question": "Q.7. A large steel wheel is to be fitted on to a shaft of the same material. At 27 C, the outer diameter of the shaft is 8.70 cm, and the diameter of the central hole in the wheel is 8.69 cm. The shaft is cooled using ‘dry ice’. At what temperature of the shaft does the wheel slip on the shaft? Assume the coefficient of linear expansion of the steel to be constant over the required temperature range: αsteel = 1.20 × 10^(–5) K^–1.",
    "Original Solution": "Temperature, T= 27 C\r\nThe outer diameter of the shaft at 27 C is d1 = 8.70 cm\r\nThe diameter of the central hole in the wheel at 27 C is d2 = 8.69 cm\r\nThe oefficient of linear expansion of steel, αsteel​=1.2×10^(–5) K^−1\r\nThe temperature at which the wheel will slip on the shaft = T1​\r\nChange due to cooling\r\nd2= d1(1+αΔT)\r\nd2 = d1[1+α(T1 – T)]\r\nd2 – d1 = d1 α(T1 – T)\r\n8.69 – 8.70 = 8.70 x 1.2×10^(–5) x (T1 – 27)\r\n-0.01 = 10.44 ×10^(–5) x (T1 – 27)\r\n-0.01/ (10.44 ×10^(–5) ) = T1 – 27\r\nT1 = 27 – [0.01/ (10.44 ×10^(–5) )]\r\nT1 = 27 – 95.7 = -68.7\r\nTherefore, the wheel will slip on the shaft when the temperature of the shaft is -68.7 C.",
    "Detailed Solution": "Step 1) To begin, we identify the known values provided in the problem. These include the initial temperature, T = 27 C, the outer diameter of the shaft (d1) = 8.70 cm, the diameter of the central hole in the wheel (d2) = 8.69 cm, and the linear expansion coefficient for steel (α), which is 1.2x10^(–5) K^–1. Step 2) We need to identify the equation for the change in the diameters due to cooling which is d2= d1(1+αΔT). ΔT represents the change in temperature. Step 3) We reorganize the equation to get the difference in diameters on one side and the remaining expression on the other. The equation then looks like this: d2 - d1 = d1 α(T1 – T). Step 4) We substitute the known values in the rearranged equation: 8.69 cm - 8.70 cm = 8.70 cm x 1.2×10^(–5) K^–1 x (T1 – 27 °C). This comes out as -0.01 = 10.44 ×10^(-5) (T1 – 27). Step 5) Further simplify to isolate T1, the final temperature that results in the wheel slipping onto the shaft. This gives: -0.01/(10.44 ×10^(–5)) = T1 – 27. Step 6) Solve for T1 by adding 27 to both sides of the equation. The solution to this equation is T1 = 27 - [0.01/ (10.44 ×10^(-5))]. Calculation gives T1 = 27 – 95.7 = -68.7 C. Therefore, the wheel will slip on the shaft when the shaft is cooled to this temperature of -68.7 °C.",
    "Solution Outline": "Step 1) Start by identifying and stating the known values from the question. Step 2) Use the formula for linear thermal expansion which considers the change in object dimensions using the expansion coefficient and change in temperature. Step 3) Modify the formula to get the difference in diameters on one side. This modification ties the change in size with the temperature difference. Step 4) Substitute the known values into the equation yielding an expression that can be solved for the final temperature, T1. Step 5) You'll arrive at an equation where T1 can be isolated by dividing both sides of the equation by the multiplicative constant. Step 6) Lastly, solve for T1 to find the temperature needed for the wheel to slip on the shaft."
}