{
    "Question": "15. A pump on the ground floor of a building can pump up water to fill a tank of volume 30 m^3 in 15 min. If the tank is 40 m above the ground, and the efficiency of the pump is 30%, how much electric power is consumed by the pump?",
    "Original Solution": "The volume of the tank= 30 m^3 \r\nTime taken to fill the tank= 15 min = 15 x 60 = 900s\r\nHeight of the tank above the ground, h = 40 m\r\nThe efficiency of the pump, η= 30%\r\nThe density of water, ρ= 10^3 kg m^(-3)\r\nThe mass of water pumped, m = volume x density = 30 x 10^3 kg\r\nPower consumed or output power p0utput = W/t = mgh/t\r\n=(30 x 10^3 x 9.8 x 40)/900=13066 watt\r\nEfficiency, η = Poutput/Pinput\r\nPinput  =  Poutput/η = 13066/(30/100) = 1306600/30\r\n= 43553 W = 43.6 kW",
    "Detailed Solution": "Step 1) To begin with, let's first list out the knowns from the problem. Volume of the tank V = 30 m^3, time to fill the tank t = 15 min, height of tank from the ground h = 40m, the pump's efficiency η = 30%, density of water ρ= 10^3 kg/m^3. Step 2) Notice that the time is given in minutes, so we need to convert this into seconds for our further calculations. We know that one minute equates to 60 seconds, so multiplying 15 minutes by 60 equals 900 seconds. Step 3) We are asked to find the electric power consumed, but first we should determine the mass m of the water. We can do this through the equation m = V × ρ, which comes from the fact that density is defined as mass per unit volume. Substituting our knowns into the equation we get m = 30 m^3 × 10^3 kg/m^3 = 30 x 10^3 kg. Step 4) We then use this mass in the equation for output power: Poutput = W/t, where W = work done, which is calculated using the equation for gravitational potential energy mgh. Therefore, we have Poutput= mgh/t. Substituting our knowns into the equation, we get Poutput = (30 x 10^3 kg x 9.8 m/s^2 x 40 m)/900 s = 13066 watts. Step 5) Now, we know the output power. However, we're asked how much electric power is consumed by the pump, which is the input power. Since the pump's efficiency is less than 100%, it will consume more power than it outputs. So, we rearrange the efficiency equation η = Poutput / Pinput to solve for Pinput. The solution is Pinput = Poutput / η = 13066W / (30/100)= 43553 W or 43.6 kW.",
    "Solution Outline": "Step 1) Start by identifying the given values: Tank volume, time to fill the tank, tank height, pump efficiency and water density. Step 2) Convert the given time to fill the tank from minutes to seconds since the standard SI unit for time is seconds. Step 3) Calculate the mass of the water using volume and density from step 1. Step 4) Determine the output power of the pump using the mass of the water, gravity, height, and time. This involves using the formula for gravitational potential energy (mgh) divided by time. Step 5) Finally, find the power consumed by the pump, noting that this is more than the output power since the efficiency is less than 100%. This is done by rearranging the efficiency formula to solve for the input energy."
}