{
    "Question": "17. A nucleus is at rest in the laboratory frame of reference. Show that if it disintegrates into two smaller nuclei, the products must move in opposite directions.",
    "Original Solution": "Let m1, m2 be the masses of the two daughter nuclei and v1,v2 be their respective velocities of the daughter nuclei. Let m be the mass of the parent nucleus.\r\nTotal linear momentum after disintegration = m1v1 +m2 v2.\r\nBefore disintegration, the nucleus is at rest. Therefore, its linear momentum before disintegration is zero.\r\nApplying the law of conservation of momentum,\r\nTotal linear momentum before disintegration = Total linear momentum after disintegration\r\n0 = m1v1 + m2v2\r\nv1=-m2v2/m1\r\nThe negative sign indicates v1 and v2 are in opposite directions.",
    "Detailed Solution": "Step 1) In this problem, we are dealing with a parent nucleus, which is initially at rest, disintegrating into two smaller daughter nuclei. Since no other information is given, the mass of the parent nucleus is denoted as m. The masses of the two daughter nuclei are symbolised as m1 and m2, and the velocities they gain after the disintegration are respectively represented as v1 and v2. It should be noted that the vectors attached to these velocity variables signify the direction of motion for each daughter nucleus.\n\nStep 2) It is a fundamental law of physics that the total linear momentum of a closed system remains constant unless acted on by an outside force; this is known as the Law of Conservation of Momentum.\n\nStep 3) Before the disintegration, the parent nucleus is at rest which means its velocity is zero and hence, linear momentum (which is the product of mass and velocity) is also zero.\n\nStep 4) After the disintegration, the linear momentum is the sum of the momenta of the two daughter nuclei, which would be m1v1 + m2v2.\n\nStep 5) According to the Law of Conservation of Momentum, the total linear momentum before the disintegration should equal to the total linear momentum after the disintegration. As a result, we have the equation 0 = m1v1 + m2v2.\n\nStep 6) Solving this equation gives us v1 = - m2v2/m1.\n\nStep 7) The negative sign before the m2v2/m1 ratio implies that v1 and v2 are in opposite directions. This is the consequence of the fact that they must have equal magnitude but opposite directions to ensure the total momentum remains zero, which confirms that the two daughter particles move in opposite directions after the disintegration.",
    "Solution Outline": "Step 1) Identify the parameters: m as the mass of the parent nucleus, m1 and m2 as the masses of the daughter nuclei, and v1 and v2 as their velocities.\n\nStep 2) Recall the principle of the law of conservation of momentum, stating that total momentum must remain constant in a closed system.\n\nStep 3) As the parent nucleus is initially at rest, its momentum (mass * velocity) is zero.\n\nStep 4) After the disintegration, the momentum becomes the sum of the momenta of the two daughter nuclei, i.e., m1v1 + m2v2.\n\nStep 5) Apply the Law of Conservation of Momentum, setting the momentum before equal to the momentum after gives 0 = m1v1 + m2v2.\n\nStep 6) Solve the equation and find that v1 = - m2v2/m1.\n\nStep 7) The equation tells us that the velocities are in opposite directions as represented by the negative sign in the equation."
}