{
    "Question": "8. A spring balance has a scale that reads from 0 to 50 kg. The length of the scale is 20 cm. A body suspended from this balance, when displaced and released, oscillates with a period of 0.6 s. What is the weight of the body?",
    "Original Solution": "Given\r\nMaximum mass that the scale can read, M = 50 kg\r\nMaximum displacement of the spring = Length of the scale, l = 20 cm\r\n= 0.2 m\r\nTime period, T = 0.6 s\r\nMaximum force exerted on the spring, F = mg\r\nWhere,\r\ng = acceleration due to gravity = 9.8 m/s2\r\nF = 50 x 9.8 = 490\r\nHence,\r\nSpring constant, k = F / l\r\n= 490 / 0.2\r\nWe get,\r\n= 2450 N m^-1\r\nMass m is suspended from the balance.\r\nTime period, t = 2π√m / k\r\nTherefore,\r\nm = (T / 2π)2 x k\r\n= {0.6 / (2 x 3.14)}2 x 2450\r\nWe get,\r\n= 22.36 kg\r\nHence, weight of the body = mg = 22.36 x 9.8\r\nOn calculation, we get,\r\n= 219.13 N\r\nTherefore, the weight of the body is about 219 N",
    "Detailed Solution": "Step 1) Start by listing out what is given in the question. We know that the scale can read a maximum mass, M = 50 kg, and the length of the scale, is also equal to maximum displacement of the spring l = 20 cm which needs to be converted into meters resulting in 0.2 m. The body oscillates with a given period, T = 0.6 s. \nStep 2) We can establish that the maximum force exerted on the spring, F relates to the maximum mass that the scale can read through the gravitational force equation F = mg. Here, g stands for acceleration due to gravity, which is generally accepted to be 9.8 m/s².\nStep 3) Proceed to calculate the force by multiplying max mass and acceleration due to gravity, F = 50 kg x 9.8 m/s² = 490 N.\nStep 4) Using this force F, we can then find the spring constant, k, which is calculated as the force F divided by length l, i.e., k = F / l = 490 N / 0.2 m = 2450 N m^-1. \nStep 5) Recall that the mass (m) of the body can be calculated considering that it's suspended from the balance. We know the Time period, T, and it can be related to mass m and spring constant k using the formula for the period of an oscillating spring T = 2π√m / k.\nStep 6) Rearrange the formula to solve for m, we get m = (T / 2π)² x k. Insert the known values into the equation: m = {0.6 s / (2 x 3.14)}² x 2450 N m^-1, which yields a mass of 22.36 kg. \nStep 7) Finally, use the formula of gravity force again to convert mass into weight, because the problem asks for the weight. Weight= mg = 22.36 kg x 9.8 m/s². After performing the calculation, we see that the weight of the body is approximately 219 N.",
    "Solution Outline": "Step 1) Identify the given values: mass M, displacement l, time period T. \nStep 2) Understand the gravitational force equation F = mg and its application here. \nStep 3) Calculate the force F using the mass M and gravitational acceleration g. \nStep 4) Discover the spring constant's (k) relation to the force F and displacement l, and calculate its value. \nStep 5) Recognize the formula for the period of an oscillating spring T = 2π√m / k and its relevance. \nStep 6) Rearrange this formula to solve for the weight mass m of the body and plug in the known values. \nStep 7) Finally, convert the resultant mass into weight using the gravitational force equation because the problem asks for the weight."
}