{
    "Question": "1. Give the magnitude and direction of the net force acting on \r\n(a) a drop of rain falling down with a constant speed\r\n(b) a cork of mass 10 g floating on water\r\n(c) a kite skillfully held stationary in the sky\r\n(d) a car moving with a constant velocity of 30 km/h on a rough road\r\n(e) a high-speed electron in space far from all material objects, and free of electric and magnetic fields.",
    "Original Solution": "(a) The raindrop is falling at a constant speed. Therefore, acceleration will become zero. When acceleration is zero, the force acting on the drop will become zero since F = ma.\r\n(b) The cork is floating on water, which means the weight of the cork is balanced by the upthrust. Therefore, the net force on the cork will be zero\r\n(c) Since the car moves with a constant velocity, the acceleration becomes zero. Therefore, the force will be zero.\r\n(d) The net force acting on the high-speed electron will be zero since the electron is far from the material objects and free of electric and magnetic fields.",
    "Detailed Solution": "Step 1) State the problem and outline your approach. It is asked to determine the net force acting on various objects under different conditions. The net force can be determined using Newton's second law: F = ma, where F is the force, m is the mass, and a is the acceleration. Also, when an object is at equilibrium (either at rest or moving with a constant velocity), the net force acting on the object is zero.\nStep 2) Analyze the case of the raindrop. When a raindrop falls at a constant speed, its acceleration is zero because there is no change in its velocity. According to Newton's second law, when the acceleration of an object is zero, the net force acting on that object is also zero. Therefore, the net force on the raindrop is zero.\nStep 3) Move on to the cork floating in water. The cork is at equilibrium because the weight of the cork is exactly balanced by the upward force (upthrust) from the water. Equilibrium implies that the net force is zero. Thus, the net force on the cork is zero.\nStep 4) Consider the car moving at a constant velocity. According to Newton's second law, an object moving at a constant velocity has zero acceleration and therefore experiences a net force of zero. Thus, despite the road being rough, the net force on the car is zero.\nStep 5) Analyze the situation of the high-speed electron in space. The electron is far from all material objects and free of electric and magnetic fields. These conditions eliminate all possible external forces on the electron. Therefore, the net force acting on this electron is also zero.",
    "Solution Outline": "Step 1) State Newton's second law (F = ma) and the principle of equilibrium, which states that the net force is zero when an object is either at rest or moving with constant velocity.\nStep 2) Apply the second law to the raindrop falling with constant speed, concluding that the net force is zero because its acceleration is zero.\nStep 3) Apply the principle of equilibrium to the cork, showing that the net force is zero because the weight of the cork is balanced by the upthrust.\nStep 4) Apply the second law to the car moving with constant velocity on a rough road, highlighting that the net force is zero because its acceleration is zero.\nStep 5) Discuss the high-speed electron in space, with no material objects, electric or magnetic fields. With these conditions, no external forces are present, and so, the net-force acting on the electron is zero."
}