{
    "Question": "Q10. A travelling harmonic wave is given as: y (x, t) = 2.0 cos 2π (10t – 0.0080x + 0.35).\r\nWhat is the  phase difference between the oscillatory motion of two points separated by a distance of:\r\n(i) 8 m\r\n(ii) 1 m\r\n(iii) λ /2\r\n(iv) 6λ/4\r\n[ X and y are in cm, and t is in secs ].",
    "Original Solution": "Given,\r\nThe equation for a travelling harmonic wave:\r\ny (x, t) = 2.0 cos 2π (10t – 0.0080x + 0.35)\r\n= 2.0 cos (20πt – 0.016πx + 0.70 π)\r\nWhere,\r\nPropagation constant, k = 0.0160 π\r\nAmplitude, a = 2 cm\r\nAngular frequency, ω= 20 π rad/s\r\nWe know,\r\nPhase difference Φ = kx = 2π/ λ\r\n(i) For x = 8 m = 800 cm\r\nΦ = 0.016 π × 800 = 12.8 π rad.\r\n(ii) For x =  1 m = 100 cm\r\nΦ = 0.016 π × 100 = 1.6 π rad.\r\n(iii) For x = λ /2\r\nΦ = (2π/ λ)  x  ( λ/2) =  π rad.\r\n(iv) For x = 6λ /4\r\nΦ = (2π/ λ)  x  ( 6λ/4) = 3 π rad.",
    "Detailed Solution": "Step 1) We're given the equation for a travelling harmonic wave as y (x, t) = 2.0 cos 2π (10t – 0.0080x + 0.35), which simplifies to = 2.0 cos (20πt – 0.016πx + 0.70 π). In this equation, x and y are in cm, and t is in secs. The propagation constant k is given as 0.0160 π and the angular frequency ω equals to 20 π rad/s, while the amplitude a is 2 cm. This is our starting point. Step 2) We know that the phase difference Φ is expressed as kx = 2π/ λ. This is the equation we'll use to find the phase difference between the oscillatory motion of different points. Step 3) For a distance of 8 m, which is 800 cm, we plug x = 800 cm into Φ = kx. Thus, Φ = 0.016 π × 800 = 12.8 π rad. This is the first answer. Step 4) For a distance of 1 m, or 100 cm, we use the same equation but with x = 100 cm. Therefore, Φ = 0.016 π × 100 = 1.6 π rad. This gives us the second answer. Step 5) For a distance of λ /2, we plug this value into Φ = (2π/ λ) × λ/2, so Φ = π rad. This is the answer for the third part. Step 6) For a distance of 6λ /4, we again use the formula and substitute the given value into Φ = (2π/ λ) × ( 6λ/4), arriving at Φ = 3 π rad. This gives us our fourth and final answer.",
    "Solution Outline": "Step 1) We start with the given equation for a travelling harmonic wave y (x, t) = 2.0 cos (20πt – 0.016πx + 0.70 π) and the given conditions. Step 2) From this, we use the equation for phase difference Φ = kx = 2π/ λ. Step 3) To find the phase difference for 8 m or 800 cm, we plug in 800 into the equation Φ = kx to get Φ = 12.8 π rad. Step 4) For 1 m or 100 cm, we use the same equation and plug in 100 to get Φ = 1.6 π rad. Step 5) Similarly, for a distance of λ /2, we use the given values to get Φ = π rad. Step 6) Finally, for 6λ /4, we input the given values into the equation to find that Φ = 3 π rad."
}