{
    "Question": "25. A rocket is fired ‘vertically’ from the surface of mars with a speed of 2 km s^–1. If 20% of its initial energy is lost due to martian atmospheric resistance, how far will the rocket go from the surface of mars before returning to it? The mass of mars = 6.4×10^23 kg; the radius of mars = 3395 km; G = 6.67×10^(-11) N m^2 kg^(–2).\r\n",
    "Original Solution": "Speed of the rocket fired from the surface of mars ( v) = 2 km/s\r\nThe mass of the rocket = m\r\nThe mass of Mars ( M) = 6.4 × 10^23 Kg\r\nThe radius of Mars (R) = 3395 km = 3.395 × 10^6 m\r\nThe initial Potential energy = – GMm/R\r\nThe initial kinetic energy of the rocket = 1/2 mv^2\r\nTotal initial energy = 1/2 mv^2 – GMm/R\r\nDue to atmospheric resistance, 20% of the kinetic energy is lost by the rocket.\r\nThe remaining Kinetic energy= 80% of 1/2mv^2\r\n= 2/5 mv^2= 0.4 mv^2 ——–(1)\r\nWhen the rocket reaches the highest point, at the height h above the surface, the kinetic energy will be zero, and the potential energy is equal to – GMm/(R+h)\r\nApplying the Law of conservation of energy,\r\n– GMm/(R+h) =  – GMm/R + (0.4) mv^2\r\nGM/(R+h) =  1/R [ GM – 0.4Rv^2]\r\n(R+h/R) = GM/[ GM – 0.4Rv^2]\r\n\r\nh/R = {GM/[ GM – 0.4Rv^2]} – 1\r\nh/R = (0.4Rv^2/GM – 0.4Rv^2)\r\nh = (0.4R2v^2/GM – 0.4Rv^2)\r\nh = 495 km",
    "Detailed Solution": "Step 1) We are given the initial speed of the rocket (v) as 2 km/s which must be converted to m/s. This means v = 2000 m/s as there are 1000 meters in a kilometer. Step 2) We are also told the mass of Mars (M) is 6.4 × 10^23 kg. The radius of Mars (R) is given to be 3395 km which needs to be converted to meters (3.395 × 10^6 m). Step 3) We know the initial potential energy of the rocket equals –GMm/R where G is the gravitational constant 6.67×10^(-11) N m^2 kg^(–2). Step 4) The initial kinetic energy of the rocket equals 1/2 mv^2. Step 5) The total initial energy of the rocket is given by the equation 1/2 mv^2 - GMm/R. Step 6) We're told that due to atmospheric resistance, the rocket loses 20% of its kinetic energy. The remaining energy is therefore 0.8 of the initial kinetic energy or 0.4 mv^2. Step 7) This leaves us with total energy of -GMm/R + 0.4mv^2. Step 8) When the rocket reaches its highest point, its kinetic energy is zero and its potential energy will be –GMm/(R+h) where h is the height above the Martian surface. Step 9) By the conservation of energy, -GMm/(R+h) equals to –GMm/R + 0.4 mv^2. Simplifying gives us GM/(R+h) = GM/R - 0.4Rv^2. Step 10) Further simplification gives (R+h/R) = GM/[GM - 0.4Rv^2]. Step 11) Solving for h/R results in {GM/[GM - 0.4Rv^2]} - 1. Step 12) Plugging in the known values into h = (0.4R^2v^2/GM)–(0.4Rv^2) gives h = 495 km. Thus, the rocket will ascend to a height of 495 km above the Martian surface before descending.",
    "Solution Outline": "Step 1) Convert given lengths and speeds to consistent units (m, m/s). Step 2) Identify known quantities, i.e., the speed of the rocket, the mass and radius of Mars and the initial kinetic and potential energy of the rocket. Step 3) Subtract the energy loss due to Martian atmosphere from the initial total energy of the rocket. Step 4) Consider changing energy states: when the rocket is at its highest point, all energy has been converted to potential energy. The kinetic energy is zero at this point. Step 5) Apply the law of conservation of energy. The total energy of the system (potential and kinetic energy of the rocket) remains constant because no new energy is being put into or taken out from the system. Step 6) Equate the initial total energy to the potential energy at the highest point of ascension. Step 7) Solve the equation for h, constant quantities being the gravitational constant, mass and radius of Mars and the velocity of the rocket. Step 8) Calculate h, which gives the height above the Martian surface where the rocket will be before descending."
}