{
    "Question": "12. From a certain apparatus, the diffusion rate of hydrogen has an average value of 28.7 cm^3 s^-1. The diffusion of another gas under the same conditions is measured to have an average rate of 7.2 cm^3 s^-1. Identify the gas.",
    "Original Solution": "Given\r\nRate of diffusion of hydrogen, R1 = 28.7 cm^3 s^-1\r\nRate of diffusion of another gas, R2 = 7.2 cm^3 s^-1\r\nAccording to Graham’s Law of diffusion,\r\nWe have\r\nR1 / R2 = (M2 / M1)^0.5\r\nWhere,\r\nM1 is the molecular mass of hydrogen = 2.020g\r\nM2 is the molecular mass of the unknown gas\r\nHence,\r\nM2 = M1 (R1 / R2)^2\r\n= 2.02 (28.7 / 7.2)^2\r\nWe get,\r\n= 32.09 g\r\n32 g is the molecular mass of oxygen.\r\nTherefore, the unknown gas is oxygen.",
    "Detailed Solution": "Step 1) We are given two pieces of information: the rate of diffusion of hydrogen (R1) is 28.7 cm^3 s^-1, and the rate of diffusion of another unknown gas (R2) is 7.2 cm^3 s^-1. Step 2) We are asked to identify this unknown gas. To do this, we can make use of the Graham's Law of diffusion. This law suggests an inverse relationship between the rate of diffusion of a gas and the square root of its molar mass. The formula is typically expressed as R1 / R2 = (M2 / M1)^0.5, where M1 and M2 are the molar mass of the first and second gas, respectively. Step 3) To find the molar mass of the unknown gas (M2), we rearrange our formula to isolate M2: M2 = M1 (R1 / R2)^2. Step 4) Hydrogen's molar mass (M1) is known and is equal to 2.020g. We substitute the known values of M1, R1, and R2 into our equation: M2 = 2.02 (28.7 / 7.2)^2. Step 5) We perform the calculation to find M2 = 32.09g. Step 6) We round this to the closest integer value to get 32g. Step 7) Recognizing molar masses from the periodic table, we find that a molecular gas with a molar mass of 32g is Oxygen. Therefore, the unknown gas is oxygen.",
    "Solution Outline": "Step 1) Take note of the given rates of diffusion for hydrogen (R1) and the unknown gas (R2). Step 2) Employ Graham's Law of diffusion which relates the rates of diffusion of two gases and their molar masses. The equation is  R1 / R2 = (M2 / M1)^0.5. Step 3) Rearrange the equation to isolate M2: M2 = M1 (R1 / R2)^2. Step 4) Use the known molar mass of hydrogen (M1) and the given rates of diffusion to calculate M2. Step 5) Calculate M2 to find it to be around 32g. Step 6) From the Periodic Table, a molecular mass of 32g corresponds to Oxygen. Therefore, the unknown gas must be Oxygen."
}