{
    "Question": "Q15. Determine the volume contraction of a solid copper cube, 10 cm on edge, when subjected to a hydraulic pressure of 7.0 × 10^6 Pa.",
    "Original Solution": "Side of the copper cube, a = 10 cm\r\nTherefore, the volume of the copper cube, V = a3 = 10^-3 m^3\r\nHydraulic pressure, p = 7.0 x 10^6 Pa\r\nBulk modulus of copper B = 140 G Pa = 140 x 10^9 Pa.\r\nBulk modulus, K=−P/(ΔV/V) ​\r\nWe get the value of volume contraction as ΔV = – PV/K\r\n=−(7×10^6 ×0.001)/(140×10^9)\r\n=−0.05×10^(−6) m^3",
    "Detailed Solution": "Step 1) The problem provides that the side of the solid copper cube is 'a', which equals to 10 cm. Being a cube, all its sides are equal. Step 2) In order to find the volume of the cube, we use the formula for the volume of a cube, which is V = a^3. Given that 'a' is in centimeters, we have to convert it to meters by dividing its value by 100 (10/100 = 0.1 m) because in the SI unit system, we denote length in meters. Step 3) After conversion, the volume of the cube is calculated to be (0.1 m)^3 = 0.001 m^3. Step 4) We are also given that the hydraulic pressure 'P' applied to the cube is 7.0 x 10^6 Pa, and the bulk modulus 'K' of the copper that the cube is made of is 140 x 10^9 Pa. The bulk modulus is a measure of a substance's resistance to uniform compression - the greater the modulus, the more resistance. Step 5) By definition, the bulk modulus of a substance is given by the formula K = -P/ (ΔV/V) where ΔV is the change in the cube's volume as a result of the pressure 'P', and 'V' is the original volume. This equation could be rewritten to find the volume contraction ΔV as ΔV = - PV/K. Step 6) Substituting the given values into this equation, we have ΔV = - (7 x 10^6 x 0.001) / (140 x 10^9). After computation, it is determined that ΔV = -0.05 x 10^-6 m^3, which represents the volume contraction in meters cube.",
    "Solution Outline": "Step 1) Identify the given side 'a' of the copper cube as 10 cm. Step 2) Here is a critical step: convert the side length from cm to m, the standard SI unit for length, for accurate comparisons or calculations. Step 3) Calculate the cube's volume ('V') using the formula 'V = a^3'. Step 4) Acknowledge the given hydraulic pressure 'P' and the bulk modulus 'K' of copper. Step 5) Explain the definition of bulk modulus, written as 'K = -P/ (ΔV/V)', where ΔV is the volume contraction. Reinstate this formula as ΔV = - PV/K to determine the volume contraction caused by pressure. Step 6) Substitute the known values into the ΔV equation and perform the calculation, delivering the result of the volume contraction."
}