{
    "Question": "Q1. In which of the following examples of motion can the body be consideredapproximately a point object?(a) A railway carriage moving without jerks between two stations.(b) A cap on top of a man cycling smoothly on a circular track.(c) A spinning cricket ball that turns sharply on hitting the ground.(d) A tumbling beaker that has slipped off the edge of a table. \r\n",
    "Original Solution": "(a), (b) The size of the railway carriage and the cap is very small as compared to the distance they’ve travelled, i.e. the distance between the two stations and the length of the race track, respectively. Therefore, the cap and the carriage can be considered as point objects.\r\nThe size of the cricket ball is comparable to the distance through which it bounces off after hitting the floor. Thus, the cricket ball cannot be treated as a point object. Likewise, the size of the beaker is comparable to the height of the table from which it drops.  Thus, the beaker cannot be treated as a point object.\r\n",
    "Detailed Solution": "Step 1) In this problem, we need to determine which of the presented scenarios can have the object considered approximately a point object. The key concept here is that any physical object can be treated as a point object if the distance it travels is significantly greater as compared to its size. Step 2) Let's consider each option one by one. Firstly, consider the railway carriage moving from one station to the other. The size of the carriage is tiny compared to the overall distance traveled between the stations. So, according to our key concept, the railway carriage can be considered a point object. Step 3) Next, let's look at a cap on top of a man cycling smoothly on a circular track. Much like the railway carriage in the previous example, the size of the cap is much smaller when compared to the length of the entire circular track. Therefore, the cap also satisfies our key concept and can be viewed as a point object. Step 4) Next, consider the spinning cricket ball that bounces off sharply after hitting the ground. The size of the ball would be a significant factor since the distance it covers post-bounce is comparable to its size. Therefore, based on our key concept, the cricket ball cannot be treated as a point object. Step 5) Lastly, consider the tumbling beaker that slips off the edge of a table. Similar to the cricket ball, the size of the beaker is comparable to the distance, it falls from the table. Hence, the beaker cannot be regarded as a point object based on our key concept. In conclusion, we can treat the objects in scenario (a) & (b) as point objects; they are significantly smaller compared to the distance they travel.",
    "Solution Outline": "Step 1) Understand the key concept that an object can be considered as a point object if the distance it travels is significantly greater than its size. Step 2) Apply this concept to the railway carriage moving between stations - it can be viewed as a point object as its size is small compared to the distance travelled. Step 3) Similarly, the cap on a man cycling on a track can also be considered a point object as its size is tiny compared to the track's length. Step 4) On the other hand, the spinning cricket ball and the tumbling beaker cannot be considered point objects. This is because their sizes are not negligible with respect to the distance they cover after bouncing or falling respectively so they defy the key concept."
}