{
    "Question": "Q20: The position of a particle is given by \r\n\\(\\begin{array}{l}r = 3.0t \\;\\hat{i} – 2.0t^{2} \\;\\hat{j} + 4.0 \\hat{k} \\; \\;m\\end{array} \\)\r\nWhere t is in seconds, and the coefficients have the proper units for r to be in meters.\r\n(a) Find the ‘v’ and ‘a’ of the particle?\r\n(b) What is the magnitude and direction of the velocity of the particle at t = 2.0 s?",
    "Original Solution": "(a) The position of the particle is given by:\r\nVelocity \\(\\begin{array}{l}\\vec{v}\\end{array} \\), of the particle is given as:\r\nAcceleration \\(\\begin{array}{l}\\vec{a}\\end{array} \\), of the particle is given as:\r\n8.54 m/s, \\(\\begin{array}{l}69.45^{\\circ}\\end{array} \\) below the x-axis\r\n(b) We have velocity vector, \\(\\begin{array}{l}\\vec{v} = 3.0\\; \\hat{i} – 4.0t \\; \\hat{j}\\end{array} \\)\r\nAt t = 2.0 s:\r\nThe magnitude of velocity is given by\r\nDirection, \\(\\begin{array}{l}\\theta = \\tan ^{-1} \\left ( \\frac{v_{y}}{v_{x}} \\right )\\\\ \\\\ = \\tan ^{-1} \\left ( \\frac{-8}{3} \\right ) = – \\tan ^{-1} \\left ( 2.667 \\right )\\\\ \\\\ = 69.45^{\\circ}\\end{array} \\)\r\nThe negative sign indicates that the direction of velocity is below the x-axis.",
    "Detailed Solution": "Step 1) First, observe the given position vector: r = 3.0t ī – 2.0t² ĵ + 4.0 k̂. You can notice it's in terms of the coordinates i, j, and k, which are the vector components in the x, y, and z-axis, respectively. The 't' refers to time, which is given in seconds. Step 2) Recognize that velocity is the derivative of the position with respect to time, and acceleration is the derivative of velocity with respect to time. Therefore, the velocity is given by v = dr/dt, and the acceleration is a = dv/dt. Step 3) Now, calculate the derivative of the position vector to find the velocity. This yields the vector v = 3.0 ī – 4.0t ĵ, as each component of the vector is differentiated separately. Step 4) Find the acceleration by taking the derivative of the velocity vector. This yields a vector that is just 0 ī - 4.0 ĵ as there's no 't' variable in the x component of velocity and the coefficient of 't' in the y component becomes the constant when differentiated. Step 5) To find the magnitude of the velocity, take the square root of the sum of the squares of its components. At t = 2.0s, you'll have square root of (3.0)² + (- 4.0*2)² = 8.54 m/s. Step 6) The direction of the velocity is given by the angle θ = inverse tan(vy/vx). Here, vy is -8 and vx is 3.0, so the angle: inverse tan (-8/3) = -699.45 degrees. The negative sign implies that the direction is below the x-axis.",
    "Solution Outline": "Step 1) Analyze the given position vector in terms of x, y, and z coordinates - r = 3.0t ī – 2.0t² ĵ + 4.0 k̂. Step 2) Remember that velocity and acceleration are the first and second derivatives of position with respect to time, respectively. Step 3) Compute the first derivative of the position to find the velocity vector, yielding v = 3.0 ī – 4.0t ĵ. Make sure to differentiate each component separately. Step 4) Determine the acceleration by differentiating the velocity vector, which results in a = 0 ī - 4.0 ĵ. Step 5) Calculate the magnitude of the velocity vector at a specific time, t=2.0s, using the formula for the magnitude of a vector. Step 6) Find direction of the velocity by calculating the inverse tangent of the ratio of the y-component to the x-component of the velocity, which yields an angle below the x-axis due to the negative sign."
}