{
    "Question": "Q11. Torques of equal magnitude are applied to a hollow cylinder and a solid sphere, both having the same mass and radius. The cylinder is free to rotate about its standard axis of symmetry, and the sphere is free to rotate about an axis passing through its centre. Which of the two will acquire a greater angular speed after a given time?",
    "Original Solution": "Let m be the mass and r be the radius of the solid sphere and also the hollow cylinder.\r\nThe moment of inertia of the hollow cylinder about its standard axis, I1 = MR2\r\nMoment of inertia of the solid sphere about an axis passing through its centre\r\nI2 = (2MR^2 ) / 5\r\nLet T be the magnitude of the torque being exerted on the two structures, producing angular accelerations of   α2 and α1  in the sphere and the cylinder, respectively.\r\nThus, we have T =  I1α1= I2α2 \r\n∴ α2 / α1  =  I1  /  I2  =  \\(\\begin{array}{l}\\frac{MR^{2}}{\\frac{2}{5}MR^{2}}\\end{array} \\) = 5/2\r\nα2 > α1          . . . . . .( 1 )\r\nNow, using the relation\r\nω = ω0 + αt\r\nWhere,\r\nω0 = Initial angular velocity\r\nt = Time of rotation\r\nω = Final angular velocity\r\nFor equal ω0 and t, we have\r\nω ∝ α             . . . . . . .  . ( 2 )\r\nFrom equations ( 1 ) and ( 2 ), we can write\r\nω2 > ω1\r\nThus, from the above relation, it is clear that the angular velocity of the solid sphere will be greater than that of the hollow cylinder.",
    "Detailed Solution": "Step 1) First, let's define our known quantities. The mass, labelled as 'm', and the radius, labelled as 'r', of both the solid sphere and the hollow cylinder are the same. Also, let's set T as the magnitude of the torque being exerted on the two objects.\n Step 2) For rotational motion, the property that is quite similar to mass in linear motion is the moment of inertia. For the hollow cylinder, about its standard axis, the moment of inertia which we will call I1 is calculated by the formula 'MR^2', where M is the mass and R is the radius of the cylinder.\n Step 3) Similarly, we calculate the moment of inertia of the solid sphere about an axis passing through its centre, which we designate as I2 using the formula '(2MR^2 ) / 5'.\n Step 4) The torque applied to these structures causes an angular acceleration. Assume that α2 and α1 are the angular accelerations in the sphere and the cylinder, respectively. As the torques are equal, we can set up the equation 'T =  I1α1= I2α2'.\n Step 5) From this, we can derive a relation between the angular accelerations of the sphere and the cylinder: α2 / α1  =  I1  /  I2  = MR^2 / (2/5MR^2) = 5/2. This implies that the angular acceleration of the sphere (α2) is greater than that of the cylinder (α1).\n Step 6) Now, let's use the relation ω = ω0 + αt, where ω0 is the initial angular velocity, t is the time of rotation, and ω is the final angular velocity. For equal initial angular velocities and the same time, the final angular velocity directly correlates with the angular acceleration, yielding ω ∝ α.\n Step 7) Given our previous results, we thus determine that ω2 > ω1, indicating that the angular velocity of the solid sphere will be greater than that of the hollow cylinder.",
    "Solution Outline": "Step 1) Assign variables to known quantities: mass (m), radius (r), and torque (T).\n Step 2) Calculate the moment of inertia for the hollow cylinder using the formula 'MR^2', designating it as I1.\n Step 3) Calculate the moment of inertia for the solid sphere using the formula '(2MR^2 ) / 5', designating it as I2.\n Step 4) Connect torque and moment of inertia via the concept of angular acceleration (α), forming the equation T =  I1α1= I2α2.\n Step 5) Calculate the relationship between the sphere and the cylinder's angular accelerations, revealing α2 / α1  =  I1  /  I2  = 5/2.\n Step 6) Apply the concept of angular velocity with the equation ω = ω0 + αt, deducing that ω directly correlates with α when initial angular velocities and time are the same.\n Step 7) With the derived relationships, conclude that ω2 (sphere's angular velocity) is greater than ω1 (cylinder's angular velocity)."
}