{
    "Question": "Q25. A SONAR system fixed in a submarine operates at a frequency of 40.0 kHz. An enemy submarine moves towards the SONAR with a speed of 360 km h^–1. What is the frequency of sound reflected by the submarine? Take the speed of sound in water to be 1450 m s^–1.",
    "Original Solution": "Frequency of the SONAR system, f=40 kHz = 40 x 10^3 Hz\r\nSpeed of sound in water, v =1450m/s\r\nSpeed of the enemy submarine, v0=360km/h= 360 x (5/18) = 100m/s\r\nThe SONAR is at rest, and the energy submarine moves towards it. Therefore, the apparent frequency is given by the relation\r\nf’ = [(v+v0)/v]f\r\n=  [(1450 + 100)/1450] x 40 x 10^3\r\n= 42.75 x 10^3\r\nThis frequency (f’) is reflected by the enemy submarine, and it is observed by the SONAR. Therefore, vs = 360 km/s  = 100m/s\r\nf” = (v/(v – vs)) x f’\r\n= (1450/(1450 – 100)) x 42.75 x 10^3\r\n= (1450/1350) x 42.75 x 10^3\r\n= 45.91 x 10^3.",
    "Detailed Solution": "Step 1) Firstly, let's identify the values that are given to us in the problem - The frequency of the SONAR system is given as 40 kHz, which when converted into Hz equals 40 x 10^3 Hz. The speed of sound in water is given as 1450 m/s. And the enemy submarine is moving towards the SONAR at a speed of 360 km/h. However, to use this speed in our calculations, it must be converted into the m/s unit, which gives us 360 km/h times (5/18) equals 100 m/s. Step 2) Once we have all our known values in the right units, we move on to calculating the apparent frequency that would be observed by the submarine. For this, we use the Doppler effect formula for frequency, which is f’ = [(v+v0)/v]f, where v is the speed of sound, v0 is the speed of the observer/submarine, and f is the original frequency. Plugging in our known values gives us f’= [(1450 + 100)/1450] x 40 x 10^3 Hz = 42.75 x 10^3 Hz. Step 3) Next, we calculate the frequency that would be observed by the SONAR system. For this, we use the Doppler effect formula for reflected frequency, which is f” = (v/(v – vs)) x f’, where vs is the speed of the source/SONAR. Plugging in our known values gives us f” = (1450/(1450 – 100)) x 42.75 x 10^3 Hz = 45.91 x 10^3 Hz. Therefore, the observed frequency of sound reflected by the submarine is 45.91 kHz.",
    "Solution Outline": "Step 1) The known values are extracted from the problem and converted into the same units, resulting in: frequency of the SONAR system, f=40 kHz = 40 x 10^3 Hz; speed of sound in water, v =1450m/s; and speed of the enemy submarine, v0=360km/h= 360 x (5/18) = 100m/s. Step 2) Using the Doppler effect formula for frequency, the apparent frequency f’, observed by the submarine is calculated as f’ = [(v+v0)/v]f. Step 3) Finally, the reflected frequency f”, as observed by the SONAR system is calculated using formula for Doppler effect on reflected frequency, f” = (v/(v – vs)) x f’, where vs is the speed of the source/SONAR."
}