{
    "Question": "Q20.A train, standing at the outer signal of a railway station, blows a whistle of frequency 400 Hz in still air. (i) What is the frequency of the whistle for a platform observer when the train (a) approaches the platform with a speed of 10 m s^–1, (b) recedes from the platform with a speed of 10 m s^–1? (ii) What is the speed of sound in each case? The speed of sound in still air can be taken as 340 m s^–1.",
    "Original Solution": "Frequency of the whistle = 400 Hz\r\nSpeed of sound in still air = 340 m/s\r\n(i)\r\n(a) Train approaches the platform at speed, vs = 10 m/s\r\nFrequency of the whistle for a platform observer\r\n(b) Train recedes from the platform at speed, vs = 10 m/s\r\nFrequency of the whistle for a platform observer\r\n(ii) The speed of the sound will not change. It will remain at 340 m/s.",
    "Detailed Solution": "Step 1) First, let's list all the given quantities: the train stands at a station and blows a whistle of frequency 400 Hz in still air. The speed of sound in still air is also given as 340 m/s. Step 2) We're given two scenarios regarding the train's motion relative to the observer on the platform: one in which the train approaches the platform at 10 m/s, and another in which the train recedes from the platform at the same speed. Step 3) The observed frequency of sound depends on the relative motion of the source and the observer, which is described by the Doppler effect. The Doppler effect formula for frequency is f' = f(v+vo)/(v-vs) where f' is the observed frequency, f is the source frequency, v is the speed of sound, vo is the speed of the observer, and vs is the speed of the source. Step 4) For the first scenario, since the observer (platform) is stationary, vo = 0 and vs = -10 m/s (we take it as negative because the direction of source is towards the observer). Substituting these values into the formula, we get the observed frequency when the train is approaching. Step 5) Similarly for the second scenario, vo = 0 but now vs = 10 m/s (positive because the train is receding from the observer). Again, substituting these values into the formula, we can find the observed frequency when the train is receding. Step 6) Regarding the speed of sound, we must understand that the speed of sound in the air does not change regardless of the motion of the source (train in this case). Hence, the speed of sound remains constant at 340 m/s in both the scenarios.",
    "Solution Outline": "Step 1) Write down the known quantities that we have been given: the frequency of the whistle and the speed of sound in still air. Step 2) Observe that the question asks for the frequency of the whistle in two different conditions: when the train is approaching and receding from the platform. Step 3) Understand that the change in observed sound frequency is due to the Doppler effect. Introduce the formula for Doppler effect in frequency: f' = f(v+vo)/(v-vs). Step 4) For the first condition where the train is approaching the platform, insert the values into the formula with vo = 0 (stationary observer) and vs = -10 m/s (as the source is moving towards the observer). Compute the observed frequency. Step 5) For the second condition where the train is receding from the platform, use the same formula but now vs = 10 m/s (as the source is moving away from the observer). Calculate the observed frequency. Step 6) Note that the speed of sound remains constant in both scenarios, irrespective of the motion of the source. This is a property of sound and the medium through which it travels (air in this case), resulting in the same speed of sound as given, 340 m/s."
}