{
    "Question": "Q2. A stone dropped from the top of a tower of height 300 m splashes into the water of a pond near the base of the tower. When is the splash heard at the top, given that the speed of sound in air is 340 m s^–1? (g = 9.8 m s^–2)",
    "Original Solution": "Given,\r\nHeight of the bridge, s = 300 m\r\nThe initial velocity of the stone, u = 0\r\nAcceleration, a = g = 9.8 m/s^2\r\nSpeed of sound in air = 340 m/s\r\nLet t be the time taken by the stone to hit the water’s surface\r\nWe know,\r\ns = ut + 0.5 gt2\r\n300 = 0 + 0.5 x 9.8 x t^2\r\nTherefore, t = 7.82 s\r\nThe time taken by the sound to reach the bridge, t’= 300/340 = 0.88 s\r\nTherefore, from the moment the stone is released from the bridge, the sound of it splashing the water is heard after = t +t’ = 7.82 s + 0.88 s = 8.7s.",
    "Detailed Solution": "Step 1) Start by identifying the given parameters. In this case, the height of the tower is 300 m, the stone's initial velocity is 0 m/s because it was dropped, the acceleration due to gravity is 9.8 m/s², and the speed of sound in air is 340 m/s. These are pieces of information provided in the problem and will be used to find the solution. Step 2) Let's consider 't' to be the time taken by the stone to hit the water’s surface. This part is crucial because we're dealing with two different time frames: the fall of the stone and the travel of the sound wave. Step 3) You can use the equations of motion to figure out the time it takes for the stone to fall. In this case, the equation 's = ut + 0.5gt²' is relevant. The 's' represents distance (the height of the tower), 'u' is the initial velocity, 't' is time, 'g' is gravity and the 0.5 is a constant that comes from integrating acceleration to get the distance covered. Step 4) Insert the values into the equation to get '300 = 0 + 0.5 x 9.8 x t²'. As given, the initial velocity is zero, so the ut term is zero. Solve for 't' to find that 't = 7.82 s'. This tells us how long the stone was falling. Step 5) Next, calculate the time it takes for the sound of the splash to reach the top of the tower. Use the formula for speed, which is 'Speed = Distance / Time', rearranged here as 'Time = Distance / Speed'. This gives us 't’= 300/340 = 0.88 s'. This is important because the speed of sound determines how long it takes for the splash sound to reach the top. Step 6) In the final step, add the time it takes for the stone to fall and the time for the sound to travel to get 't + t’ = 7.82 s + 0.88 s = 8.7 seconds'. This is the total time from the moment the stone is released from the tower until the sound of the splash reaches the top.",
    "Solution Outline": "Step 1) Identify the given parameters: height=300m, initial velocity (of the stone)=0m/s, acceleration (due to gravity)=9.8m/s², and speed of sound=340 m/s. Step 2) Define 't' as the time the stone takes to hit the water. Step 3) To find this 't', use the equation of motion 's = ut + 0.5gt²'. Step 4) By substituting the given parameters into the equation, you solve for the fall time 't = 7.82 s'. Step 5) Calculate the time it takes for the sound to reach the top of the tower using 'Time = Distance / Speed' to get 't’= 0.88 s'. Step 6) The total time from when the stone is released until the splash sound is heard is the sum of the stone's fall time and the sound's travel time: 't + t’ = 8.7 seconds'."
}