{
    "Question": "16. Two masses 8 kg and 12 kg are connected at the two ends of a light inextensible string that goes over a frictionless pulley. Find the acceleration of the masses and the tension in the string when the masses are released.",
    "Original Solution": "Given,\r\nSmaller mass, m1 = 8 kg\r\nLarger mass, m2 = 12 kg\r\nTension in the string = T\r\nThe heavier mass m2 will move downwards and the smaller mass m1 will move upwards.\r\nApplying Newton’s second law,\r\nFor mass m1:\r\nT – m1g = m1a —– (1)\r\nFor mass m2:\r\nm2g – T = m2a ——(2)\r\nAdd (1) and (2)\r\n(m2 – m1) g = (m1 + m2) a\r\na = (m2 – m1) g/ (m1 + m2)\r\n=[ (12 – 8)/(12 + 8)] x 10 = (4 /20) x 10= 2m/s\r\nTherefore, acceleration of the mass is 2 m/s^2\r\nSubstituting this value of acceleration in equation (ii) we get\r\nm2g – T = m2a\r\nm2g – T = m2 [ (m2 – m1) g/ (m1 + m2) ]\r\n\r\n= 2m1m2g/(m1 + m2)\r\nT = 2 x 12 x 8 x 10/ (12 + 8)\r\nT = 96 N\r\nTherefore, the tension on the string is 96 N",
    "Detailed Solution": "Step 1) First, let's establish what we know. We have two connected masses, with the smaller mass, m1, being equal to 8 kg, and the larger mass, m2, amounting to 12 kg. The tension in the string connecting these masses is T. When the masses are released, the larger mass m2 will move downwards and the smaller mass m1 will move upwards due to the differential in mass.\n \nStep 2) Newton’s second law applies here, which is Force equals mass times acceleration (F=ma). Therefore, we form two equations involving the masses m1 and m2. For m1, the force exerted by tension T upwards is counteracted by the force of mass m1 moving downward due to gravity (m1*g), resulting in the equation T – m1g = m1a, or equation (1).\n \nStep 3) Similarly, for m2, the downward force due to gravity (m2*g) is counteracted by the tension T upward, resulting in the equation m2g – T = m2a, or equation (2).\n \nStep 4) Next, add equation (1) and equation (2). From this, we can develop a formula for acceleration a: (m2 – m1) g = (m1 + m2) a, which simplifies to a = (m2 – m1) g / (m1 + m2).\n \nStep 5) Now, substitute the values of m1, m2, and g (acceleration due to gravity, which we'll take as approximately 10 m/s^2) into the equation to compute the acceleration a. So a = [ (12 – 8)/(12 + 8)] x 10 = 2 m/s^2.\n \nStep 6) Therefore, the acceleration of the masses is 2 m/s^2. Now calculate the Tension T. We already have the formula from Equation (2), m2g – T = m2a. Substituting m2, g and calculated a, we have m2g – T = 2m1m2g/(m1 + m2).\n \nStep 7) Rearranging that equation results in T = 2 x 12 x 8 x 10/ (12 + 8), which equals to 96 Newtons (N). Therefore, the tension on the string is 96 N.",
    "Solution Outline": "Step 1) Identify known values: m1 = 8kg, m2 = 12kg, and assume T for tension.\n \nStep 2) Recognize that as the masses move, m1 lifts while m2 descends due to the gravitational pull.\n \nStep 3) Apply Newton’s second Law (F=ma) for m1 and m2 to form two equations.\n \nStep 4) Add these two equations to find an expression for acceleration a.\n \nStep 5) Input known values to calculate the acceleration as 2 m/s^2.\n \nStep 6) Substitute this acceleration into one of the Newton's law equations, which has been rearranged for T, to find the tension.\n \nStep 7) After substituting the needed values and solving, find that the tension is calculated to be 96 N."
}