{
    "Question": "10. A body of mass 0.40 kg moving initially with a constant speed of 10 ms-1 to the north is subject to a constant force of 8.0 N directed towards the south for 30 s. Take the instant the force is applied to be t = 0, the position of the body at that time to be x = 0, and predict its position at t = -5 s, 25 s, 100 s.",
    "Original Solution": "Given,\r\nMass of the body = 0.40 kg\r\nInitial velocity, u = 10 m/s\r\nForce, f = -8 N (retarding force)\r\nUsing the equation S = ut + (0.5) at^2\r\n(a) Position at the time t = – 5 s\r\nThe force starts acting on the body from t = 0 s\r\nSo the acceleration of the body when the time is – 5 s is 0\r\nS1= (10)(-5) + (0.5) (0) (-5)^2 = – 50 m\r\n(b) Position at the time t = 25 s\r\nThe acceleration of the body due to the force acting in the opposite direction\r\nAcceleration, a = F/a = -8 /0.4 = -20 ms^(-2)\r\nS2= (10)(25) + (0.5) (-20) (25)^2 = – 6000 m\r\n(c) Position at the time t = 100 s\r\nFor the first 30 sec, the body will move under the retardation of the force, and after that, the speed will remain constant.\r\nTherefore, distance covered in 30 sec\r\nS3= (10)(30) + (0.5)(-20)(30^2)\r\n= 300 – 9000 = – 8700m\r\nThe speed after 30 sec is\r\nv = u + at\r\nv = 10 – (20 x 30) = 590 m/s\r\nThe distance covered in the next 70 sec is\r\nS4 = – 590 x 70 + (0.5) (0) (70)^2 = – 41300 m\r\nTherefore the position after 100 sec = S3 + S4 = – 8700 – 41300 = – 50000m",
    "Detailed Solution": "Step 1) Let's identify the known values. We are given the mass of the body as 0.40 kg, its initial velocity (North) as 10 m/s, and a force of 8.0 N acting against this direction (South) for 30 s. We're measuring position from the point the force is applied (t = 0, x = 0), and we're asked to predict the body's position at t = -5 s, 25 s, and 100 s. Step 2) Let's utilize the equation of motion, S = ut + 0.5at^2, where S is position, u is initial velocity, a is acceleration, and t is time. Step 3) For t = - 5 s, before the force is applied, the acceleration is 0. So our equation becomes S= 10*(-5) + 0.5*0*(-5)^2, giving us a position of -50m. Step 4) At t = 25 s, the force is acting. We calculate acceleration a = F/m = -8 / 0.4 = -20 m/s^(-2), taking the negative sign since the force is opposite to the initial direction. Thus, S becomes 10*25 + 0.5*(-20)*(25)^2, meaning the position at 25s is –6000 m. Step 5) Then, at t = 100 s, the force acts only for the first 30 s, slowing down the body. We calculate the distance covered in these 30s by the above equation, getting S = 10*30 + 0.5*-20*30^2, or S = –8700 m. After 30s, the body moves at a constant speed, which we find using v = u + at => 10 - 20*30 = -590 m/s. The distance in the next 70s is -590*70 + 0.5*0*70^2, or –41300 m. The final position at 100s is –8700m + -41300m = -50000m.",
    "Solution Outline": "Step 1) Identify the given values: mass (0.40 kg), initial velocity (10 m/s north), force (8.0 N south), and duration of force (30 s). Step 2) Apply the equation of motion, S = ut + 0.5at^2, where S is position, u is initial velocity, a is acceleration, and t is time. Step 3) For t = -5 s, before the force is applied, the acceleration is 0. Using the equation of motion, find the position. Step 4) At t = 25 s, the force is acting, hence the acceleration is not zero. Calculate acceleration and use it in the equation of motion to find the position. Step 5) For t = 100 s, the force acts for the first 30 s. Calculate the movement during these 30s and the movement in the remaining 70 sec when the force no longer acts and hence the body moves at constant speed."
}