{
    "Question": "5. A constant retarding force of 50 N is applied to a body of mass 20 kg moving initially with a speed of 15 m s-1. How long does the body take to stop? ",
    "Original Solution": "Here,\r\nForce = – 50 N (since it is a retarding force)\r\nMass m = 20 kg\r\nv = 0\r\nu = 15 m s^(-1)\r\nForce F = ma\r\na = F/m = -50/20 = – 2.5 ms^(-2)\r\nUsing the equation, v = u + at\r\n0 = 15 + (- 2.5) t\r\nt = 6 s",
    "Detailed Solution": "Step 1) In this problem, we're dealing with forces and motion. The key physical principle at play here is Newton's second law, which tells us that force is equal to mass times acceleration (F = ma). We'll be using these basic equations of motion to calculate how long it takes for the body to stop under the influence of a retarding force. Step 2) The first information given in the problem is the force, which is a retarding force of 50 N. In physics, retarding means acting against, hence this force is negative. So, we'll take our force F to be -50 N. Step 3) The second thing we have is the mass of the body, which is given as 20 kg. We'll denote this as 'm'. Step 4) We also know that the body eventually stops, which means that its final velocity 'v' becomes 0 m/s. Its initial velocity 'u' was 15 m/s. Step 5) Using Newton's Second Law (F=ma), we can determine the body's acceleration by rearranging this formula to get a = F/m. Plugging in the numbers gives us a = -50/20 = – 2.5 ms^(-2). Here it is negative because it's a retarding force. Step 6) Now we use the equation of motion, v = u + at. We can rearrange this formula to solve for 't', the time, which gives us the equation t = (v-u)/a. Step 7) Finally we substitute the known values into this equation. This gives us t = (0-15)/(-2.5) which simplifies to t = 6 seconds. This is the time it takes for the body to stop under the given conditions.",
    "Solution Outline": "Step 1) Start with the known values: the retarding force F (-50 N), the mass of the body 'm' (20 kg), and initial velocity 'u' (15 m/s). Step 2) Acknowledge that the final velocity 'v' is 0, as the body ends up stopping. Step 3) Apply Newton's Second Law of Motion (F=ma) to find the acceleration 'a' by substituting the known variables, resulting in a negative acceleration due to the retarding force. Step 4) Use the equation of motion (v = u + at) and rearrange it to solve for the unknown variable 't', the time it takes for the body to stop. Step 5) Substitute all the known values into the equation to calculate 't'. It comes out to be 6 seconds."
}