{
    "Question": "Q5: Read each statement below carefully and state with reasons if it is true or false:\r\n(a) The magnitude of a vector is always a scalar \r\n(b) Each component of a vector is always a scalar \r\n(c) The total path length is always equal to the magnitude of the displacement vector of a particle\r\n(d) The average speed of a particle (defined as total path length divided by the time taken to cover the path) is either greater or equal to the magnitude of the average velocity of the particle over the same interval of time\r\n(e) Three vectors not lying in a plane can never add up to give a null vector",
    "Original Solution": "(a) True:\r\nThe magnitude of a vector is a number. So, it is a scalar.\r\n(b) False:\r\nEach component of a vector is also a vector.\r\n(c) False:\r\nThe total path length is a scalar quantity, whereas displacement is a vector quantity. Hence, the total path length is always greater than the magnitude of displacement. It becomes equal to the magnitude of displacement only when a particle is moving in a straight line.\r\n(d) True:\r\nIt is because of the fact that the total path length is always greater than or equal to the magnitude of displacement of a particle.\r\n(e) True:\r\nThree vectors, which do not lie in a plane, cannot be represented by the sides of a triangle taken in the same order.",
    "Detailed Solution": "Step 1) Let's start with the statement (a) - The magnitude of a vector is always a scalar. This is True. The magnitude of a vector refers to the 'size' or 'length' of the vector. No matter what direction a vector points in, its magnitude will always be a positive number, and positive numbers are considered scalars. Thus, the magnitude of a vector is indeed a scalar. Step 2) Now, consider statement (b) - Each component of a vector is always a scalar. This is False. The components of a vector are the projections of the vector along the axes of a coordinate system. These projections retain a directional characteristic - either positive or negative - depending on the direction of the vector component. Therefore, each component of a vector remains a vector itself. Step 3) Moving on to the statement (c) - The total path length is always equal to the magnitude of the displacement vector of a particle. This is also False. The total path length can be thought of as the 'distance covered' by a particle, which takes into account every single twist and turn made by the particle. On the other hand, the displacement is the straight-line distance from the initial to the final position, regardless of the path taken. Hence, the total path length is usually greater than the magnitude of displacement, except for when the particle moves in a straight line. Step 4) Next, we examine statement (d) - The average speed of a particle is either greater or equal to the magnitude of the average velocity of the particle. This is True. The average speed of a particle takes into account the total distance travelled, whereas the average velocity considers the displacement from the initial to the final position. Therefore, the average speed must be greater than or equal to the magnitude of the average velocity. Step 5) Lastly, let's look at statement (e) - Three vectors not lying in a plane can never add up to give a null vector. This is also True. Vectors can only be added graphically by placing them head to tail in a diagram, forming a triangle. If the three vectors do not lie in the same plane, they cannot form a triangle and hence, their resultant cannot be a null vector.",
    "Solution Outline": "Step 1) Evaluate statement (a), the magnitude of a vector is always a scalar, which is True as the magnitude of a vector expresses its size, which is a scalar quantity. Step 2) Evaluate statement (b), each component of a vector is always a scalar, which is False as each component of a vector retains its directional characteristic, making it a vector itself. Step 3) Evaluate statement (c), the total path length is always equal to the magnitude of the displacement vector of a particle, which is False as the path length is usually larger than the displacement except when the motion is along a straight line. Step 4) Evaluate statement (d), the average speed of a particle is either greater or equal to the magnitude of the average velocity of the particle, which is True since speed refers to the total distance covered and velocity refers to the displacement. Step 5) Evaluate statement (e), three vectors not lying in a plane can never add up to give a null vector, which is True because vectors can be graphically added only in a plane."
}