{
    "Question": "2.19. The principle of ‘parallax’ in section 2.3.1 is used in the determination of distances of very distant stars. The baseline AB is the line joining the Earth’s two locations six months apart in its orbit around the Sun. That is, the baseline is about the diameter of the Earth’s orbit ≈ 3 × 1011m. However, even the nearest stars are so distant that with such a long baseline, they show parallax only of the order of 1” (second) of arc or so. A parsec is a convenient unit of length on the astronomical scale. It is the distance of an object that will show a parallax of 1” (second of arc) from opposite ends of a baseline equal to the distance from the Earth to the Sun. How much is a parsec in terms of metres?",
    "Original Solution": "Diameter of Earth’s orbit = 3 × 10^(11) m\r\nRadius of Earth’s orbit r = 1.5 × 10^(11) m\r\nLet the distance parallax angle be θ=1″ (s) = 4.847 × 10^(–6) rad.\r\nLet the distance of the star be D.\r\nParsec is defined as the distance at which the average radius of the Earth’s orbit subtends an angle of 1″\r\nTherefore, D = 1.5 × 10^11 /4.847 × 10^–6= 0.309 x 10^17 \r\nHence 1 parsec ≈ 3.09 × 10^16 m.",
    "Detailed Solution": "Step 1) First, let's start with what we know. The problem gives us the diameter of Earth's orbit around the Sun, which is 3 × 10^(11) m. Step 2) Now, we need the radius of the Earth’s orbit. The radius will be half the diameter, which results in r = 1.5 × 10^(11) m. Step 3) We also know that the principle of parallax uses a baseline which in astronomy terms is at a right angle to the line from the observer to the distant object—here, the star. A parsec is defined as the distance at which the radius of the Earth's orbit subtends an angle of 1\". This angle, in radian units is θ=1″ (s) = 4.847 × 10^(–6) rad. Step 4) Preparing to calculate the distance of the star, we'll denote it as D. Step 5) Using the properties of right-angled triangles (where the radius of the Earth's orbit is one side, the distance to the star is the hypotenuse, and the angle at the star is the parallax angle of 1'), we know that the tangent of the parallax angle is equal to the opposite side (the Earth's orbit radius r) divided by the adjacent side (the star distance D). Therefore, we have tan(θ) = r/D. Step 6) If we rearrange this equation to solve for D, we get D = r / tan(θ). Step 7) Substituting the known values from steps 2 and 3 into this equation, we get D = 1.5 × 10^11 /4.847 × 10^–6= 0.309 x 10^17 which simplifies to D = 3.09 × 10^16 m. Step 8) Therefore, a parsec, which is defined as the distance at which the average radius of the Earth's orbit subtends an angle of 1\", is approximately equivalent to 3.09 × 10^16 meters.",
    "Solution Outline": "Step 1) We begin with known values: the diameter of Earth's orbit. Step 2) Using this, we calculate the radius as half of the diameter. Step 3) We understand the parsec definition in terms of a right-angle triangle formed by the Earth's orbit radius, the distance to a star, and the parallax angle. Step 4) We denote the star distance as D. Step 5) Using the right-angled triangle properties, we derive that tan(θ) = r/D which gives us a relation between the angle, the radius and the distance. Step 6) We rearrange the above equation to solve for D giving us D = r / tan(θ). Step 7) Substituting our known values for r and θ into the equation, we calculate D, which is in meters. Step 8) We conclude that a parsec is approximated to this calculated distance D in meters."
}