{
    "Question": "2. Choose the correct alternative.\r\n(a) Acceleration due to gravity increases/decreases with increasing altitude.\r\n(b) Acceleration due to gravity increases/decreases with increasing depth (assume the earth to be a sphere of uniform density).\r\n(c) Acceleration due to gravity is independent of the mass of the earth/mass of the body.\r\n(d) The formula –G M m(1/r 2 – 1/r1) is more/less accurate than the formula mg(r2 – r1) for the difference of potential energy between two points r2 and r1 distance away from the centre of the earth.",
    "Original Solution": "(a) decreases\r\n(b) decreases\r\n(c) mass of the body\r\n(d) more",
    "Detailed Solution": "Step 1) Consider the given alternatives related to gravity. Gravity is a force that attracts two bodies towards each other and it is directly proportional to the product of their masses and inversely proportional to the square of the distance between their centres, which is represented as F = G(Mm/r²), where F is the gravitational force, G is the gravitational constant, M and m are the masses of the two bodies, and r is the distance between them. Step 2) Look at option (a) which states 'Acceleration due to gravity increases/decreases with increasing altitude'. As the altitude increases, the distance from the center of the Earth increases. This increases the denominator of the equation we discussed, which in turn decreases the gravitational force. Hence, the acceleration due to gravity decreases with increasing altitude. Step 3) Consider option (b) 'Acceleration due to gravity increases/decreases with increasing depth (assume the earth to be a sphere of uniform density)'. As we know, gravity is strongest at the surface of the earth and it decreases both ways, whether we go upwards (height) or downwards (depth). So, as the depth inside the Earth increases, the acceleration due to gravity decreases. Step 4) Look at option (c) 'Acceleration due to gravity is independent of the mass of the earth/mass of the body'. As per Newton's law of universal gravitation, the acceleration due to gravity is independent of the mass of the body, so the correct alternative is 'mass of the body'. Step 5) Consider option (d) 'The formula –G M m(1/r2 – 1/r1) is more/less accurate than the formula mg(r2 – r1) for the difference of potential energy between two points r2 and r1 distance away from the centre of the earth'. The first formula represents the difference in gravitational potential energy between two points in space using the universal law of gravitation. The second formula is an approximation that is only accurate for small differences in height near the surface of the Earth. Hence, the formula –G M m(1/r2 – 1/r1) is more accurate.",
    "Solution Outline": "Step 1) Understand the gravity concept, expressed as F = G(Mm/r²). Step 2) For (a), as altitude increases, the distance 'r' from Earth's center increases, reducing the acceleration due to gravity. The correct choice is 'decreases'. Step 3) For (b), as depth increases, similar to altitude, the acceleration due to gravity decreases. So, the correct choice is 'decreases'. Step 4) For (c), recall Newton's law of universal gravitation. The acceleration due to gravity doesn't depend on the mass of the falling body, but on the mass of the Earth. Hence, the correct choice is 'mass of the body'. Step 5) For (d), compare the formulae –G M m(1/r2 – 1/r1) and mg(r2 – r1). The first is in line with the universal law of gravitation and hence is more accurate for distances away from the Earth's surface, while the latter is an approximation that works well for small differences in heights near the Earth's surface. So, the correct choice is 'more accurate'."
}