{
    "Question": "Q18. Guitar strings X and Y striking the note ‘Ga’ are a little out of tune and give beats at 6 Hz. When the string X is slightly loosened, and the beat frequency becomes 3 Hz. Given that the original frequency of X is 324 Hz, find the frequency of Y.",
    "Original Solution": "Given,\r\nFrequency of  X, fX = 324 Hz\r\nFrequency of  Y = fY\r\nBeat’s frequency, n = 6 Hz\r\nAlso,\r\nn = \\(\\begin{array}{l}\\left | f_{X}\\pm f_{Y} \\right |\\end{array} \\)\r\n6 = \\(\\begin{array}{l}324 \\pm f_{Y}\\end{array} \\)\r\n=> fY = 330 Hz or 318 Hz\r\nAs frequency drops with a decrease in tension in the string, thus fY cannot be 330 Hz\r\n=> fY = 318 Hz.",
    "Detailed Solution": "Step 1) Identify the given quantities from the problem. The frequency of the string X (fX) is 324 Hz, and the beat frequency (within the tone 'Ga') is initially 6 Hz. The frequency of string Y (fY) is unknown. Step 2) Note the definition of beat frequency, which is the absolute difference in frequencies of two waves: n = | fX ± fY |. Initially, n = 6. That translates into the equation 6 = | 324 ± fY |. Step 3) From the above equation, solve for fY. This gives you two possible solutions: 330 Hz and 318 Hz, since the absolute value equation equals to 6 either when fY is added or subtracted from fX. Step 4) Remember that when a guitar string's tension is decreased, the frequency drops. String X was loosened, so its frequency was reduced and the beat frequency subsequently changed to 3 Hz, indicating it was now closer in frequency to string Y. This means that the frequency of string Y has to be lower than the original frequency of X (324 Hz), ruling out the solution of fY = 330 Hz. Thus, fY must be 318 Hz.",
    "Solution Outline": "Step 1) Identify given quantities, namely, fX = 324 Hz, and the initial beat frequency (n) = 6 Hz, and the unknown, fY. Step 2) Understand the principle of beat frequencies that it is the absolute difference of frequencies of two waves combined. So the initial situation gives us the equation, n = 6 = | fX ± fY | or 6 = | 324 ± fY |. Step 3) Solve the absolute value equation for fY, yielding two possible solutions: 330 Hz and 318 Hz. Step 4) Utilize the knowledge that if a string's tension decreases, its frequency decreases as well. Given that string X was loosened and it was mentioned that the beat frequency dropped to 3 Hz (closer to fY), we determine that fY must be lower than the original fX (324 Hz). Thus, we discard 330 Hz as the frequency for string Y, leaving us with fY = 318 Hz."
}