{
    "Question": "15. The acceleration due to gravity on the surface of moon is 1.7 m s^-2. What is the time period of a simple pendulum on the surface of moon if its time period on the surface of earth is 3.5 s? (g on the surface of earth is 9.8 m s^-2)\r\n",
    "Original Solution": "Given\r\nAcceleration due to gravity on the surface of moon, g’ = 1.7 m s^-2\r\nAcceleration due to gravity on the surface of earth, g = 9.8 m s^-2\r\nTime period of a simple pendulum on earth, T = 3.5 s\r\nT = 2 π√l / g\r\nWhere,\r\nl is the length of the pendulum\r\nTherefore,\r\nl = {T^2 / (2π)^2} x 2\r\nOn substituting, we get,\r\nl = (3.5)^2 / {4 x (3.14)^2} x 9.8 m\r\nThe length of the pendulum remains constant\r\nOn moon’s surface, time period, T’ = 2 π√l / g’\r\n= 2 π [√{(3.5)2 / 4 x (3.14)2 x 9.8 / 1.7}]\r\nWe get,\r\n= 8.4 s\r\nTherefore, the time period of the simple pendulum on the surface of the moon is 8.4 s",
    "Detailed Solution": "Step 1) Identify and list the known values. The acceleration due to gravity on the moon's surface, g', is 1.7 m/s^2. The acceleration due to gravity on Earth's surface, g, is 9.8 m/s^2. The time period of a simple pendulum swinging on Earth, T, is 3.5 s. \n\nStep 2) Use the formula for the time period of a simple pendulum on Earth, which is T = 2π√(l / g). Here, 'l' denotes the length of the pendulum and 'g' is the acceleration due to gravity.\n\nStep 3) Our main goal is to find out the time period on the moon's surface. For this, we will first need to find the length of the pendulum 'l'. We can rearrange the equation to isolate 'l' by squaring both sides and rearranging, which will give us l = T²g / (2π)².\n\nStep 4) Substitute known values of T and g into the equation, which gives l = (3.5 s)^2 * 9.8 m/s² / 4*(3.14)^2. You will find that the units of 's' (seconds) will cancel out, leaving us with units of meters (m) for the length.\n\nStep 5) Note that the length of the pendulum remains constant, whether it's on Earth or the moon. \n\nStep 6) Use the formula for the time period of a simple pendulum on the moon, which is T' = 2π√(l / g'). Since we already calculated 'l' as (3.5 s)^2 * 9.8 m/s² / 4*(3.14)^2, we substitute these values into the formula which is T' = 2π * √{ [(3.5 s)^2 * 9.8 m/s² / 4*(3.14)^2] / 1.7 m/s²}.\n\nStep 7) After carrying out the calculation, we find that the time period of a simple pendulum on the moon's surface is about 8.4 seconds.",
    "Solution Outline": "Step 1) Identify and list the known values: acceleration due to gravity on the moon (g') and Earth (g), and the time period of the pendulum on Earth (T).\n\nStep 2) Use the formula T = 2π√(l/g) to understand how time period, length, and gravity are related.\n\nStep 3) Rearrange this formula to find the length of the pendulum (l = T²g / (2π)²), knowing that the length remains constant on Earth and the moon.\n\nStep 4) Substitute known values into the equation to find the pendulum's length.\n\nStep 5) Use the formula for time period on the moon T' = 2π√(l / g') and substitute the calculated length and known valor of moon's gravity.\n\nStep 6) Compute the calculation to find that the time period of a pendulum on the moon's surface would be 8.4 seconds."
}