{
    "Question": "13: Glycerine flows steadily through a horizontal tube of length 1.5 m and radius 1.0 cm. If the amount of glycerine collected per second at one end is 4.0 × 10^–3 kg s^–1, what is the pressure difference between the two ends of the tube? (Density of glycerine = 1.3 × 10^3 kg m^–3 and viscosity of glycerine = 0.83 Pa s.) [You may also like to check if the assumption of laminar flow in the tube is correct.]",
    "Original Solution": "Given:Length of the horizontal tube, l = 1.5 m\r\nRadius of the tube, r = 1 cm = 0.01 m\r\nDiameter of the tube, d = 2r = 0.02 m\r\nGlycerine is flowing at the rate of 4.0 × 10^-3 kg/s\r\nM = 4.0 × 10^-3 kg/s\r\nDensity of glycerine, ρ = 1.3 × 10^3 kg m^-3\r\nViscosity of glycerine, η = 0.83 Pa s\r\nWe know the volume of glycerine flowing per sec,\r\nV = \\(\\begin{array}{l}\\frac{ M }{ density }\\end{array} \\) = \\(\\begin{array}{l} \\frac{ 4\\; \\times \\;10^{ -3 } }{ 1.3\\; \\times \\;10^{ 3 } }\\end{array} \\) = 3.08 x 10^-6 m^3 /s\r\nUsing Poiseville’s formula, we get\r\nV = \\(\\begin{array}{l}\\frac{ \\pi p^{‘} r^{ 4 }}{ 8\\; \\eta \\;l}\\end{array} \\)\r\n\\(\\begin{array}{l}p^{‘} = \\frac{ V \\;8\\; \\eta \\;l}{ \\pi r^{ 4 }}\\end{array} \\)\r\n\r\nWhere p’ is the pressure difference between the two ends of the pipe.\r\np’ = \\(\\begin{array}{l}\\frac{3.08\\; \\times \\;10^{-6} \\;\\times \\;8\\; \\times \\;0.83\\; \\times \\;2 }{\\pi \\;\\times \\;(0.01)^{4} }\\end{array} \\) = 9.8 x 10^2 Pa\r\nAnd, we know\r\n\\(\\begin{array}{l}R = \\frac{ 4 \\;\\rho \\;V }{ \\pi \\;d\\; \\eta }\\end{array} \\), [Where R = Reynolds’s number]\r\nR = \\(\\begin{array}{l}\\frac{4 \\times 1.3 \\times 10^{3} \\times 3.08\\times 10^{-6} }{\\pi \\times 0.83 \\times 0.02 }\\end{array} \\) = 0.3\r\nSince Reynolds’ number is 0.3, which is way smaller than 2000, the flow of glycerine in the pipe is laminar. ",
    "Detailed Solution": "Step 1) The problem provides us with several values: the length of the tube (1.5 m), the radius of the tube (1.0 cm, but recall that we must convert this value to meters, yielding 0.01 m for use in our calculations), the flow rate of the glycerin (4.0 × 10^-3 kg/s), the density of the glycerine (1.3 × 10^3 kg/m^3), and the viscosity of the glycerine (0.83 Pa s). Step 2) From the known radius, we can calculate the diameter of the tube by multiplying the radius by 2, giving us a diameter of 0.02 m. Step 3) We can calculate the volume flow rate (the volume of glycerine passing through the tube per second) by dividing the mass flow rate by the density of the glycerine. This gives us 3.08 x 10^-6 m^3 /s. Step 4) We can use Poiseuille’s formula, which is used to calculate the volume flow rate in terms of tube dimensions and fluid properties, to calculate the pressure difference (p’) between the two ends of the tube. Step 5) Therefore, we rearrange the Poiseuille’s formula to get an equation for p'. After substituting our known values into this equation, we find that p' equals 9.8 x 10^2 Pa. Step 6) Lastly, we can use the Reynolds number to check if the flow is laminar or turbulent. The Reynolds number is calculated using the formula R = (4 ρ V)/(π d η). If the Reynolds number is less than 2000, the flow is typically considered laminar. After calculating the Reynolds number, we find it to be 0.3, Therefore, the flow in the tube is indeed laminar.",
    "Solution Outline": "Step 1) Use the values provided for the dimensions of the tube, the physical properties of the glycerine, and the flow rate. Convert the radius from cm to m. Step 2) Calculate the diameter of the tube from the given radius. Step 3) Calculate the volume flow rate using the provided mass flow rate and the density of glycerine. Step 4) Use Poiseuille’s formula to express the volume flow rate in terms of the pressure difference, the dimensions of the tube, and the properties of the glycerine. Step 5) Rearrange Poiseuille’s formula to solve for the pressure difference and plug in the known values to find the pressure difference between the two ends of the tube. Step 6) Use the Reynolds number to determine whether the flow is laminar or turbulent. Calculate the Reynolds number using the known values and compare the number to the threshold for laminar vs. turbulent flow (2000). Establish that since our calculated Reynolds number is below 2000, the flow is indeed laminar."
}