{
    "Question": "Q3. Steel wire has a length of 12.0 m and a mass of 2.10 kg. What should be the tension in the wire so that the speed of a transverse wave on the wire equals the speed of sound in dry air at 20 °C = 343 m s^–1.",
    "Original Solution": "Given,\r\nLength of the steel wire, l = 12 m\r\nMass of the steel wire, m = 2.0 kg\r\nVelocity of the transverse wave, v = 343 m/s\r\nMass per unit length, μ = M /l = 2.10/12 = 0.175 kg / m\r\nWe know,\r\nVelocity of the transverse wave , v = \\(\\begin{array}{l}\\sqrt{\\frac{T}{\\mu }}\\end{array} \\)\r\nTherefore, T = v^2 μ\r\n= 343^2 x 0.175 = 2.06 x 10^4 N\r\nTherefore, the tension in the wire is 343^2 x 0.175 = 2.06 x 10^4 N.",
    "Detailed Solution": "Step 1) First, identify the known quantities given by the problem description, which are: Length (l) of the steel wire is 12 m, mass (M) of the steel wire is 2.1 kg and speed (v) of the transverse wave desired on the wire is 343 m/s. Step 2) We need to a variable named mass per unit length (μ), which is found by dividing total mass (M) over total length (l). Thus μ = M /l = 2.10 kg / 12 m = 0.175 kg/m. Step 3) We have an equation that relates speed of a wave on a string, v, to the tension, T, and mass per unit length, μ, which is, v = sqrt(T/μ). This square root relationship between v, μ, and T arises from the physics of waves. Step 4) Rearrange this equation to get T on its own on one side: T = v^2 * μ. This re-arrangement is a simple mathematical manipulation which we do to isolate T and find its value. Step 5) Plug in the known values of v and μ and compute the tension T = 343^2 * 0.175 = 2.06 x 10^4 N.",
    "Solution Outline": "Step 1) Recognize the known values given by the problem: Length (l), mass (M) and desired speed of transverse wave (v). Step 2) Calculate mass per unit length (μ) by dividing mass (M) over length (l). Step 3) Understand the relationship between v, tension (T) and μ from the equation v = sqrt(T/μ) which shows how tension impacts wave speed on a wire. Step 4) Rearrange the equation to isolate T as T = v^2 * μ. Step 5) Substitute the values of v and μ into this equation to obtain the required tension."
}