{
    "Question": "2.24. When the planet Jupiter is at a distance of 824.7 million kilometres from the Earth, its angular diameter is measured to be 35.72″ of arc. Calculate the diameter of Jupiter.",
    "Original Solution": "Distance of the planet Jupiter from Earth, D= 824.7 million kilometres  = 824.7 x 10^6 km\r\nAngular diameter θ = 35.72 “= 35.72 x 4.85 x 10^(-6) rad\r\n= 173.242 x 10^(-6) rad\r\nDiameter of Jupiter d = θ x D= 173.241 x 10^(-6) x 824.7 x 10^6 km\r\n=142871 = 1.43 x 10^5 km",
    "Detailed Solution": "Step 1) First, you need to note down the information given in the problem. The provided distances are the distance from the Earth to Jupiter (D = 824.7 million km), and the angular diameter of Jupiter (θ = 35.72″ of arc). Step 2) Convert these values to more practical units. The distance is already in km, which is useful for this problem. However, the angular diameter is often expressed in radians in physics, so convert the angular diameter from arcseconds to radians. Recall that 1 arcsecond approximates to 4.85 x 10^-6 radians. So, θ = 35.72 arcseconds = 35.72 x 4.85 x 10^-6 radians = 173.242 x 10^-6 radians. Step 3) Next, apply the formula to calculate the physical diameter of Jupiter, which is given by d = θD. δ is the linear diameter, θ the angle subtended at the observer (in radians), and D the distance from the observer to the object. Step 4) Put the known values in the preceding formula. That means, d = 173.241 x 10^-6(rad) x 824.7 x 10^6(km). Simplifying this you get d = 142871 km. Step 5) You can further represent this number in the scientific notation as per the given solution, which is d = 1.43 x 10^5 km.",
    "Solution Outline": "Step 1) Start by acknowledging the given values which are the distance from Earth to Jupiter and the angular diameter of Jupiter. Step 2) Apply unit conversion to the given angular diameter from arcseconds to radians using the conversion factor 4.85 x 10^-6 radians per arcsecond. Step 3) Use the formula for calculating the diameter of an object based on its angular diameter and distance from the observer, this formula is d = θD. Step 4) Plug in the known values into the formula and perform the calculation. θ is the angular diameter you've converted to radians, and D is the given distance from Earth to Jupiter. Step 5) The result is the diameter of Jupiter, which the given solution further represents in scientific notation."
}