{
    "Question": "Q12. A solid cylinder of mass 20 kg rotates about its axis with an angular speed 100 rad s^(-1). The radius of the cylinder is 0.25 m. What is the kinetic energy associated with the rotation of the cylinder? What is the magnitude of the angular momentum of the cylinder about its axis?",
    "Original Solution": "Given,\r\nMass of the cylinder, m = 20 kg\r\nAngular speed, ω = 100 rad s^–1\r\nRadius of the cylinder, r = 0.25 m\r\nThe moment of inertia of the solid cylinder\r\nI = mr^2 / 2\r\n= (1/2) × 20 × (0.25)^2\r\n= 0.625 kg m^2\r\n( a ) ∴ Kinetic energy = (1/2) I ω2\r\n= (1/2) × 0.625 × (100)2 =3125 J\r\n( b )∴Angular momentum, L = Iω\r\n= 0.625× 100\r\n= 62. 5 Js",
    "Detailed Solution": "Step 1) Begin by identifying the known values from the problem: the mass (m) of the cylinder is 20 kg. The angular speed (ω) is 100 rad s^(-1). The radius (r) of the cylinder is 0.25 m. Step 2) In order to make further calculations, we need to find the moment of inertia (I) of the cylinder. The formula for the moment of inertia for a solid cylinder rotating about its axis is I = mr^2 / 2. Step 3) Insert our values into this formula. This results in (1/2) × 20 × (0.25)^2, which simplifies to 0.625 kg m^2. This is the inertia of the cylinder. Step 4) With the inertia calculated, we can now find the kinetic energy associated with the rotation of the cylinder. The formula for kinetic energy in a rotational motion is (1/2) I ω2. Step 5) Plugging our determined I and given ω into this equation gives us (1/2) × 0.625 × (100)^2. The solution is 3125 J. This is the kinetic energy of the cylinder. Step 6) The last step in the problem is to find the angular momentum (L) of the cylinder. The formula for angular momentum is L = Iω. Step 7) Plugging our values into this formula returns 0.625 × 100, which is 62.5 Js. Thus, the angular momentum of the cylinder about its axis is 62.5 Js.",
    "Solution Outline": "Step 1) Identify the known values: mass of the cylinder (m), angular speed (ω), and radius of the cylinder (r). Step 2) To find the moment of inertia (I) of the cylinder, use the formula for a solid cylinder I = mr^2 / 2. Insert the known values and solve. Step 3) Use the inertia to calculate the kinetic energy using the formula for rotational motion, (1/2) I ω2. Plug in the inertia and angular speed and solve. Step 4) Use the moment of inertia and the angular speed to find the angular momentum using the formula L = Iω. Substitute the inertia and angular speed into the formula to solve for the angular momentum."
}