{
    "Question": "The casing of a rocket in flight burns up due to friction. At whose expense is the heat energy required for burning obtained? The rocket or the atmosphere?",
    "Original Solution": "When the casing burns up due to friction, the rocket’s mass gets reduced.\r\nAs per the law of conservation of energy:\r\nTotal energy = kinetic energy + potential energy\r\n= mgh + \\(\\begin{array}{l}\\frac{1}{2}\\end{array} \\) mv^2\r\nThere will be a drop in total energy due to the reduction in the mass of the rocket. Hence, the energy which is needed for the burning of the casing is obtained from the rocket.",
    "Detailed Solution": "Step 1) First, we observe that the casing of the rocket is burning up because of friction. This means the rocket's mass is being reduced as the casing burns. Step 2) Now, we need to figure out the source of energy required for burning. For this, we refer to the law of conservation of energy, which tells us that energy can neither be created nor destroyed, but it can be converted from one form to another. Step 3) According to the law, the total energy of the rocket can be calculated as the sum of its kinetic energy and its potential energy. The equation for total energy is total_energy = mgh + (1/2)mv^2 where 'm' is mass, 'g' is gravitational force, 'h' is height, and 'v' is velocity. Step 4) When the rocket's casing burns up, there's a reduction in the rocket mass (m) which means there's a reduction in both kinetic and potential energy. This implies that there is a drop in the rocket's total energy. Step 5) Finally, since energy must be conserved as per our law of energy conservation, the lost total energy of the rocket is then used or converted to produce the energy required for burning. Hence, the energy required for burning the casing is obtained from the rocket itself.",
    "Solution Outline": "Step 1) Identify that the rocket's casing burning due to friction results in reduction of rocket's mass. Step 2) Referring to the law of conservation of energy, infer that the energy for burning must come from the rocket's initial energy. Step 3) Use total_energy = mgh + (1/2)mv^2, which combines potential and kinetic energy to represent the rocket's total energy. Step 4) Note that the drop in the rocket's mass leads to a decrease in its total energy. Step 5) Conclude that the 'lost' energy from the rocket must be what's utilized for the casing to burn as per the conservation law. Hence, the energy is obtained from the rocket itself."
}