{
    "Question": "37. A disc revolves with a speed of 33⅓ rpm and has a radius of 15 cm. Two coins are placed at 4 cm and 14 cm away from the centre of the record. If the coefficient of friction between the coins and record is 0.15, which of the coins will revolve with the record?",
    "Original Solution": "Speed of revolution of the disc = 33 ⅓ rpm= 100/3 rpm= 100/ (3 x 60) rps = 5/9 rps\r\nω = 2πv = 2 x (22/7)x (5/9) = 220/63 rad/s\r\nThe coins revolve with the disc, the centripetal force is provided by the frictional force mv2/r ≤ μmg ——–(1)\r\nAs v = rω, equation (1) becomes mrω2/r ≤ μmg\r\nr ≤ μg/ω^2 = (0.15 x 10)/(220/63)^2 = 12 cm\r\nFor coin A, r = 4 cm\r\nThe condition (r≤ 12) is satisfied for coin placed at 4cm, so coin A will revolve with the disc\r\nFor coin B, r = 14 cm\r\nThe condition (r≤ 12) is not satisfied for the coin placed at 14cm, so coin B will not revolve with the disc.",
    "Detailed Solution": "Step 1) First, notice that the speed of revolution of the disc is given in revolutions per minute (rpm). Conversion of this speed to revolutions per second (rps) is crucial as most calculations in physics are done using SI units (seconds in this case). Therefore, multiply the given 33 ⅓ rpm by 1/60 to convert to rps, giving you 100/(3 x 60) = 5/9 revolutions per second. Step 2) The radial or angular speed (ω) of the disc's motion is calculated using the formula for angular speed, ω = 2πv, where v is the speed in rps. Substituting 5/9 for v in the equation, you get ω = 2 * (22/7) * (5/9) which simplifies to 220/63 rad/s. Step 3) When the coins are revolving with the disc, the frictional force exerted on them provides the centripetal force for their circular motion according to the formula mv^2/r ≤ μmg, equation (1). In this formula, m is the mass of the coin, v is the speed, r is the radius, μ is the coefficient of friction, and g is the acceleration due to gravity. Step 4) Substituting the value for v, as v = rω, into equation (1), it simplifies to mrω^2/r ≤ μmg. With further simplification, we find that r ≤ μg/ω^2. Substituting the given values into this equation yields r ≤ (0.15 x 10)/(220/63)^2, which results to r ≤ 12 cm. This implies that the maximum radius at which the coin will remain in motion with the disc is 12 cm. Step 5) Finally, compare this value with the distance of your two coins from the center of the disc. For coin A, r = 4 cm and for coin B, r = 14 cm. Clearly, coin A, which is 4 cm away from the center, satisfies the condition (r ≤ 12), while coin B, which is 14 cm away, does not. So, coin A will revolve with the disc and coin B will not.",
    "Solution Outline": "Step 1) Convert the speed of the disc from revolutions per minute (rpm) to revolutions per second (rps) for simplicity in later calculations. Step 2) Compute for the angular speed of the disc's motion using the formula ω = 2πv, which involves the converted speed. Step 3) Use the frictional force which acts as the centripetal force for the coins' motion to derive a formula mv^2/r ≤ μmg to describe the maximum allowed speed of the coins without slipping. Step 4) Substitute the relationship v = rω into the formula from step 3 to simplify it to an equation in terms of the radius, r. Solve this equation to find the radius at which the force of friction can just provide the required centripetal force, given by r ≤ μg/ω^2. Step 5) Determine if the radius of each coin's position satisfies this inequality to find out which coin(s) will revolve with the disc."
}