{
    "Question": "10. A body is moving unidirectionally under the influence of a source of constant power. Its displacement in time t is proportional to\r\n(i) \\(\\begin{array}{l}t^{\\frac{1}{2}}\\end{array} \\)\r\n(ii) \\(\\begin{array}{l}t^{\\frac{3}{2}}\\end{array} \\)\r\n(iii) t^2 \r\n(iv) t",
    "Original Solution": "We know that power is given by,\r\nP = Fv\r\n= mav = mv\\(\\begin{array}{l}\\frac{dv}{dt}\\end{array} \\)\r\n\r\n= k (constant)\r\nvdv = \\(\\begin{array}{l}\\frac{k}{m}\\end{array} \\) dt\r\nOn integration,\r\nv = \\(\\begin{array}{l}\\sqrt{\\frac{2kt}{m}}\\end{array} \\)\r\n\r\nTo get the displacement,\r\nv = \\(\\begin{array}{l}\\frac{dx}{dt}\\end{array} \\) = \\(\\begin{array}{l}\\sqrt{\\frac{2k}{m}}\\end{array} \\) \\(\\begin{array}{l}t^{\\frac{1}{2}}\\end{array} \\)\r\n\r\ndx = \\(\\begin{array}{l}k{}'\\end{array} \\) \\(\\begin{array}{l}t^{\\frac{1}{2}}\\end{array} \\) dt\r\nwhere \\(\\begin{array}{l}k{}'\\end{array} \\) = \\(\\begin{array}{l}\\sqrt{\\frac{2k}{3}}\\end{array} \\)\r\n\r\nx = \\(\\begin{array}{l}\\frac{2}{3}\\end{array} \\) \\(\\begin{array}{l}k{}'\\end{array} \\) \\(\\begin{array}{l}t^{\\frac{2}{3}}\\end{array} \\)\r\n\r\nHence, from the above equation it is shown that x \\(\\begin{array}{l}\\propto\\end{array} \\) \\(\\begin{array}{l}t^{\\frac{3}{2}}\\end{array} \\)\r\n",
    "Detailed Solution": "Step 1) Starting off, we recognize that the power (P), in the case of a moving body, can be defined as the force (F) multiplied by the velocity (v), or P = Fv. Step 2) We also remember that force is equal to the mass (m) of the body times its acceleration (a). In turn, acceleration is the rate of change of velocity with respect to time, dv/dt. So we can rewrite F as ma and substitute it into the power equation to get P = mav = mv(dv/dt). Step 3) Given that the power is constant, we set it equal to a constant value k. Therefore, we have found a relationship in terms of velocity and time. Step 4) We rearrange that relationship to isolate for velocity by multiplying both sides of the equation by dt, resulting in mvdv = kdt. Step 5) We then solve for velocity by integrating both sides of the equation, leading us to the equation for velocity as a function of time: v = sqrt(2kt/m). Step 6) Knowing that velocity is the rate of displacement with respect of time (v = dx/dt), we plug our velocity equation into this definition. Now we have dx/dt = sqrt(2k/m) * t^1/2. Step 7) We then find the displacement by integrating both sides with respect to time again, leading to the equation dx = k' * t^1/2 dt, where k' is a new constant defined as sqrt(2k/3). Step 8) Finally, after integration, we find that displacement x is equal to 2/3 * k' * t^3/2, indicating that the displacement x is proportional to t^3/2 which is one of the given options.",
    "Solution Outline": "Step 1) Begin by using the definition of power for a moving body, P = Fv. Step 2) Modify it by replacing force with mass times acceleration and acceleration with velocity's rate of change over time. This turns our equation into P = mv(dv/dt). Step 3) As we know power is constant, set it equal to a constant k. Step 4) Isolate for velocity by manipulating the equation, getting mvdv = kdt. Step 5) Solve for velocity by integrating, to find v = sqrt(2kt/m). Step 6) Substitute that equation into the definition of velocity as the rate of displacement over time (v = dx/dt). This results in the equation dx/dt = sqrt(2k/m) * t^(1/2). Step 7) Solve for displacement by integrating again, which gives you dx = k' * t^(1/2) dt where k' is a new constant defined as sqrt(2k/3). Step 8) Ultimately, after integration, one gets x = 2/3 * k' * t^(3/2). Meaning, on analyzing, the displacement is proportional to t^(3/2)."
}