{
    "Question": "Q22. A travelling harmonic wave on a string is described by y(x, t) = 7.5 sin (0.0050x +12t + π/4).(a) What are the displacement and velocity of oscillation of a point at x = 1 cm and t = 1 s? Is this velocity equal to the velocity of wave propagation?(b) Locate the points of the string which have the same transverse displacements and velocity as the x = 1 cm point at t = 2 s, 5 s and 11 s.",
    "Original Solution": "(a) The travelling harmonic wave is y(x, t) = 7.5 sin (0.0050x +12t + π/4)\r\nAt x = 1 cm and t = 1 s\r\ny (1,1) = 7.5 sin (0.0050 (1)  +12 (1) + π/4)\r\n= 7.5 sin (12.0050 + π/4)  ——-(1)\r\n= 7.5 sin θ\r\nθ = (12.0050 + π/4) x (180/3.14)\r\n= 12.0050 + (3.14/4) = 12.79 x (180/3.14)\r\nθ  = 733.180\r\ny (1,1) = 7.5 sin (733.180)\r\n= 7.5 sin (90 x 8 + 13.180)\r\n= 7.5 sin (13.180)\r\n= 7.5 x 0.228\r\n= 1.71\r\nThe velocity of oscillation,\r\nAt x = 1 cm and t = 1 s\r\nθ = (12.005 + π/4)\r\n= (12.005 + π/4) x 180/π\r\n= 12.79 x 180/3.14\r\nθ = 12.79 x 57.32 = 733.18\r\nv = 90 cos (733.18)\r\n= 90 cos (720 + 13.18)\r\n= 90 cos 13.18\r\n= 90 x 0.97 cm/s\r\n= 87.63 cm/s\r\nThe standard equation is given as\r\nWe get \\(\\begin{array}{l}y(x,t)= asin(kx +\\omega t+\\phi )\\end{array} \\)\r\nhere, k = 2π/λ\r\nand ω = 2πv\r\nComparing the given equation with the standard equation,\r\na = 7.5 cm\r\nω = 12 rad/s\r\n⇒ 2πf = 12 rad/s\r\nTherefore, f = 12/2π = 6/π\r\nk = 0.0050 cm^-1\r\n2π/λ = 0.0050 cm^-1\r\n⇒λ = 2π/0.0050 = 400 π\r\nThe velocity of the wave propagation, v = fλ\r\n= (6/π) x 400 π = 2400 cm/s\r\nVelocity at x = 1 cm and t = 1s is not equal to the velocity of wave propagation\r\n(b) Propagation constant , k=2π/λ\r\nhere λ is the wavelength\r\n⇒ λ=2π/k=(2×3.14)/0.0050\r\n=1256cm=12.56 m\r\nAll the points at a distance ±λ,±2λ,… from x = 1 cm will have the same transverse displacement and velocity.  As λ = 12.56 m, the points ±12.56m,±25.12m,… and so on for x = 1 cm, will have the same displacement as the x= 1 cm points at t = 2s, 5s and 11s.",
    "Detailed Solution": "Step 1) Our first task is to understand the wave equation given, which is y(x, t) = 7.5 sin (0.0050x +12t + π/4). This is the general form of the wave equation for a wave traveling in the positive x direction. Here, the amplitude of the wave is 7.5 cm (a) and the wave varied with the spatial position (x) and time (t).  The arguments of the 'sin' function can tell us the various properties of the wave including the wave speed, wave number, phase of the wave etc. Step 2) We are tasked to find out the displacement and velocity of oscillation of a point at x = 1 cm and t = 1 s. For displacement, simply plug in the given x and t into the wave function, where we obtain 7.5 sin (0.0050 * (1) +12 * (1) + π/4) which after some simplification gives 7.5 sin (12.0050 + π/4). After converting to degrees, we find the angle to be 733.18⁰. We then reduce this to the range within 360 degrees and calculate the 'sin' of the angle to determine the displacement to be 1.71 cm. Step 3) For the velocity of the point, we differentiate the displacement with respect to time and get 90 cos (733.18). Using a similar method as in step 2, we simplify it to get 90 cos 13.18 and calculate the 'cos' of the angle to find the velocity to be 87.63 cm/s. Step 4) To compare this velocity with the wave propagation velocity, we first need to understand the properties of the given wave. We start by comparing given wave equation to standard sinusoidal wave equation and from it the wave number k and angular frequency ω is 0.0050 cm⁻¹ and 12 rad/s, respectively. Using these, we calculate the wavelength λ to be 400 π and frequency f to be 6/π. Wave speed is given as the product of frequency and wavelength which we found to be 2400 cm/s which is much larger than the oscillation speed at a point. Thus, the velocity of the oscillating point is not equal to the wave propagation velocity. Step 5) Now, we are asked in the second part of the question to locate the points of the string which have the same transverse displacements and velocity. This is possible at the points displaced by multiple of wavelengths from the given point. So, we calculate the wavelength as λ=2π/k=(2×3.14)/0.0050 = 12.56 m and hence the points ±12.56m, ±25.12m,… and so on from x = 1 cm, will have the same displacement and velocity.",
    "Solution Outline": "Step 1) Recognize wave equation y(x, t) = 7.5 sin (0.0050x +12t + π/4) for a wave in the +x direction. Step 2) Calculate displacement of a point at x = 1 cm and t = 1 s by substituting these values into the wave equation and simplifying. Step 3) Calculate the velocity of the same point by differentiating the wave function relative to time, and simplifying. Step 4) Compare this velocity to the wave propagation velocity, derived from comparing the parts of the wave function to the standard sinusoidal wave equation. Step 5) Determine points with same displacement and velocity by considering points which are at multiple of wavelengths from the given point."
}