{
    "Question": "12. An electron and a proton are detected in a cosmic ray experiment, the first with kinetic energy 10 keV, and the second with 100 keV. Which is faster, the electron or the proton? Obtain the ratio of their speeds. (electron mass = 9.11×10^(-31) kg, proton mass = 1.67×10^(–27) kg, 1 eV = 1.60 ×10^(–19) J)",
    "Original Solution": "Electron mass, m­e = 9.11 x 10^(-31) kg\r\nProton mass, mp = 1.67 x 10^(-27) kg\r\nElectron’s kinetic energy\r\nE­ke = 20 keV = 20 x 10^3 eV\r\n= 20 x 10^3 x 1.60 x 10^(-19)\r\n= 3.2 x 10^(-15) J\r\nProton’s kinetic energy\r\nE­kp = 200 kev = 2 x 10^5 eV\r\n= 3.2 x 10^(-14) J\r\nTo find the velocity of electron ve, kinetic energy is used.\r\nEke = \\(\\begin{array}{l}\\frac{1}{2}\\end{array} \\) m\\(\\begin{array}{l}v_{e}^{2}\\end{array} \\)\r\n\r\nVe = \\(\\begin{array}{l}\\sqrt{\\frac{2\\times E_{ke}}{m}}\\end{array} \\)\r\n\r\n= \\(\\begin{array}{l}\\sqrt{\\frac{2\\times 3.2\\times 10^{-15}}{9.11\\times 10^{-31}}}\\end{array} \\)\r\n\r\n= 8.38 x 10^7 m/s\r\nTo find the velocity of proton vp, kinetic energy is used.\r\nEkp = \\(\\begin{array}{l}\\frac{1}{2}\\end{array} \\) m \\(\\begin{array}{l}v_{p}^{2}\\end{array} \\)\r\n\r\nvp =  \\(\\begin{array}{l}\\sqrt{\\frac{2\\times E_{kp}}{m}}\\end{array} \\)\r\n\r\nvp = \\(\\begin{array}{l}\\sqrt{\\frac{2\\times 3.2\\times 10^{-15}}{1.67\\times 10^{-27}}}\\end{array} \\)\r\n\r\n= 6.19 x 10^6 m/s\r\nThus, the electron moves faster when compared with the proton.\r\nThe speed ratios are \\begin{array}{l}\\frac{v_{e}}{v_{p}}\\end{array} = \\begin{array}{l}\\frac{13.53}{1}\\end{array}",
    "Detailed Solution": "Step 1) The first step is determining the known values. The mass of the electron (me) is known to be 9.11 x 10^-31 kg, and the mass of the proton (mp) is given as 1.67 x 10^-27 kg. Additionally, the kinetic energies of the electron (Eke) and proton (Ekp) are provided, in kiloelectronvolts (keV). The electron's kinetic energy is 10 keV, and the proton's kinetic energy is 100 keV. Step 2) The next step is to convert these energies into joules (J) since the kinetic energy in the equation of motion is in Joules. This is done by multiplying the known values of energies by the conversion factor 1.60 x 10^-19 (since 1 eV = 1.60 x 10^-19 J). Therefore, Eke = 10 keV = 10 x 10^3 x 1.60 x 10^-19 J = 1.6 x 10^-15 J. And, Ekp = 100 keV = 100 x 10^3 x 1.60 x 10^-19 J = 1.6 x 10^-14 J. Step 3) Then we proceed to calculate the velocities of the electron and proton using the relationship between kinetic energy and motion. The equation for kinetic energy E = 1/2 mv^2 can be rearranged to solve for velocity, v = sqrt(2E/m). Step 4) Substituting the known values into this equation, we derive the velocity of the electron, ve = sqrt(2*Eke/me) = sqrt(2*1.6 x 10^-15/9.11 x 10^-31) = 8.38 x 10^7 m/s. Similarly, the velocity of the proton, vp = sqrt(2*Ekp/mp) = sqrt(2*1.6 x 10^-14/1.67 x 10^-27) = 6.19 x 10^6 m/s. Step 5) Therefore, it's evident from the calculated velocities that the electron moves faster than the proton. Step 6) Lastly, calculate the ratio of their speeds as ve/vp = 8.38 x 10^7/6.19 x 10^6 = 13.53.",
    "Solution Outline": "Step 1) Identify the known quantities from the problem: the masses of the proton and electron, and their respective kinetic energies. Step 2) Convert the energies from keV to Joules by using the conversion factor 1 eV = 1.60 x 10^-19 J. Step 3) Use the kinetic energy equation, which connects energy, mass, and velocity in the form E = 1/2 mv^2. Isolate the velocity to get v = sqrt(2E/m). Step 4) Substitute the known values into this equation to find the velocities of the electron and proton. Step 5) Compare the values obtained to determine which particle is moving faster. Step 6) Finally, calculate the ratio of their speeds by dividing the velocity of the electron by the velocity of the proton."
}