{
    "Question": "13. A gas in equilibrium has uniform density and pressure throughout its volume. This is strictly true only if there are no external influences. A gas column under gravity, for example, does not have a uniform density (and pressure). As you might expect, its density decreases with height. The precise dependence is given by the so-called law of the atmosphere n2= n1 exp [ -mg (h2 – h1)/ kBT], where n2, n1 refer to number density at heights h2 and h1respectively. Use this relation to derive the equation for the sedimentation equilibrium of a suspension in aliquid column:n2 = n1 exp [ -mg NA (ρ – ρ′ ) (h2–h1)/ (ρ RT)], where ρ is the density of the suspended particle, and ρ′ that of the surrounding medium. [NA is Avogadro’s number and R is the universal gas constant.] [Hint: Use Archimedes’s principle to find the apparent weight of the suspended particle.]",
    "Original Solution": "Law of atmosphere\r\nn2= n1 exp [ -mg (h2 – h1)/ kBT] ———(1)\r\nThe suspended particle experiences an apparent weight because the liquid is displaced.\r\nAccording to Archimedes’s principle\r\nApparent weight = Weight of the water displaced – Weight of the suspended particle\r\n= mg – m’g\r\n= mg – Vρ’g  = mg – (m/ρ) ρ’g\r\n= mg (1 – (ρ’/ρ)) ——-(2)\r\nρ′= Density of the water\r\nρ = Density of the suspended particle\r\nm′ = Mass of the suspended particle\r\nm = Mass of the water displaced\r\nV =  Volume of a suspended particle\r\nBoltzmann’s constant (K) = R/NA ——(3)\r\nSubstituting equation (2) and equation (3) in equation (1)\r\nn2= n1 exp [ -mg (h2 – h1)/ kBT]\r\nn2 = n1 exp [ -mg (1 – ρ′/ ρ ) (h2–h1)NA / (RT)]\r\nn2 = n1 exp [ -mg NA (ρ – ρ′ ) (h2–h1)/ (ρ RT)]\r\n",
    "Detailed Solution": "Step 1) We start with the law of the atmosphere equation which is given as n2= n1 exp [ -mg (h2 – h1)/ kBT]. Here, n1 and n2 are the number densities at heights h1 and h2, respectively, and m is the mass of the gas molecule. g is the acceleration due to gravity, KB is the Boltzmann's constant, and T is the temperature. This equation describes how the density of a gas in a column changes with height due to gravity. Step 2) We need to account for the effect of the surrounding medium on the suspended particle. The particle feels an apparent weight due to the displacement of the liquid. Using Archimedes's principle, we write the equation for this apparent weight as Apparent weight = Weight of the water displaced – Weight of the suspended particle = mg – m’g = mg – Vρ’g  = mg – (m/ρ) ρ’g = mg (1 – (ρ’/ρ)). Here, ρ' is the density of the surrounding medium, ρ is the density of the suspended particle, m' is the mass of the suspended particle, m is the mass of the displaced liquid, V is the volume of the suspended particle. Step 3) From the relationship between Boltzmann's constant (K) and the universal gas constant (R), we have KB = R/NA, where NA is Avogadro's number. Step 4) We then substitute the equations from steps 2 and 3 into the original equation from step 1, leading to n2 = n1 exp [ -mg NA (ρ – ρ′ ) (h2–h1)/ (ρ RT)]. This is the sedimentation equilibrium equation for a particle suspended in a liquid column.",
    "Solution Outline": "Step 1) We identify the equation for the law of the atmosphere which connects the density of gas particles with their height in a column. Step 2) Using Archimedes's principle, we derive the equation for the apparent weight experienced by the particle due to the displacement of the liquid. Step 3) We recall the relationship between Boltzmann's constant and the universal gas constant which is essential for incorporating the effect of temperature into our calculations. Step 4) By substituting the equations from steps 2 and 3 into the one from step 1, we derive the sedimentation equilibrium equation for a suspended particle. This equation gives us the change in number density with height of a particle suspended in a liquid column."
}