{
    "Question": "9: A U-tube contains water and methylated spirit separated by mercury. The mercury columns in the two arms are in level with 10.0 cm of water in one arm and 12.5 cm of spirit in the other. What is the specific gravity of the spirit?",
    "Original Solution": "Given:\r\nHeight of the spirit column, h1 = 12.5 cm = 0.125 m\r\nHeight of the water column, h2 = 10 cm = 0.1 m\r\nLet A and B be the points of contact between spirit and mercury and water and mercury, respectively.P0 = Atmospheric pressure\r\nρ1 = Density of spirit\r\nρ2 = Density of water\r\nPressure a point A = P0 + ρ1h 1g\r\nPressure at point B = P0 + ρ2h 2g\r\nWe know the pressure at B and D is the same. So,\r\nP0 + ρ1h1g = P0 + ρ2h 2g\r\nTherefore, the specific gravity of water is 0.8.",
    "Detailed Solution": "Step 1) We start by identifying the known values in the problem statement. These are the heights of water (h2 = 10 cm = 0.1 m) and spirit columns (h1 = 12.5 cm = 0.125 m). Step 2) We then introduce points of contact between spirit and mercury (point A) and water and mercury (point B). The pressure at these points can be described by the equation P = P0 + ρhg, where P0 is the atmospheric pressure, ρ is the density and g is the gravity constant. Step 3) From the given condition, the pressures at point A and B should be equal, because the mercury levels are the same in both arms. Therefore, we have P0 + ρ1h1g = P0 + ρ2h2g, where ρ1 is the density of spirit and ρ2 is the density of water. Step 4) We can eliminate P0 from both sides as it is constant, and rearrange the equation to solve for the density of spirit, ρ1: ρ1 = ρ2 * (h2/h1). Step 5) The density of water (ρ2) is a known constant, and the heights h1 and h2 have been given. We substitute these values in the equation. Step 6) It's worth noting that the ratio ρ1/ρ2 gives us the specific gravity of spirit, and from Step 4, this ratio is equal to h2/h1. Step 7) Substituting the given values, we find that the specific gravity of the spirit is 0.8,  which finalizes our solution.",
    "Solution Outline": "Step 1) Start by identifying the known values from the problem: the heights of the spirit and water columns. These are represented in meters. Step 2) Define points A and B as the interfaces between the spirit and mercury and water and mercury, respectively. Step 3) Write the equation for pressure as P = P0 + ρhg. Step 4) Establish the pressures at points A and B are equal, leading to the equation P0 + ρ1h1g = P0 + ρ2h2g. Step 5) Solve this equation for the density of the spirit, ρ1, giving the ratio ρ1 = ρ2 * (h2/h1). Step 6) Note that the ratio between densities corresponds to the specific gravity of the spirit. The specific gravity is calculated by substituting the given values into this relationship. Step 7) Conclude that the specific gravity of the spirit is 0.8."
}