{
    "Question": "2. A pebble of mass 0.05 kg is thrown vertically upwards. Give the direction and magnitude of the net force on the pebble, \r\n(a) during its upward motion\r\n(b) during its downward motion\r\n(c) at the highest point where it is momentarily at rest. Do your Solutions change if the pebble was thrown at an angle of 45° with the horizontal direction? Ignore air resistance.",
    "Original Solution": "(a) During the upward motion of the pebble, the acceleration due to gravity acts downwards, so the magnitude of the force on the pebble is\r\nF = mg = 0.05 kg x 10 ms^(-2) = 0.5 N\r\nThe direction of the force is downwards\r\n(b) During the downward motion also the magnitude of the force will be equal to 0.5 N and the force acts downwards\r\n(c) If the pebble is thrown at an angle of 45° with the horizontal direction, it will have both horizontal and vertical components of the velocity. At the highest point, the vertical component of velocity will be zero but the horizontal component of velocity will remain throughout the motion of the pebble. This component will not have any effect on the force acting on the pebble. The direction of the force acting on the pebble will be downwards and the magnitude will be 0.5 N because no other force other than acceleration acts on the pebble.",
    "Detailed Solution": "Step 1) Understand that the question requires us to find the force acting on a thrown pebble at different stages of its motion. Given in the question is the mass of the pebble, which is 0.05kg. We also know that the acceleration due to gravity is approximately 10 ms^(-2), as this is a constant on Earth. Step 2) The force acting on a body is calculated by multiplying its mass by the acceleration acting on it, as given by Newton's second law (Force = mass x acceleration). Thus, we apply this formula as: F = m x g. Step 3) To calculate the force during the pebble's upward motion, we plug in the given values into our equation, 0.05kg for m and 10 ms^(-2) for g. This gives us: F = 0.05 kg x 10 ms^(-2) = 0.5 N. Step 4) Note that the force is always acting downwards, meaning it is in the direction of the gravity, and this happens even when the pebble is moving upwards. Step 5) Similarly, for the downward motion of the pebble, the force continues to act downwards with the same magnitude, 0.5 N. This is because, in the absence of air resistance, the only force acting on the pebble during its flight is gravity. Step 6) If the pebble is thrown at an angle, it will now have a horizontal component of velocity in addition to the vertical component. At the highest point of the trajectory, the vertical velocity component is zero, but the horizontal component remains the same throughout the journey. However, as the force is solely due to gravity, the direction remains downwards and the magnitude stays as 0.5 N. The horizontal velocity doesn’t influence the force.",
    "Solution Outline": "Step 1) Identify the knowns: The mass of the pebble (0.05kg) and acceleration due to gravity (10 ms^(-2)). Step 2) Recall that force can be calculated by the product of mass and acceleration (F = m x g). Step 3) Apply the equation to find the force during the upward movement of the pebble. Step 4) The direction of the force is downwards. Step 5) Repeat the process for the downward motion of the pebble, noting that the force remains the same. Step 6) Discuss the pebble's trajectory when thrown at an angle, highlighting that the horizontal component of velocity doesn't affect the force."
}