{
    "Question": "2. 20. The nearest star to our solar system is 4.29 light-years away. How much is this\r\ndistance in terms of parsecs? How much parallax would this star (named Alpha\r\nCentauri) show when viewed from two locations of the Earth six months apart in its\r\norbit around the Sun? ",
    "Original Solution": "1 light year is the distance travelled by light in a year.\r\n1 light year = 3 x 10^8 x 365 x 24 x 60 x 60 = 9.46 x 10^15 m\r\nTherefore, distance travelled by light in 4.29 light years = 4.29 x 9.46 x 10^15 = 4.058 x 10^16 m\r\nParsec is also a unit of distance\r\n1 parsec = 3.08 x 10^16 m\r\nTherefore, the distance travelled by light in parsec is given as\r\n4.29 light years =4.508 x 10^16/3.80 x 10^16 = 1.318 parsec = 1.32 parsec\r\nUsing the relation,\r\nθ = d / D\r\nhere,\r\nd is the diameter of Earths orbit, d = 3 × 10^11 m\r\nD is the distance of the star from the earth, D = 405868.32 × 10^11 m\r\n∴ θ = 3 × 10^11 / 405868.32 × 10^11  =  7.39 × 10^(-6) rad\r\nBut the angle covered in 1 sec = 4.85 × 10^(–6) rad\r\n∴ 7.39 × 10^(-6) rad = 7.39 × 10^(-6) / 4.85 × 10^(-6) =  1.52″",
    "Detailed Solution": "Step 1) Understand that light travels at a constant speed of around 3 x 10^8 meters per second. Therefore, in a year, light can travel a great distance, which we call a 'light-year'. This provides us with a way to measure very large distances, such as those in space. Each light year is approximately 3 x 10^8 x 365 x 24 x 60 x 60 = 9.46 x 10^15 meters. Step 2) Calculate the distance in meters to Alpha Centauri, the nearest star to our solar system, which is 4.29 light years away. This is done by multiplying the distance in light years by the distance one light year covers, to get 4.29 x 9.46 x 10^15 = 4.058 x 10^16 meters. Step 3) Convert this distance into parsecs, another unit commonly used in astronomy. 1 parsec is equal to 3.08 x 10^16 meters. Divide the total distance in meters by this number to get the distance in parsecs. That gives us 4.058 x 10^16 m / 3.08 x 10^16 m = 1.318 parsecs, which we can round to 1.32 parsecs. Step 4) Now, let's solve for the star's parallax, which is the apparent shift in position of a nearby star when viewed from two different points in Earth's orbit six months apart. Use the equation which states that the parallax angle (θ) is equal to the diameter of Earth's orbit (d) divided by the distance to the star (D). We know that d = 3 x 10^11 m and D = 4.058 x 10^16 m, so plugging these values in gives us θ = 3 x 10^11 m / 4.058 x 10^16 m = 7.39 x 10^(-6) radians. Finally, Step 5) Convert this angle from radians to arcseconds. There are about 4.85 x 10^(–6) radians in an arcsecond, so divide the number of radians by this number to get 7.39 x 10^(-6) radians / 4.85 x 10^(–6) radians/arcsecond = 1.52 arcseconds.",
    "Solution Outline": "Step 1) Recognize that the speed of light is constant, and use this to define a 'light-year', the distance light travels in a year. Step 2) Use this definition of light-year to convert the distance to Alpha Centauri from light-years to meters. Step 3) Convert this distance from meters to parsecs, another unit for astronomical distances. Step 4) Use the known values for the diameter of Earth's orbit and the distance to the star to solve for the parallax angle using the provided formula. Step 5) Convert this angle from radians into arcseconds using a known conversion factor."
}