{
    "Question": "When a conservative force does positive work on a body, the potential energy of the body increases/decreases/remains unaltered.",
    "Original Solution": "Decreases\r\nWhen a body is displaced in the direction of the force, positive work is done on the body by the conservative force, due to which the body moves to the centre of force. Thus, the separation between the two decreases and the potential energy of the body decreases.",
    "Detailed Solution": "Step 1) We are given a scenario where a conservative force does positive work on a body. Conservative forces include gravitational force, electric force, magnetic force among others. These are forces that do not dissipate the mechanical energy of a system but can transform it among various types. Step 2) When positive work is done by the conservative force, it means that the displacement of the body is in the direction of the force. This coincides with the standard definition of work done, which is force multiplied by displacement in the direction of the force. Due to this, the body moves toward the centre of the force. Step 3) As the body moves towards the centre of force, the separation between the body and the source of the force decreases. Potential energy is often associated with forces that have a 'centre' or source, such as the gravitational potential energy between the Earth and a mass located a certain distance away from the Earth's center. Step 4) With the reducing separation, the potential energy of the body decreases. This is attributed to the nature of conservative forces where they convert the potential energy of the body into kinetic energy (the energy due to motion) thereby decreasing the potential energy.",
    "Solution Outline": "Step 1) Understand that we are given a scenario where a conservative force is doing positive work on a body. Step 2) Positive work being done implies that body is being displaced in the direction of the force, hence moving closer to the source of the force. Step 3) As body approaches the force centre, the potential energy associated with the body decreases due to the conservative nature of the force which is seen as converting potential energy to kinetic energy."
}