{
    "Question": "18. The escape speed of a projectile on the earth’s surface is 11.2 km s^–1. A body is projected out with thrice this speed. What is the speed of the body far away from the earth? Ignore the presence of the sun and other planets.",
    "Original Solution": "Given,\r\nEscape speed of the projectile on the Earth’s surface, Ve = 11.2 km/s\r\nSpeed of projection of the body, v = 3Ve = 3×11.2 = 33.6 km/s\r\nLet v and v’ be the speed of the body at the time of projection and at a point far from the earth.\r\nAt the time of projection\r\nInitial kinetic energy of the body = 1/2mv²\r\nInitial gravitational potential energy of the body = -GMem/Re\r\nMe is the mass of the Earth.\r\nRe is the radius of the Earth.\r\nAt a larger distance from the earth’s surface \r\nKE of the body = 1/2mv’^2\r\nThe gravitational potential energy of the body = 0\r\n\r\nAccording to the law of conservation of energy\r\nTotal energy at the point of projection = total energy very far from the earth’s surface\r\n1/2mv^2 + (-GMem/Re) = 1/2mv’^2\r\n1/2 mv’^2 = 1/2mv^2 – GMem/Re——–(1)\r\nIf Ve is the escape velocity, then,\r\n1/2 mVe^2 = GMem/Re ———(2)\r\n\r\nSubstituting  (2) in (1),\r\n1/2mv’^2 = 1/2mv^2 – 1/2mVe^2\r\nv’^2 = v – Ve^2\r\n= (3Ve)^2 – Ve^2\r\n= 8Ve^2\r\nv’^2 = 8Ve^2\r\nv’ = √8 x Ve\r\nv = 2 × 1.414 × 11.2 km/s\r\n= 31.68 km/s\r\nSpeed of the body far away from the earth = 31.68 km/s",
    "Detailed Solution": "Step 1) Start by noting the given information: the escape speed of a projectile from Earth is 11.2 km/s. A body is projected out at this speed times three, giving a speed of 3 x 11.2 km/s = 33.6 km/s. Step 2) Let's denote the initial speed of the body as 'v' (33.6 km/s) and the speed of the body far from Earth as 'v''. Step 3) At the time of projection, the initial kinetic energy of the body is 1/2mv^2, and the initial gravitational potential energy of the body is given as -GMem/Re, where Me is the mass of the Earth and Re is the radius of the Earth. Step 4) At a larger distance from Earth's surface, the kinetic energy of the body becomes 1/2mv''^2 and the gravitational potential energy drops to zero. Step 5) Apply the law of conservation of energy, which states that the total energy at the point of projection equals the total energy when the body is very far from Earth, i.e., 1/2mv^2 - GMem/Re = 1/2mv''^2. Step 6) If Ve is the escape velocity, then 1/2 mVe^2 = GMem/Re. Substitute this into the previous equation to get 1/2mv''^2 = 1/2mv^2 - 1/2mVe^2. Simplify to get v''^2 = v^2 - Ve^2. Step 7) Plugging in given values, we get v''^2 = (3Ve)^2 - Ve^2 = 8Ve^2. Step 8) Find v'' as v'' = √8 x Ve = 2 x √2 x Ve = 2 x 1.414 x 11.2 km/s = 31.68 km/s. Hence, the speed of the body far away from Earth is 31.68 km/s.",
    "Solution Outline": "Step 1) Identify the given escape velocity and projection speed. Step 2) Define v as the initial speed and v'' as the speed far from Earth. Step 3) Establish the initial kinetic and gravitational potential energy expressions. Step 4) Describe the kinetic and potential energy situations far from Earth. Step 5) Implement the law of conservation of energy and set up an equation. Step 6) Bring in the escape velocity equation and substitute it into the previous formula. Step 7) Plug in values to simplify the equation and solve for v''. Step 8) Calculate v'', the speed of the body far from Earth by performing a square root operation and multiplying by the escape velocity. This gives the final speed of the body as it moves far from the Earth."
}