{
    "Question": "23. A circular disc of mass 10 kg is suspended by a wire attached to its centre. The wire is twisted by rotating the disc and released. The period of torsional oscillations is found to be 1.5 s. The radius of the disc is 15 cm. Determine the torsional spring constant of the wire. (Torsional spring constant α is defined by the relation J = –α θ, where J is the restoring couple and θ the angle of twist).",
    "Original Solution": "Mass of the circular disc = 10 kg\r\nPeriod of torsional oscillation = 1.5 s\r\nRadius of the disc = 15 cm = 0.15 m\r\nRestoring couple, J = –α θ\r\nMoment of inertia, I = (1/2) mR2\r\n= (1/2) x 10 x (0.15)2\r\n= 0.1125 kgm2\r\nTime period is given by the relation\r\nSo, \\(\\begin{array}{l}\\alpha =\\frac{4\\pi^{2}I }{T^{2}}\\end{array} \\)\r\n\\(\\begin{array}{l}\\alpha = \\frac{4\\times (3.14)^{2}\\times 0.1125}{(1.5)^{2}}\\end{array} \\)\r\n= 4.44/2.25\r\n= 1.97 Nm/rad",
    "Detailed Solution": "Step 1) The problem provides us with the following known values: the mass of the circular disk (m = 10 kg), the period of torsional oscillation (T = 1.5 s), and the radius of the disc (R = 15 cm). We first convert this radius into mats (R = 0.15 m) to ensure consistency in our units. \n\nStep 2) It's stated that the restoring couple (J) is equal to -αθ, with α representing the torsional spring constant we're trying to find and θ being the angle of twist. In essence, this means that the torsion on the disk is proportional to the angle we twist it by, with the negative sign indicating the force being restorative (i.e. it pushes back against the twist). \n\nStep 3) To find α, we'll need to use the moment of inertia (I). This moment can be calculated for a circular disk as I = (1/2) mR2. We substitute the given mass and radius into this equation and find that I is equal to (1/2) x 10 x (0.15)2 = 0.1125 kgm2.\n\nStep 4) With the moment of inertia found, we can finally determine the torsional spring constant α. This is done using the provided relation for the period of torsion: α = 4π2I / T2. After substituting in the relevant values (I = 0.1125 and T = 1.5), we finally find that α is equal to 4π2 x 0.1125 / (1.5)2 = 1.97 Nm/rad.",
    "Solution Outline": "Step 1) We establish the known values of mass (m), radius (R), and period of torsional oscillation (T). \n\nStep 2) We note down the given relation J = -αθ, which describes the restoring couple (J) brought about by the twist of the disc in terms of the torsional spring constant (α) and the angle of twist (θ). \n\nStep 3) We calculate the moment of inertia (I) of the disc using the formula I = (1/2) mR2, using the given mass and converted radius values.\n\nStep 4) With the calculated I, we compute for α using the provided relation α = 4π2I / T2 which connects the period T of the torsional oscillator to α and I. The calculated α represents the desired torsional spring constant."
}