{
    "Question": "28. On a frictionless track, a trolley moves with a speed of 36 km/h with a mass of 200 Kg. A child whose mass is 20 kg runs on the trolley with a speed of 4 m s^-1 from one end to another, which is 20 m. The speed is relative to the trolley in the direction opposite to its motion. Find the final speed of the trolley and the distance the trolley moved from the time the child began to run.",
    "Original Solution": "Mass m = 200 Kg\r\nSpeed v = 36 km/h = 10 m/s\r\nMass of boy = 20 Kg\r\nInitial momentum = (M + m)v\r\n= (200 +20) x 10\r\n= 2200 kg m/s\r\nFinal velocity of boy = M\\(\\begin{array}{l}v{}'\\end{array} \\) +m(\\(\\begin{array}{l}v{}'\\end{array} \\) – 4 )\r\n= 200\\(\\begin{array}{l}v{}'\\end{array} \\) + 20\\(\\begin{array}{l}v{}'\\end{array} \\) – 80\r\n= 220\\(\\begin{array}{l}v{}'\\end{array} \\) – 80\r\nAccording to the law of conservation of energy,\r\nInitial momentum = final momentum\r\n2200 = 220\\(\\begin{array}{l}v{}'\\end{array} \\) – 80\r\nLength l = 20 m/s\r\nt = \\(\\begin{array}{l}\\frac{20}{4}\\end{array} \\) = 5 s\r\nDistance moved by the trolley = \\(\\begin{array}{l}v{}”\\end{array} \\) x t = 10.36 x 5 = 51.8 m",
    "Detailed Solution": "Step 1) Identify given values. The mass of the trolley (M) is 200 kg, its speed (v) is 36 km/h, which converts to 10 m/s for ease of calculation. The mass of the boy (m) is 20 kg. His speed relative to the trolley is 4 m/s, going in the opposite direction. The length the boy runs on the trolley is 20 m. \nStep 2) Calculate the initial momentum of the system. In this case, it is (M + m)v, or (200 kg + 20 kg) x 10 m/s, resulting in 2200 kg m/s. This represents the total momentum of the trolley plus the boy, before the boy starts to run.\nStep 3) Write an expression for the final momentum. The boy's final velocity relative to the ground is Mv' + m(v’ - 4). This means that we first add the boy's speed relative to the trolley (4 m/s) to the trolley's speed v' to get the boy's speed relative to the ground. This gives us 200v' + 20v' - 80. Thus, the final momentum is 220v' - 80.\nStep 4) Apply the law of conservation of momentum, which says that the total momentum of a system remains constant unless external forces act on it. Because the underlying surface of the trolley is frictionless, and there is no other external force mentioned, the total momentum before the boy starts running equals the total momentum after. Thus, we equate the initial momentum to the final momentum: 2200 = 220v' - 80.\nStep 5) Solve this equation for v’ to find the final speed of the trolley.\nStep 6) To find the distance the trolley moved while the boy was running, first calculate the time it took the boy to run the entire length of the trolley. Using the formula time = distance/speed, we get t = 20 m / 4 m/s = 5 s.\nStep 7) Then multiply this time by the speed of the trolley (v”), to get the distance moved. Therefore, the distance = speed x time = 10.36 m/s x 5 s = 51.8 m.",
    "Solution Outline": "Step 1) Identify the given values, including the masses and speeds of both the trolley and the boy. \nStep 2) Calculate the initial total momentum of the trolley-boy system, which is (mass of trolley + mass of boy) x speed of trolley.\nStep 3) Express the final momentum of the system in terms of the trolley's final speed (after the boy starts running), taking the boy's speed relative to the trolley into account.\nStep 4) Use the law of conservation of momentum to equate the initial and final momentum. This gives an equation in terms of the final trolley speed, v'. \nStep 5) Solve for v' to find the final speed of the trolley. \nStep 6) Calculate the amount of time it took for the boy to run the length of the trolley, using the boy's speed and the length of the trolley.\nStep 7) Multiply this time by the final speed of the trolley to find the total distance the trolley moved while the boy was running."
}