{
    "Question": "Q15.  To maintain a rotor at a uniform angular speed of 200 rad s^-1, an engine needs to transmit a torque of 180 N m. What is the power required by the engine? (Note: Uniform angular velocity in the absence of friction implies zero torque. In practice, applied torque is needed to counter frictional torque.) Assume that the engine is 100% efficient.",
    "Original Solution": "Given,\r\nThe angular speed of the rotor, ω = 200 rad/s\r\nTorque, T = 180 Nm\r\nTherefore, the power of the rotor (P)\r\nP = T ω\r\n= 200 × 180\r\n= 36.0 kW\r\nTherefore, the engine requires  36.0 kW of power.",
    "Detailed Solution": "Step 1) From the problem, we identify the given values. The angular speed of the rotor is 200 rad/s and the torque required to maintain this speed is 180 Nm. Step 2) To find the power required by the engine to maintain this torque, we will need to use the relation between power (P), torque (T), and angular speed (ω), given by the formula P = T ω. Step 3) In this formula T stands for torque and ω stands for the angular speed. To isolate the power on one side we merely state P, because it is already done for us in the equation. Step 4) Next, we will plug the known values into the equation. So that will be P = 180 Nm (the torque) times 200 rad/s (the angular speed). Step 5) We multiply the two values together, which gives us 36000. However, note that, the standard metric unit for power is watts (W), while the value we have obtained is in the order of 10^3; thus, power is conveniently expressed in kilowatts. Therefore, we convert our answer from watts to kilowatts by dividing by 1000. So, 36000 W is equal to 36.0 kW. Step 6) Hence, the power required by the engine is 36.0 kW.",
    "Solution Outline": "Step 1) Identify the known values given in the problem- The angular speed of the rotor (ω) is 200 rad/s and the torque (T) is 180 Nm. Step 2) Recognize the relationship between power (P), torque (T), and angular speed (ω), which is expressed by the equation P = T ω. Step 3) Understand that there is no need to rearrange the equation as power (P) is already isolated on one side. Step 4) Substitute the provided values for torque (T) and angular speed (ω) into the equation. Step 5) Carry out the multiplication to calculate the power in watts and then convert the result to kilowatts by dividing by 1000 for a more convenient measure. Step 6) The resultant power required by the engine is found to be 36.0 kW."
}