{
    "Question": "1: Explain why\r\n(a) The blood pressure in humans is greater at the feet than at the brain.\r\n(b) Atmospheric pressure at the height of about 6 km decreases to nearly half of its value at sea level, though the height of the atmosphere is more than 100 km.\r\n(c) Hydrostatic pressure is a scalar quantity even though the pressure is force divided by area.",
    "Original Solution": "(a). The blood column to the feet is at a greater height than the head. Thus, the blood pressure in the feet is greater than that in the brain.\r\n(b). The density of the atmosphere does not decrease linearly with the increase in altitude, in fact, most of the air molecules are close to the surface. Thus, there is this nonlinear variation of atmospheric pressure.\r\n(c). In hydrostatic pressure, the force is transmitted equally in all directions in the liquid; thus, there is no fixed direction of pressure, making it a scalar quantity.",
    "Detailed Solution": "Step 1) Understand that blood pressure varies in the body due to gravitational force. Gravity pulls the blood downwards, causing enhanced pressure at locations lower than the heart. When you stand up, the blood column to your feet is greater in height than the blood column to your brain. This height difference creates a pressure variation. Thus, the blood pressure in your feet is greater than that in your brain. \n\nStep 2) For part (b), first recall the properties of the Earth's atmosphere. The Earth's atmosphere is highly dense near the surface and the density of the atmosphere decreases with an increase in altitude. This means that the majority of air molecules are found closer to the Earth's surface. It's also important to note that atmospheric pressure is directly proportional to the density of the air molecules present. Since the density does not decrease linearly with the increase in altitude, there is also a nonlinear decrease in the atmospheric pressure. Hence, at a height of about 6 km, the atmospheric pressure decreases to nearly half of its value at sea level despite the height of the atmosphere being more than 100 km.\n\nStep 3) For part (c), remember what hydrostatic pressure refers to. Hydrostatic pressure is the pressure exerted by a fluid at rest due to the force of gravity. It's worth noting that pressure is defined as force per unit area. Despite this definition, hydrostatic pressure is still classified as a scalar quantity and not a vector quantity. This is because in a fluid at rest, the pressure force is transmitted equally in every direction. Thus, there is no specific direction for the pressure force; this lack of a fixed direction is essentially what makes hydrostatic pressure a scalar quantity.",
    "Solution Outline": "Step 1) Understand the concept that blood pressure in humans varies based on the height of the blood column in relation to the position of the heart. This height variation is caused by the effects of gravity, resulting in higher pressure at the feet than at the brain.\n\nStep 2) Recall the characteristics of Earth's atmosphere in relation to part (b). Atmospheric pressure decreases nonlinearly with an increase in altitude due to the highly dense nature of the atmosphere at Earth's surface. This results in the atmosphere's pressure being half its value at about 6 km altitude, despite the atmosphere's total height being over 100 km.\n\nStep 3) Understand hydrostatic pressure for part (c). Despite the fact that pressure is defined as force per unit area, hydrostatic pressure is actually a scalar quantity. This is due to the pressure force in a fluid at rest being distributed equally in all directions, meaning that it has no specific direction, resulting in the pressure being classified as a scalar quantity."
}