{
    "Question": "3. Give the magnitude and direction of the net force acting on a stone of mass 0.1 kg,\r\n(a) just after it is dropped from the window of a stationary train\r\n(b) just after it is dropped from the window of a train running at a constant velocity of 36 km/h\r\n(c) just after it is dropped from the window of a train accelerating with1 m s^(-2)\r\n(d) lying on the floor of a train which is accelerating with 1 m s^(-2), the stone being at rest relative to the train. Neglect air resistance throughout.",
    "Original Solution": "(a) Mass of stone = 0.1 kg\r\nAcceleration = 10 ms^(-2)\r\nNet force, F = mg = 0.1 x 10 = 1.0 N\r\nThe force acts vertically downwards\r\n(b) The train moves at a constant velocity. Therefore, the acceleration will be equal to zero. So there is no force acting on the stone due to the motion of the train. Therefore, the force acting on the stone will remain the same (1.0 N)\r\n(c) When the train accelerates at 1m/s2, the stone experiences an additional force of F’ = ma = 0.1 x 1 = 0.1 N. The force acts in the horizontal direction.\r\nBut as the stone is dropped, the force F’ no longer acts and the net force acting on the stone F = mg = 0.1 x 10 = 1.0 N. (vertically downwards).\r\n(d) As the stone is lying on the train floor, its acceleration will be the same as that of the train.\r\nTherefore, the magnitude of the force acting on the stone, F = ma = 0.1 x 1 = 0.1 N.\r\nIt acts along the direction of motion of the train.",
    "Detailed Solution": "Step 1) Note down the mass of the stone which is given as 0.1 kg. This is the known quantity provided by the problem. Step 2) For part (a), identify the acceleration due to gravity which is typically 10 m/s^2. This normal force means that there is a 'pull' towards the center of the earth. Step 3) Use the formula for calculating force F = mg. Replacing m and g with 0.1 kg and 10 m/s^2 respectively, to obtain F=1.0 N. This is the net force on the stone acting in the downward direction since gravity acts vertically downwards. Step 4) For part (b), understand that the train is moving at a constant velocity, which means the acceleration is zero. As the train doesn't accelerate, there is no force acting on the stone due to the train's motion. Consequently, the only force is the same gravitational force calculated in part (a) which is 1.0 N. Step 5) For part (c), when the train accelerates at 1 m/s^2, an additional force acts on the stone. This is calculated using the same force formula F=ma, where m is the same 0.1 kg, and 'a' is the train's acceleration of 1 m/s^2. Therefore, F' = 0.1 N is acting horizontally. However, once the stone is dropped, this force no longer applies, and the net force acting on the stone is again F = 1.0 N downwards. Step 6) Finally, for part (d), when the stone is on the train floor, the stone's acceleration will be the same as that of the train. Therefore, the force acting on the stone will be F = ma = 0.1 x 1 = 0.1 N, acting in the direction of the train's motion.",
    "Solution Outline": "Step 1) Identify the given mass of the stone. Step 2) In part (a), calculate the force on the stone due to gravity using the formula F = mg and find it is 1.0 N. This force acts downwards. Step 3) For part (b), observe that the train's constant velocity means no additional force from the train's motion acts upon the stone; the net force remains the 1.0 N downward from gravity. Step 4) In part (c), note that when the train accelerates, the stone experiences an additional horizontal force, but this force ceases when the stone is dropped; gravity again provides the net force of 1.0 N downwards. Step 5) For part (d), understand that when the stone lies on the train's floor, it has the same acceleration as the train, and hence a net force of 0.1 N in the direction of the train's motion."
}