{
    "Question": "17: A rocket is fired vertically with a speed of 5 km /s from the earth’s surface. How far from the earth does the rocket go before returning to the earth? Mass of the earth = 6.0 × 10^24 kg; mean radius of the earth = 6.4 × 10^6 m; G = 6.67 × 10^(–11) N m^2 kg^(–2) \r\n",
    "Original Solution": "Given:\r\nVelocity of the missile,  v = 5 km/s = 5 × 103 m/s\r\nMass of the Earth, ME = 6 × 1024 kg\r\nRadius of the Earth, RE = 6.4 × 10^6 m\r\nLet the height reached by the missile be ‘h’ and the mass of the missile be ‘m’.\r\nNow, at the surface of the Earth\r\nThe total energy of the rocket at the surface of the Earth = Kinetic energy + Potential energy\r\nTE1 = \\(\\begin{array}{l}\\frac{1}{2}mv^{2}+\\frac{-GM_{E}\\;m}{R_{E}}\\end{array} \\)\r\n\r\nNow, at the highest point, ‘h’\r\nKinetic Energy = 0   [Since, v = 0]\r\nAnd, Potential energy = \\(\\begin{array}{l}\\frac{-GM_{E}\\;m}{R_{E}+h}\\end{array} \\)\r\n\r\nTherefore, the total energy of the missile at the highest point ‘h’\r\nTE2 = 0 + \\(\\begin{array}{l}\\frac{-GM_{E}\\;m}{R_{E}+h}\\end{array} \\)\r\n\\(\\begin{array}{l}\\Rightarrow\\end{array} \\) TE2 = \\(\\begin{array}{l}\\frac{-GM_{E}\\;m}{R_{E}+h}\\end{array} \\)\r\n\r\nAccording to the law of conservation of energy, we have\r\nTotal energy of the rocket at the Earth’s surface TE1 = Total energy at height ‘h’ TE2\r\n\\(\\begin{array}{l}\\Rightarrow \\frac{1}{2}mv^{2}+\\frac{-GM_{E}\\;m}{R_{E}}=\\frac{-GM_{E}\\;m}{R_{E}+h}\\\\ \\Rightarrow \\frac{1}{2}v^{2}+\\frac{-GM_{E}}{R_{E}}=\\frac{-GM_{E}}{R_{E}+h}\\\\ \\Rightarrow v^{2} = 2GM_{E}\\times \\left [ \\frac{1}{R_{E}}-\\frac{1}{(R_{E}+h)} \\right ]=2GM_{E}\\left [ \\frac{h}{(R_{E}+h)R_{E}} \\right ]\\end{array} \\)\r\n\r\nv2 = GMEh/(RE)^2 +REh\r\nWhere, \\(\\begin{array}{l}\\\\g=\\frac{GM}{R_{E}^{2}}\\end{array} \\) = 9.8 ms^(-2)\r\nV2 = 2g(RE)^2h/(RE)^2+REh\r\n\\(\\begin{array}{l}\\Rightarrow v^{2}=\\frac{2g\\;R_{E}\\;h}{R_{E}+h}\\end{array} \\)\r\n\r\nTherefore, v2 (RE + h) = 2gREh\r\n\\(\\begin{array}{l}\\\\\\Rightarrow\\end{array} \\) v2RE = h (2gRE – v2)\r\nNow, the distance from the center of the earth = h + RE = 1.6 × 10^6 + 6.4 x 10^6 = 8.0  x10^6 m\r\nTherefore, the greatest height the missile can attain before falling back to the earth is 1.6 × 10^6   m, and the final distance of the missile from the centre of the earth is 8.0  x10^6 m.",
    "Detailed Solution": "Step 1) To begin, we are given the velocity of the rocket, v = 5 km/s, which we convert to 5000 m/s to keep our units consistent. The mass and radius of the Earth are given as ME = 6 x 10^24 kg and RE = 6.4 x 10^6 m, respectively. We are looking for the height 'h' the rocket will reach. Step 2) Using principles of mechanics, we know that the rocket's total energy when launched from the Earth's surface is the sum of its kinetic energy and potential energy. This can be calculated with the equation TE1 = 0.5 * m * v^2 - G * ME * m / RE. Step 3) When the rocket reaches its highest point, 'h', it comes to a temporary stop and its kinetic energy is zero. Its potential energy at this point is - G * ME * m / (RE + h). Therefore, the total energy of the missile at this point, TE2, is equal to this potential energy. Step 4) According to the law of conservation of energy, TE1 equals TE2. This lets us set up the equation 0.5 * v^2 - G * ME / RE = - G * ME / (RE + h). We can solve this for 'h'. Step 5) After algebraic simplification, we find that the height reached by the rocket, h, is equal to v^2 * RE / (2 * g * RE - v^2), where g is the acceleration due to gravity and can be calculated as G * ME / (RE^2). After substituting the values, we find h = 1.6 x 10^6 m. Step 6) Now we add h to the radius of the Earth to find the total distance the rocket travels from the center of the Earth, which gives us 1.6 x 10^6 + 6.4 x 10^6 = 8.0 x 10^6 m. Hence the rocket travels 8.0 x 10^6 m before returning to the Earth.",
    "Solution Outline": "Step 1) We are given the velocity, mass, and radius of the Earth and are interested in the height the rocket reaches. Step 2) The rocket's total energy at the Earth's surface is calculated by adding its kinetic and potential energy. Step 3) At the rocket's highest point, its kinetic energy is zero and its total energy is equal to its potential energy. Step 4) The law of conservation of energy states that the rocket's total energy remains constant, allowing us to equate the energy at the Earth's surface and at the rocket's highest point and solve for 'h'. Step 5) Through simplification and substitution, we find that 'h' equals 1.6 x 10^6 m. Step 6) Adding 'h' to the radius of the Earth gives us the total distance the rocket travels from the center of the Earth, which is 8.0 x 10^6 m."
}