{
    "Question": "Q3. A child sits stationary at one end of a long trolley, moving uniformly with a speed V on a smooth horizontal floor. If the child gets up and runs about on the trolley in any manner, what is the speed of the CM of the (trolley + child) system?",
    "Original Solution": "The child and the trolley constitute a single system, and the child moving inside the trolley is a purely internal motion. Since there is no external force on the system, the velocity of the centre of mass of the system will not change.",
    "Detailed Solution": "Step 1) First, consider the whole system, which includes both the child and the trolley. These two entities together form a connected system that we are interested in studying. In physics, we often deal with such systems to simplify the problem. Here, the child sitting or running on the trolley doesn't impact anyone or anything outside of this system, meaning we can study the child and the trolley as a single object. Step 2) Within the system, any motion of the child is considered internal motion. This is because any action the child does, whether sitting stationary or running in any manner, only matters within our chosen system. The movement does not affect the things outside of the system. Hence, the movement of the child is purely internal. Step 3) Recall Newton's first law of motion – an object in motion stays in motion with the same speed and in the same direction unless acted upon by an unbalanced force. There is no external force acting on the (child + trolley) system here. Step 4) Consequently, the velocity of the center of mass (CM) of our (child + trolley) system will not change. This is a direct consequence of no external force on the system. We can imagine, for example, that as the child moves forward on the trolley, the trolley in response moves a little in the other direction to maintain the same center of mass overall. This ensures that the center of mass of the system (child + trolley) maintains the same velocity V as before. Therefore, the speed of the CM of the (trolley + child) system remains the same, no matter how the child moves on the trolley.",
    "Solution Outline": "Step 1) Understand that the child and the trolley together form a system. Step 2) The child's movement on the trolley is internal to this system, having no effect on anything outside of it. Step 3) There is no external force applied to this system, following from Newton's first law. Step 4) As a result, the center of mass of this system retains its original speed irrespective of the child's movement on the trolley."
}