{
    "Question": "4: Io, one of the satellites of Jupiter, has an orbital period of 1.769 days, and the radius of the orbit is 4.22 × 10^8 m. Show that the mass of Jupiter is about one-thousandth that of the sun.",
    "Original Solution": "Given,\r\nOrbital period of Io, TI0 = 1.769 days  =  1.769 × 24 × 60 × 60 s\r\nOrbital radius of Io, RI0 = 4.22 × 108 m\r\nWe know the mass of Jupiter\r\nMJ = 4π^2(RI0)^3 / G(TI0)^2    . . . . . . . . . . . . . . . (1)\r\nWhere;\r\nMJ = Mass of Jupiter\r\nG = Universal gravitational constant\r\nAlso,\r\nThe orbital period of the earth\r\nTE = 365.25 days = 365.25 × 24 × 60 × 60 s\r\nThe orbital radius of the earth, RE = 1 AU = 1.496 × 1011 m\r\nWe know that the mass of the sun is\r\nMS = \\(\\begin{array}{l}\\frac{4\\;\\pi ^{2}\\;R_{E}^{3}}{G\\;T_{E}^{2}}\\end{array} \\). . . . . . . . . . . . .  (2)\r\nTherefore,  \\(\\begin{array}{l}\\\\\\frac{M_{S}}{M_{J}}\\end{array} \\) = \\(\\begin{array}{l}\\frac{4\\;\\pi ^{2}\\;R_{E}^{3}}{G\\;T_{E}^{2}}\\;\\times \\;\\frac{G\\;T_{10}^{2}}{4\\;\\pi ^{2}\\;R_{10}^{3}}\\\\\\end{array} \\) = \\(\\begin{array}{l}\\frac{R_{E}^{3}}{T_{E}^{2}}\\;\\times \\;\\frac{T_{10}^{2}}{R_{10}^{3}}\\end{array} \\)\r\n\r\nNow, on substituting the values, we will get\r\n= \\(\\begin{array}{l}\\left [ \\frac{1.769\\times 24\\times 60\\times 60}{365.25\\times 24\\times 60\\times 60} \\right ]^{2}\\times \\left [ \\frac{1.496\\times 10^{11}}{4.22\\times 10^{8}} \\right ]^{3}\\end{array} \\) = 1045.04\r\nTherefore, \\(\\begin{array}{l}\\frac{M_{S}}{M_{J}}\\end{array} \\) ~ 1000\r\nMS ~ 1000 × MJ      ",
    "Detailed Solution": "Step 1) Identify what's given: the orbital period of Io is 1.769 days (which is converted to seconds by multiplying by 24 hours/day, 60 minutes/hour, and 60 seconds/minute) and its radius of orbit is 4.22 × 10^8 meters. Step 2) Note that the mass of any celestial body can be found using the equation MJ = 4π^2(RI0)^3 / G(TI0)^2 where G is the universal gravitational constant and T is the orbital period. This is an application of Kepler's Third Law of planetary motion which relates the orbit's semi-major axis to its period. Step 3) The given problem asks to compare Jupiter's mass to the mass of the Sun. So, you need to also use the equation for the mass of the Sun, MS = 4π^2(RE)^3 / G(TE)^2, where RE is Earth's orbital radius and TE is Earth's orbital period. This equation also stems from Kepler's Third Law. Step 4) To compare the two masses, use the equation MS/MJ = (RE/RI0)³ * (TI0/TE)². This equation is derived by dividing the formula for the mass of the Sun by the formula for the mass of Jupiter, cancelling similar terms and rearranging them. This equation gives the ratio of the masses. Step 5) Substitute the values into the formula to find the ratio of the Sun's mass to Jupiter's mass: [1.769 * 24 * 60 * 60 / 365.25 * 24 * 60 * 60]² * [1.496 × 10^11 / 4.22 × 10^8]³. Here, we are substituting the given values and the known constants into our equation. Step 6) The value obtained is approximately 1045, which rounds down to 1000. So, the mass of the Sun is about 1000 times the mass of Jupiter.",
    "Solution Outline": "Step 1) Identify the given orbital period and radius of Io. Step 2) Use Kepler's Third Law of Planetary motion to formulate the equation determining Jupiter's Mass. Step 3) Formulate another equation to determine the Sun's mass using Earth's radius and period from Kepler's Law again. Step 4) Create an equation to compare the two masses by using these two equations. Step 5) Substitute the given values and known constants into this equation to find the ratio of the masses of Sun and Jupiter.  Step 6) The calculated result is approximately 1000, indicating that the Sun's mass is approximately 1000 times that of Jupiter."
}