{
    "Question": "Q.8. A hole is drilled in a copper sheet. The diameter of the hole is 4.24 cm at 27.0 C. What is the change in the diameter of the hole when the sheet is heated to 227 C? Coefficient of linear expansion of copper = 1.70 × 10^(–5) K^(–1).\r\n",
    "Original Solution": "The diameter of hole ( D1) = 4.24 cm\r\nThe initial temperature, T1 = 27.0 C = 27+ 273 = 300 K\r\nThe final temperature, T2 =227 C = 227+ 273 = 500K\r\nLet the diameter of the hole at the final temperature be D2\r\nThe coefficient of linear expansion of copper, α= 1.70 × 10^(–5) K^(–1)\r\nthe initial area of hole (Ao)= πr^2 =π ( 4.24/2)^2\r\n\r\nCoefficient of superficial expansion (β) = 2× Coefficient of linear expansion of copper (α)= 2 × 1.7 × 10^(-5) = 3.4 × 10^(-5) \r\n\r\nUsing the formula,\r\nA = Ao( 1 + β∆T)\r\nA = π ( 4.24/2)^2 x [1 + 3.4 × 10^(-5) × (500-300)] = π ( 4.24/2)^2 x [ 1 + 3.4 × 10^(-5) × 200] = π ( 4.24/2)^2 x [ 1 + 6.8 × 10^(-3) ] = π ( 4.24/2)^2 x [ 1 + 0.0068] =  π ( 4.24/2)^2 x (1.0068)\r\nπ(D2)^2/4 = π ( 4.24/2)^2 ( 1.0068 )\r\n(D2)^2= 17.97 (1.0068)\r\n\r\n(D2)^2=  18.092\r\n= 4.253\r\nD2 = 4.253 cm\r\nChange in diameter (∆D) = D2 – D1\r\n= 4.253 – 4.24\r\n= 0.013 cm",
    "Detailed Solution": "Step 1) Extract the known quantities from the problem. The initial diameter of the hole (D1) in the copper sheet was given as 4.24 cm and the initial temperature (T1) was 27.0 C. The temperature was heated to a final temperature (T2) of 227 C. Additionally, we are given the coefficient of linear expansion for copper (α) as 1.70 × 10^(-5) K^(-1). Step 2) Convert the temperatures from Celsius to Kelvin. Add 273 to each temperature to ensure accurate calculations in the following steps. T1 will be 300 K and T2 will be 500 K. Step 3) Calculate the area for the initial hole (Ao) using the formula for the area of a circle, πr^2 = π(D1/2)^2. Step 4) Compute the value for the coefficient of superficial expansion (β) by multiplying the coefficient of linear expansion by 2.  Step 5) Plug the known quantities (Ao, β, and the change in temperature (ΔT=500-300=200 K)) into the formula which measures change in area due to temperature (A = Ao( 1 + βΔT)). This calculation will yield the final area (A). Step 6) Solve for the final diameter (D2) by rearranging the terms of the formula for the area of a circle. Compare the area of the hole at T2, π(D2)^2/4 to the area of the hole at T1, π(D1/2)^2, multiplied by the factor (1+βΔT). Simplify to isolate D2. Step 7) Compute the numerical change in diameter between the initial size and final size, ΔD = D2 - D1, which is found to be 0.013 cm.",
    "Solution Outline": "Step 1) Identify initial diameter (D1), initial temperature (T1), final temperature (T2), and the coefficient of linear expansion for copper (α). Step 2) Convert the temperatures from Celsius to Kelvin. Step 3) Calculate the area for the initial hole (Ao). Step 4) Multiply the coefficient of linear expansion (α) by 2 to find the coefficient of superficial expansion (β). Step 5) Use the formula for surface area growth due to heat to find the final area (A) by plugging in Ao, β and change in temperature (ΔT). Step 6) Rearrange the formula of area= πr^2 to solve for the final diameter (D2). Step 7) Finally compute the change in diameter (ΔD) using the formula, ΔD = D2 - D1."
}