{
    "Question": "Q11. A 14.5 kg mass, fastened to the end of a steel wire of unstretched length 1.0 m, is whirled in a vertical circle with an angular velocity of 2 rev/s at the bottom of the circle. The cross-sectional area of the wire is 0.065 cm^2. Calculate the elongation of the wire when the mass is at the lowest point of its path.",
    "Original Solution": "Mass, m = 14.5 kg\r\nLength of the steel wire, l = 1 m\r\nAngular velocity, v = 2 rev/s\r\nCross-sectional area of the wire, A = 0.065 x 10^(-4) m^2\r\nTotal pulling force on the steel wire when the mass is at the lowest point of the vertical circle, F = mg + mr ω^2\r\n= 14.5×9.8+14.5×1×(12.56)^2\r\n=2429.53 N\r\nYoung’s modulus = Stress / Strain\r\n\\(\\begin{array}{l}Y=\\frac{F}{A}\\frac{l}{\\Delta l}\\end{array} \\)\r\n\r\n \r\nΔl=(2429.53×1)/(0.065×10^(−4)) × (2×10^11) = 1.87×10^(−3)m\r\nHence, the elongation of the wire when the mass is at the lowest is 1.87×10^(−3)m.",
    "Detailed Solution": "Step 1) Identify the known values: We know the mass (m) is 14.5 kg, the length of the steel wire (l) is 1 m, the angular velocity (v) is 2 rev/s, and the cross-sectional area of the wire (A) is 0.065 x 10^(-4) m^2. All these are given in the problem's text. Step 2) Determine the total pulling force (F) on the steel wire when the mass is at the lowest point of the vertical circle. This consists of the force due to gravity (mg) and the centripetal force due to the mass whirling in a circle (mr ω^2). We use the equation F = mg + mr ω^2 to calculate this. We then substitute the given values into our equation, and find that F = 14.5×9.8+14.5×1×(12.56)^2 = 2429.53 N. This force is the combined effect of the weight of the mass and the centripetal force acting on it. Step 3) Use Young’s modulus equation, which is the ratio of Stress / Strain, to figure out the elongation of the wire. Rearranging the Young's Modulus equation, we find that Δl=(F/A)*(1/Y)*l. Since we want to find Δl (ethe elongation of the wire), we plug in our known values: Δl=(2429.53×1)/(0.065×10^(−4)) × (2×10^11), which simplifies to an elongation of 1.87×10^(−3)m. This represents the additional length the wire has stretched due to the combined forces acting on the mass at the bottom of its path.",
    "Solution Outline": "Step 1) Identify known values including the mass of the object, the original length of the wire, the angular velocity of the object, and the cross-sectional area of the wire. Step 2) Calculate the total pulling force on the wire when the mass is at the base of its arc by considering both gravity and centripetal force with the equation F = mg + mr ω^2. Step 3) Determine the elongation of the wire by rearranging the Young's Modulus formula, which describes stress and strain, and solving for Δl, the change in length. Substitute the calculated force and known values into this formula to find the elongation."
}