{
    "Question": "Q8. A transverse harmonic wave on a wire is expressed as:\r\ny( x, t ) = 3 sin ( 36t +0.018x +π/4 ).\r\n(i) Is it a stationary wave or a travelling one?\r\n(ii) If it is a travelling wave, give the speed and direction of its propagation.\r\n(iii) Find its frequency and amplitude.\r\n(iv) Give the initial phase at the origin.\r\n(v) Calculate the smallest distance between two adjacent crests in the wave.\r\n[X and y are in cm and t in seconds. Assume the left to the right direction as the positive direction of x]",
    "Original Solution": "Given,\r\ny(x, t) =3 sin (36t +0.018x + π/4)                 . . . . . . . . .  . . ( 1 )\r\n(i) We know the equation of a progressive wave travelling from right to left is:\r\ny (x, t) = a sin (ωt + kx + Φ)         . . . . . . . . . . . . . . . . . . .  ( 2 )\r\nComparing equation (1) to equation (2), we see that it represents a wave travelling from right to left and also we get:\r\na = 3 cm,  ω = 36 rad/s , k = 0.018 cm and ϕ = π/4.\r\n(ii) Therefore, the speed of propagation, v = ω/k = 36/ 0.018 = 20 m/s.\r\n(iii) Amplitude of the wave, a = 3 cm\r\nFrequency of the wave v = ω / 2π\r\n= 36 /2π = 5.7 hz.\r\n(iv) Initial phase at the origin = π/4\r\n(v) The smallest  distance between two adjacent crests in the wave, λ = 2π/ k = 2π / 0.018\r\n= 349 cm.",
    "Detailed Solution": "Step 1) The first step is to recognise the given wave equation. We have a given wave equation y(x, t) = 3 sin (36t +0.018x +π/4). This equation represents a wave where the displacement y depends on both position x and time t. Moreover, this displacement y is expressed in terms of a sine function, which most wave motions follow.\n\nStep 2) To determine if the wave is stationary or traveling, we need to recognize the structure of the equations typically used to represent both types. A progressive or traveling wave that moves from right to left has the general form y(x, t) = a sin (ωt + kx + Φ), which turns out to match the form of our given equation. Therefore, we can conclude that this wave is a traveling wave moving from right to left.\n\nStep 3) To find the wave speed and direction, we first note that the wave is moving from right to left, given by the positive coefficient of x in the sine function. Now, we identify the terms in the given equation that correspond to the angular frequency ω and the wave number k. The wave speed v is then calculated by the formula v = ω/k. Substituting the values ω = 36 rad/s and k = 0.018 cm/s, we obtain the speed v = 36/0.018 = 20 m/s. Note that we needed to convert the units from cm/s to m/s.\n\nStep 4) The amplitude and frequency of the wave can be determined directly from the given wave equation. The amplitude corresponds to the coefficient of the sine function, hence a = 3 cm. The frequency is given by the formula v = ω / 2π. By substituting our earlier found value for ω, we get the frequency = 36/2π = 5.7 hz.\n\nStep 5) The initial phase at the origin is the constant term added in the sine function in our wave equation. Hence, it is given directly by ϕ = π/4.\n\nStep 6) The smallest distance between two consecutive crests in the wave, known as the wavelength λ, is computed using the equation λ = 2π / k. Substituting the value of k from the wave equation, we get λ = 2π / 0.018=349 cm.",
    "Solution Outline": "Step 1) Recognize the given wave equation y(x, t) = 3 sin (36t +0.018x +π/4).\nStep 2) Compare the given wave equation to the general equation of a traveling wave moving from right to left, and confirm that it matches in form, meaning the wave is indeed a traveling wave.\nStep 3) By noting the positive coefficient of x, we realize the wave is moving in the negative direction (from right to left). Calculate the wave speed using the formula v = ω/k, substituting ω and k from the wave equation.\nStep 4) Get the amplitude from the coefficient of the wave equation and calculate the frequency of the wave using the formula v = ω / 2π.\nStep 5) Identify the constant term added in the sine function in the wave equation as the initial phase at the origin.\nStep 6) Calculate the smallest distance between adjacent crests, or the wavelength λ, using the equation λ = 2π/k."
}