{
    "Question": "30. An aircraft executes a horizontal loop at a speed of 720 km/h with its wings banked at 15°. What is the radius of the loop?",
    "Original Solution": "The speed of the aircraft executing the horizontal loop = 720 km/h = 720 x (5/18) = 200 m/s\r\nThe angle of banking = 15°\r\ntanθ= v2/rg , we have\r\nr = v2/g(tanθ) = (200 x 200)/(10 x tan 150) = (200 x 200)/ (10 x 0.2679)= 14931 m",
    "Detailed Solution": "Step 1) We are given the speed of the aircraft as 720 km/h, the angle of banking as 15°, and we need to find the radius of the horizontal loop it executes. For any object in a circular motion, the speed, radius, and gravitational force obey a certain relationship, which will be used to solve this problem. Step 2) Due to the unit we need our answer in, we must first convert the speed from km/h to m/s. We do this using the conversion factor of 5/18. This gives us 720*(5/18) = 200 m/s. Step 3) Next, we need to apply the formula that relates the speed of the object, angle of banking and the radius. This formula is tanθ= v2/rg where θ is the angle of banking, v is the speed of the object, r is the radius (what we're trying to find), and g is the acceleration due to gravity (which we know to be roughly 9.8 m/s^2 but is simplified to 10 m/s^2 for this problem). Step 4) We can rearrange this formula to find an expression for the radius. This gives us r= v2/g(tanθ). Step 5) Lastly, inputting the known values gives us (200*200)/ (10*tan 15°). Taking the tan of 15° gives us 0.2679, which plugs into the calculation to give us (200*200) / (10*0.2679), yielding a radius of almost 14931 meters. So, the aircraft executes a horizontal loop of nearly 14931 meters in radius.",
    "Solution Outline": "Step 1) Start by noting down the given values, that is the speed of the aircraft and the angle of banking and realize the need to find the radius of the loop the aircraft makes. Keep in mind an important formula for circular motion which relates speed, radius, gravitational force, and banking angle. Step 2) Convert the speed of the aircraft from km/h to m/s by using the relevant conversion factor. Step 3) Make use of the formula tanθ= v2/rg for objects in circular motion with banking, where θ is the banking angle, v the speed, r the radius, and g the gravitational acceleration. Step 4) Rearrange the formula to solve for the radius: r= v2/g(tanθ). Step 5) Substitute the known values into the formula and compute the result, which is the radius, approximately 14931 meters."
}