{
    "Question": "Q24. A bullet of mass 10 g and speed 500 m/s is fired into a door and gets embedded exactly at the centre of the door. The door is 1.0 m wide and weighs 12 kg. It is hinged at one end and rotates about a vertical axis practically without friction. Find the angular speed of the door just after the bullet embeds into it.\r\n(Hint: The moment of inertia of the door about the vertical axis at one end is ML2/3.)",
    "Original Solution": "Given, Velocity,v= 500 m/s\r\nMass of bullet, m = 10 g = 10 × 10^(–3) kg\r\nWidth of the door, L = 1 m\r\nRadius of the door, r = 1 / 2\r\nMass of the door, M = 10 kg\r\nAngular momentum imparted by the bullet on the door\r\nα = mvr\r\n= (10× 10^(-3) ) × (500) × (1/2)  =  2.5 kg m^2 s^(-1)    …(i)\r\nNow, the moment of inertia of the door\r\nI = (ML^2) / 3\r\n= (1/3) × 12× 12 = 4 kgm^2\r\nWe know α = Iω\r\n∴ ω = α / I\r\n= 2.5/ 4 = 0.625  rad /s",
    "Detailed Solution": "Step 1) Let's list down the known values from the problem. The velocity of the bullet (v) is 500 m/s, its mass (m) is 10 g which is equivalent to 10 × 10^(–3) kg, the width of the door (L) is 1 m and the mass of the door (M) is 10 kg. \n\nStep 2) We're trying to find the angular speed of the door just after the bullet embeds in it. In order to do that, we need to understand a few fundamental concepts in physics. The angular momentum (α) can be calculated by the product of mass, velocity, and the radius from the center of rotation (r). The radius here is the distance from where the bullet strikes to the axis of rotation, which is half of the door's width. So, r = L / 2.\n\nStep 3) Calculating the angular momentum imparted by the bullet on the door using the formula α = mvr, we get 2.5 kg m^2 s^(-1).\n\nStep 4) Next, using the moment of inertia of the door that is given by the formula I = (ML^2) / 3, we get 4 kgm^2. This equation is essential because it relates the angular momentum, moment of inertia, and angular velocity. The moment of inertia is a measure of the resistance of the door to rotational motion about the hinge point.\n\nStep 5) We know from the principle of conservation of angular momentum that the initial angular momentum of the door-bullet system (just after the bullet embeds into the door) equals the final angular momentum. Thus, equating the angular momentum imparted by the bullet on the door (α) to Iω and isolating ω, we get ω = α / I.\n\nStep 6) Finally, substituting α and I into that equation, we find the angular speed of the door ω to be 0.625 rad/s. This means that just after the bullet embeds into the door, the door is rotating about its axis at a speed of 0.625 radians per second.",
    "Solution Outline": "Step 1) Identify and record all known parameters from the problem.\n\nStep 2) Remember that angular momentum is equal to mass times velocity times radius from the center of rotation. Here, the radius is half of the width of the door.\n\nStep 3) Calculate the angular momentum imparted by the bullet on the door using the parameters from step 2.\n\nStep 4) Find the moment of inertia of the door using the given formula. The moment of inertia is a measure of the door's resistance to changes to its rotation.\n\nStep 5) Use the conservation of angular momentum to set up the equation for angular speed ω, which equals the angular momentum divided by the moment of inertia.\n\nStep 6) Substitute the values found in the previous steps to find the angular speed of the door right after the bullet embeds into it."
}