{
    "Question": "5. Let us assume that our galaxy consists of 2.5 × 10^11 stars, each of one solar mass. How long will a star at a distance of 50,000 ly from the galactic centre take to complete one revolution? Take the diameter of the Milky Way to be 105ly.  ",
    "Original Solution": "Mass of our galaxy, M=2.5×10^11 solar mass\r\n1 Solar mass = Mass of Sun =2×10^30 kg\r\nMass of our galaxy, M=2.5×10^11×2×10^30=5×10^41kg\r\nDiameter of Milky Way,d=10^5 ly\r\nRadius of Milky Way,r=5×10^4 ly\r\n1 ly=9.46×10^15m\r\nTherefore, r=5×10^4×9.46×10^15=4.73×10^20m\r\nThe time taken by the star to revolve around the galactic centre is given by the relation\r\nT=(4π^2r^3/GM)^(1/2)\r\n= \\(\\begin{array}{l}\\sqrt{\\frac{4\\times (3.14)^{2}\\times (4.73)^{3}\\times 10^{60}}{6.67\\times 10^{-11}\\times 5\\times 10^{41}}}\\end{array} \\)\r\n= 1.12 x 10^16 s\r\n= \\(\\begin{array}{l}\\frac{1.12\\times 10^{16}}{365\\times 24\\times 60\\times 60}\\, years\\end{array} \\)\r\n= 3.55 x 10^8 years",
    "Detailed Solution": "Step 1) The first phase of the problem involves stating the given facts. The mass of our galaxy is given as 2.5 x 10^11 solar mass, and each solar mass equates to 2 x 10^30 kg. This allows us to determine the total mass of the galaxy, M, by multiplying the number of stars in the galaxy by the mass of each star: M=2.5×10^11×2×10^30=5×10^41kg. \n\nStep 2) We also know that the diameter of the Milky Way galaxy is 10^5 light years (ly), and since radius is half the diameter, we can calculate our radius as r=5×10^4 ly. \n\nStep 3) Since we'll be using the gravitational constant, G, the distance needs to be in meters. Here, one light year is equal to 9.46 x 10^15 meters. We can convert this radius from light years to meters by multiplying the light years by this conversion factor: r=5×10^4×9.46×10^15=4.73×10^20m.\n\nStep 4) To calculate the time taken by a star to revolve around the galactic center, we use Kepler's third law of planetary motion, which states that the square of the period of revolution (T) equals the cube of the mean distance (r) divided by the mass (M) and multiplied by the gravitational constant (G). The formula for this law can be written as T=(4π^2r^3/GM)^(1/2). \n\nStep 5) Substituting the above calculated values into our timing formula, we get T= sqrt((4 * π^2 * (4.73)^3 * 10^60) / (6.67 * 10^-11 * 5 * 10^41)) = 1.12 x 10^16 seconds.\n\nStep 6) Finally, as the convention for astronomical timings is in years, we convert seconds into years by dividing by the number of seconds in a year (365 days, 24 hours, 60 minutes, and 60 seconds). Therefore, the time taken by the star to revolve around the galactic center is T=1.12×10^16/ (365 * 24 * 60 * 60) = 3.55 x 10^8 years.",
    "Solution Outline": "Step 1) Start by identifying the known elements. Our galaxy is made up of 2.5 x 10^11 stars, each possessing one solar mass, which is equivalent to 2 x 10^30 kg. Additionally, the diameter of the Milky Way is known to be 10^5 ly.\n\nStep 2) Use the known values to calculate the total mass of the galaxy and its radius in light years.\n\nStep 3) Convert the galactic radius from light years to meters using the conversion factor of 1ly=9.46×10^15m.\n\nStep 4) We now make use of Kepler's third law of planetary motion to calculate the time a star takes to complete one revolution around the galactic center. This law connects the period of revolution (T) with the mean distance (r), the gravitational constant (G), and the galaxy's mass (M). \n\nStep 5) Substitute the calculated values into the formula to find T in seconds.\n\nStep 6) To conclude, convert the time T from seconds to years as astronomers conventionally use years to measure time."
}