{
    "Question": "4. An oxygen cylinder of volume 30 litres has an initial gauge pressure of 15 atm and a temperature of 27 C. After some oxygen is withdrawn from the cylinder, the gauge pressure drops to 11 atm and its temperature drops to 17 C. Estimate the mass of oxygen taken out of the cylinder (R = 8.31 J mol^-1 K^-1, the molecular mass of O2 = 32 u).\r\n",
    "Original Solution": "Volume of gas, V1 = 30 litres = 30 x 10^-3 m^3\r\nGauge pressure, P1 = 15 atm = 15 x 1.013 x 10^5 P a\r\nTemperature, T1 = 270 C = 300 K\r\nUniversal gas constant, R = 8.314 J mol^(-1) K^(-1)\r\nLet the initial number of moles of oxygen gas in the cylinder be n1\r\nThe gas equation is given as follows:\r\nP1V1 = n1RT1\r\nHence,\r\nn1 = P1V1 / RT1= (15.195 x 10^5 x 30 x 10^-3) / (8.314 x 300)= 18.276\r\nBut n1 = m1 / M\r\nWhere,\r\nm1 = Initial mass of oxygen\r\nM = Molecular mass of oxygen = 32 g\r\nThus,\r\nm1 = N1M = 18.276 x 32 = 584.84 g\r\nAfter some oxygen is withdrawn from the cylinder, the pressure and temperature reduce.\r\nVolume, V2 = 30 litres = 30 x 10^-3 m^3\r\nGauge pressure, P2 = 11 atm = 11 x 1.013 x 10^5 Pa\r\nTemperature, T2 = 170 C = 290 K\r\nLet n2 be the number of moles of oxygen left in the cylinder.\r\nThe gas equation is given as\r\nP2V2 = n2RT2\r\nHence,\r\nn2 = P2V2 / RT2 = (11.143 x 10^5 x 30 x 10^(-30)) / (8.314 x 290) = 13.86\r\nBut n2 = m2 / M\r\nWhere, m2 is the mass of oxygen remaining in the cylinder.\r\nTherefore,\r\nm2 = n2 x M = 13.86 x 32 = 453.1 g\r\nThe mass of oxygen taken out of the cylinder is given by the relation,\r\nInitial mass of oxygen in the cylinder – Final mass of oxygen in the cylinder\r\n= m1 – m2\r\n= 584.84 g – 453.1 g\r\nWe get,\r\n= 131.74 g\r\n= 0.131 kg\r\nHence, 0.131 kg of oxygen is taken out of the cylinder.",
    "Detailed Solution": "Step 1) Start with listing the known values. The volume of the cylinder (V1) is given as 30 litres, which is equal to 30 x 10^-3 m^3. The initial gauge pressure (P1) is 15 atm, which translates to 15 x 1.013 x 10^5 Pa. The temperature initially is 27 C, corresponding to 300 K in Kelvin scale. The molecular mass of O2 is also given as 32 g or 32 u.\n\nStep 2) We use the ideal gas law equation P1V1 = n1RT1, where n1 is the initial number of moles of oxygen in the cylinder and R is the universal gas constant (8.314 J mol^(-1) K^(-1)). By rearranging the equation to solve for n1, we get n1 = P1V1 / RT1. Plugging in the known values, we get n1 = (15.195 x 10^5 x 30 x 10^-3) / (8.314 x 300) which equals 18.276.\n\nStep 3) The initial mass of the oxygen, denoted by m1, is found by multiplying n1 by the molecular mass of oxygen, as n1 = m1 / M. Thus, m1 = n1* M = 18.276 x 32 = 584.84 g. \n\nStep 4) After some oxygen is withdrawn, we now have a new set of properties. The final gauge pressure (P2) is 11 atm, equal to 11 x 1.013 x 10^5 Pa. The final temperature (T2) is 17 C, which equals 290 K. \n\nStep 5) Apply the ideal gas law for these new properties. P2V2 = n2RT2, where n2 is the final number of moles of oxygen in the cylinder. Solving for n2, we get n2 = P2V2 / RT2 = (11.143 x 10^5 x 30 x 10^-3) / (8.314 x 290) equals 13.86.\n\nStep 6) The final mass of the oxygen, m2, is found by multiplying n2 by the molecular mass of oxygen, yielding m2 = n2 * M = 13.86 x 32 = 453.1 g.\n\nStep 7) Lastly, we can calculate the mass of oxygen taken out of the cylinder, by subtracting the final mass of oxygen in the cylinder from the initial mass. That is, mass withdrawn = m1 - m2 = 584.84 g - 453.1 g = 131.74 g, or 0.131 kg. Thus, 0.131 kg of oxygen is taken out of the cylinder.",
    "Solution Outline": "Step 1) Translate the given values of volume, pressure and temperature into proper units: m^3, Pascal and Kelvin, respectively. \n   \nStep 2) Use the ideal gas law equation P1V1 / RT1 to find the initial number of moles of oxygen, n1.\n\nStep 3) Calculate the initial mass of oxygen in the cylinder using the equation m1 = n1 x M, where M is molecular mass of O2.\n\nStep 4) After the pressure and temperature change, new values are given. Convert these to appropriate units.\n\nStep 5) Again, apply the ideal gas law P2V2 / RT2 to calculate the final number of moles of oxygen, n2.\n\nStep 6) Calculate the final mass of oxygen in the cylinder using m2 = n2 x M.\n\nStep 7) The difference between the initial and final masses gives the mass of oxygen taken out of the cylinder."
}