{
    "Question": "Q.4: Answer the following.\r\n(a) The triple-point of water is a standard fixed point in a modern thermometer. Why? What is wrong with taking the melting point of ice and the boiling point of water as standard fixed points (as was originally done in the Celsius scale)?\r\n(b) There were two fixed points in the original Celsius scale, as mentioned above, which were assigned the numbers 0 °C and 100 °C, respectively. On the absolute scale, one of the fixed points is the triple-point of water, which on the Kelvin absolute scale is assigned the number 273.16 K. What is the other fixed point on this (Kelvin) scale?\r\n(c) The absolute temperature (Kelvin scale) T is related to the temperature tc on the Celsius scale by tc = T – 273.15. Why do we have 273.15 in this relation and not 273.16?\r\n(d) What is the temperature of the triple-point of water on an absolute scale whose unit interval size is equal to that of the Fahrenheit scale?",
    "Original Solution": "(i) Melting and boiling points of water aren’t considered the standard fixed points because they vary with change in pressure, the temperature of the triple point of water is unique, and it does not vary with pressure.(ii) On Kelvin’s scale, there is only a lower fixed point which is 273.16 K, the upper fixed point is not there.(iii) The relation is such because 273.15 K on Kelvin’s scale corresponds to the melting point of ice while 273.16 K is the triple point of water.(iv) We know,\r\nRelation between the Fahrenheit scale and the Absolute scale,\r\ni.e.  \\(\\begin{array}{l}\\\\\\frac{T_{F}-32}{180}\\end{array} \\) = \\(\\begin{array}{l}\\frac{T_{K}-273}{100}\\end{array} \\) . . . . . . . . . . . . . . . . . . . ( 1 )  For another set of T’F and  T’K\\(\\begin{array}{l}\\\\\\frac{T’_{F}-32}{180} = \\frac{T’_{K}-273}{100}\\end{array} \\) . . . . . . . . . . . . . . . . . . . ( 2 )  Subtracting Equations (1) and (2),\r\n\\(\\begin{array}{l}\\\\\\frac{T’_{F}-T_{F}}{180} = \\frac{T’_{K}- T_{K}}{100}\\end{array} \\)\r\nTherefore ,T’F – TF = 1.8(T’K – TK)\r\nFor, T’K – TK = 1KT’F – TF = 1.8\r\n\\(\\begin{array}{l}\\Rightarrow\\end{array} \\) For the triple point temperature = 273.16 K , the temperature on the new scale = 1.8 x 273.16 = 491.688 Units",
    "Detailed Solution": "Step 1) First, we need to understand why modern thermometers use the triple point of water as a fixed point instead of the melting and boiling points of water, which were used in the original Celsius scale. The reason for this is that the melting and boiling points of water can vary depending on atmospheric pressure. The triple point of water, on the other hand, is a unique temperature at which water exists in all three states (solid, liquid, and gas) and does not change with variations in pressure.\n\nStep 2) In the question, it's mentioned that the Kelvin scale has a fixed point, the triple point of water, which is assigned the number 273.16 K. However, unlike the Celsius scale, the Kelvin scale only has a lower fixed point and not an upper fixed point.\n\nStep 3) The relation between the Celsius and Kelvin scale temperatures is given by the equation tc = T – 273.15. The reason that 273.15 is used and not 273.16, despite the fact that 273.16 K is the triple point temperature of water, is because 273.15 K corresponds to the melting point of ice on the Kelvin scale.\n\nStep 4) Lastly, we address the question of the temperature of the triple point of water according to an absolute temperature scale whose unit interval size is the same as that of the Fahrenheit scale. To do this, we must consider the relationship between the Fahrenheit scale and the Absolute scale, given by the equation (T_{F}-32)/180 = (T_{K}-273)/100. If we further analyze this equation and apply some algebraic manipulation to solve for the temperature on a new hypothetical Fahrenheit-like scale where the unit interval matches that of the Kelvin scale, we find that the temperature of the triple point of water on this new scale is approximately 491.688 units.",
    "Solution Outline": "Step 1) We explain the use of the triple point of water as a fixed point in modern thermometers due to its unique nature and lack of variability with pressure changes. This stands in contrast to the melting and boiling points of water, which vary with pressure.\n\nStep 2) We clarify that the Kelvin scale only has a lower fixed point, unlike the Celsius scale which has both a lower and upper fixed point.\n\nStep 3) We explore the relationship between the Celsius and Kelvin scales, explaining why the relation uses 273.15 K (the melting point of ice) instead of the triple point temperature of water, 273.16 K.\n\nStep 4) We investigate the temperature of the triple point of water on an absolute temperature scale whose unit interval size is the same as that of the Fahrenheit scale. By analyzing the relationship between the Fahrenheit and Absolute scales, we deduce that the temperature of the triple point of water on this new, hypothetical scale would be approximately 491.688 units."
}