{
    "Question": "Q25. An aircraft is flying at a height of 3400 m above the ground. If the angle subtended at a ground observation point by the aircraft positions 10.0 s apart is 30°, what is the speed of the aircraft?",
    "Original Solution": "Height at which the aircraft is flying = 3400 m\r\nLet A and B be the positions of the aircraft, making an angle ∠AOB = 300. The perpendicular OC is drawn on AB. Here, OC is the height of the aircraft, which is equal to 3400 m and ∠AOC =  ∠COB = 150.\r\nIn the ΔAOC, AC = OC tan 150 = 3400 x 0.267 = 910.86 m\r\nAB = AC + CB = AC + AC = 2 AC = 2 x 910.86 m\r\nSpeed of the aircraft = distance AB/time = (2 x 910.86)/10= 182.17 m/s =182.2 m/s",
    "Detailed Solution": "Step 1) Firstly, let's understand that the aircraft, while moving with respect to a point O on the ground, forms an angle of 30°. Imagine a triangle between the positions of the aircraft 10 seconds apart (point A and B) with point O as the vertex. The height from the ground point to the aircraft serves as the perpendicular side (OC) of two right-angled triangles (triangles AOC and COB) with the hypotenuse being the path of the aircraft over the 10 seconds. Given, the height OC of the aircraft is 3400 m. \n Step 2) Now given ∠AOB = 30°, we can easily see that in triangle AOC, ∠AOC = ∠COB =15° due to symmetry (360° of circle/2). \n Step 3) We can now use the tangent of the angle to find the adjacent side (AC = CB) of each of these right triangles. The formula for tangent, tan θ = OC/AC, can be rearranged to solve for AC: i.e. AC = OC / tan 15°. By plugging in OC = 3400 m and tan 15° = 0.267, you get AC = 3400 / 0.267 = 910.86 m. This is the distance covered by the aircraft in the first 5 seconds and the same distance is covered in the next 5 seconds due to uniform speed. \n Step 4) So the total distance travelled, AB, by the aircraft in 10 seconds is twice the distance of AC. Therefore, AB = AC + CB = AC + AC = 2 * AC = 2 * 910.86 m. \n Step 5) Now that we know the distance travelled and the time taken, we can use the formula of speed to solve for the speed of the aircraft. Speed = distance/time. Substituting our calculated value for distance and given value for the time we get: Speed = AB / time = (2 * 910.86 m) / 10 s = 182.17 m/s. Rounding the speed to the correct number of significant figures gives us the final answer of 182.2 m/s.",
    "Solution Outline": "Step 1) The aircraft creates two right triangles AOC and COB with the height from ground (OC) being 3400 m. \n Step 2) The angles ∠AOC and ∠COB are half the total angle subtended by the aircraft at ground point O, which is 15° (as given ∠AOB = 30°). \n Step 3) Using the tangent formula, rearrange to find AC = OC / tan θ and substitute OC = 3400m and tan 15° to calculate AC. \n Step 4) The total distance travelled AB = 2 * AC is calculated to understand the distance the aircraft moved in 10 seconds. \n Step 5) By using the speed = distance/time equation, plug in the calculated distance AB and given time 10 seconds to find the speed of the aircraft."
}