{
    "Question": "30:  Two narrow bores of diameters 3.0 mm and 6.0 mm are joined together to form a U-tube open at both ends. If the U-tube contains water, what is the difference in its levels in the two limbs of the tube? The surface tension of water at the temperature of the experiment is 7.3 × 10^(–2) N m^–1. Take the angle of contact to be zero and the density of water to be 1.0 × 10^3 kg m^(–3) (g = 9.8 m s^–2).",
    "Original Solution": "Diameter of the first bore, d1 = 3.0 mm = 3 × 10^-3 mRadius of the first bore, r1 = 3/2 = 1.5 x 10^-3 m.\r\nDiameter of the second bore, d2 =6mm\r\nRadius of the second bore, r2 = 6/2 = 3 x 10^-3 mm\r\nSurface tension of water, s = 7.3 × 10^-2 N /m\r\nAngle of contact between the bore surface and water, θ= 0\r\nDensity of water, ρ =1.0 × 10^3 kg/m^-3\r\nAcceleration due to gravity, g = 9.8 m/s^2  Let h1 and h2 be the heights to which water rises in the first and second tubes, respectively.\r\nThus, the difference in heighth1 – h2 = \\(\\begin{array}{l}\\frac{2sCos\\Theta }{r_{1}\\rho g} -\\frac{2sCos\\Theta }{r_{2}\\rho g}\\end{array} \\)\r\n\r\nSince, h = \\(\\begin{array}{l}\\frac{2sCos\\Theta }{r\\rho g}\\end{array} \\)\r\n\r\nh1 – h2 = \\(\\begin{array}{l}\\frac{2sCos\\Theta }{\\rho g}[\\frac{1}{r_{1}} -\\frac{1}{r_{2}}]\\end{array} \\)\r\n= \\(\\begin{array}{l}\\frac{2\\times 7.3\\times 10^{-2}\\times 1 }{10^{3}\\times 9.8}\\left [ \\frac{1}{1.5\\times 10^{-3}} -\\frac{1}{3 \\times 10^{-3}} \\right ]\\end{array} \\) = 4.97 mm  Therefore, the difference in the water levels of the two arms =2.482 mm.\r\n",
    "Detailed Solution": "Step 1) We start by identifying and converting the known values provided in the question as necessary. The diameters of the first and second bores are given as 3.0 mm and 6.0 mm respectively. We convert these millimeters into meters by multiplying by 10^-3. This gives us values of 3 x 10^-3 and 6 x 10^-3 meters respectively. The radii of these bores will be half the diameters, thus, we get radii of 1.5 x 10^-3 m and 3 x 10^-3 m for the first and second bores respectively. \n   \nStep 2) Now, we need to use the formula for height in capillary tube i.e., h = 2sCosΘ/(rρg). Here, s is the surface tension, θ is the angle of contact which is given as zero, and r is the radius, ρ is the density, and g is gravity. We are asked to find the difference in the water levels in the two arms, i.e, h1 - h2 which can be calculated as (2scosθ)/(r1ρg) - (2scosθ)/(r2ρg). \n\nStep 3) We determine a common factor from the previous expression: 2sCosΘ/ρg. Next, we identify the remaining fraction as 1/r1 - 1/r2. Thus, our formula becomes: [2sCosΘ/ρg]x[1/r1 - 1/r2].\n\nStep 4) Finally, we substitute the known values into the equation: (2sCosΘ/ρg)x[1/1.5x10^-3 - 1/3x10^-3]. Here, we replace s with 7.3x10^-2 N/m, ρ with 1x10^3 kg/m^3, and g with 9.8 m/s^2. The CosΘ equals 1 because the angle θ is zero. \n\nStep 5) Upon simplification, we find h1-h2 = 4.97 mm. Hence, the final answer is that the difference in water levels in the two limbs will be approximately 4.97mm.",
    "Solution Outline": "Step 1) Identify and convert the known diameters from millimeters to meters. Find the radii by halving the respective diameters. \n\nStep 2) Understand that the difference in the water levels is found using a specific formula: h = 2sCosΘ/(rρg). Here, h1 - h2 = (2scosθ)/(r1ρg) - (2scosθ)/(r2ρg). \n\nStep 3) Identify that [2sCosΘ/ρg] is a common factor from the height difference equation, and rewrite the equation as: [2sCosΘ/ρg]x[1/r1 - 1/r2].\n\nStep 4) Substitute the known values into the equation: (surface tension, density, gravity, radii). \n\nStep 5) Perform the calculations, simplify, and summarize the answer: the difference in water levels in the two limbs of the tube is approximately 4.97mm."
}