{
    "Question": "Q18. A police van moving on a highway with a speed of 30 km h^–1 fires a bullet at a thief’s car speeding away in the same direction with a speed of 192 km h^–1. If the muzzle speed of the bullet is 150 m s^–1, with what speed does the bullet hit the thief’s car? (Note: Obtain that speed which is relevant for damaging the thief’s car).\r\n",
    "Original Solution": "Speed of the police van = 30 km/h = 30 x (5/18) = 25/3 m/s\r\nSpeed of a thief’s car = 192 km/h = 192 x (5/18) = 160/3 m/s\r\nMuzzle Speed of  the bullet = 150 m/s\r\nSpeed of the bullet = speed of the police van + muzzle speed of  the bullet\r\n= (25/3)+ 150 = 475/3 m/s\r\nThe relative velocity of the bullet w.r.t. the thief’s car is\r\nv = Speed of the bullet – Speed of a thief’s car\r\n= (475/3) – (160/3) = 105 m/s\r\nThe bullet hits the thief’s car at a speed of 105 m/s",
    "Detailed Solution": "Step 1) We begin by identifying the provided values from the problem: the speed of the police van is 30 km/h, the speed of the thief’s car is 192 km/h, and the muzzle speed of the bullet is 150 m/s. Step 2) Since the speeds of the vehicles are provided in km/h, but the muzzle speed of the bullet is in m/s, we need to convert the vehicle speeds to m/s. We do this by multiplying the km/h values by 5/18, which gives us 30*(5/18) = 25/3 m/s for the police van and 192*(5/18) = 160/3 m/s for the thief's car. Step 3) Next, to find the actual speed of the bullet. we need to add the speed of the police van to the muzzle speed of the bullet, giving us (25/3) m/s + 150 m/s = 475/3 m/s. This is because the bullet is fired from a moving vehicle, adding its speed to the bullet. Step 4) The step with most significance in this problem is finding the relative velocity of the bullet with respect to the thief’s car. This is computed by subtracting the speed of the thief's car from the speed of the bullet, which results in (475/3) m/s - (160/3) m/s = 105 m/s. This relative velocity is the speed at which the bullet would hit the thief's car. It's the speed that matters for the intention of damaging the thief's car.",
    "Solution Outline": "Step 1) Identify the provided values including the speeds of the police van, thief’s car, and muzzle speed of the bullet. Step 2) Convert the given vehicle speeds from km/h to m/s by using the conversion factor 5/18. The speeds of the police van and the thief's car in m/s are obtained. Step 3) Compute the actual speed the bullet travels through the air by adding the muzzle speed of the bullet and the speed of the police van. This takes into account the fact that the bullet is fired from a moving vehicle. Step 4) Calculate the relative velocity of the bullet in relation to the thief’s car. This is obtained by subtracting the car’s speed from the speed at which the bullet travels. This relative velocity describes the speed at which the bullet hits the thief’s car."
}