{
    "Question": "Q14. A rope of negligible mass is wound around a hollow cylinder of mass 3 kg and radius 40 cm. What is the angular acceleration of the cylinder if the rope is pulled with a force of 30 N? What is the linear acceleration of the rope? Assume that there is no slipping.",
    "Original Solution": "Given,\r\nMass of the hollow cylinder, m = 3 kg\r\nRadius of the hollow cylinder, r = 40cm  = 0.4 m\r\nForce applied, F = 30 N\r\nMoment of inertia of the hollow cylinder about its  axis\r\nI = mr^2\r\n= 3 × (0.4)^2 = 0.48 kg m^2\r\nTorque, T = F × r  =  30 × 0.4  = 12 Nm\r\nAlso, we know that\r\nTorque = Moment of inertia x Acceleration\r\nT = Iα\r\n( a ) Therefore, α = T / I  =  12 / 0.48  = 25 rad s^-2\r\n( b ) Linear acceleration = Rα = 0.4 × 25 = 10 m s^–2 ",
    "Detailed Solution": "Step 1) We are given that the mass of the hollow cylinder, m, is 3 kg, and the radius, r, is 40 cm (or 0.4 m), with the force applied, F, being 30 N. These are our known values and will be used to calculate the angular acceleration and the linear acceleration later on. Step 2) We need to work out the moment of inertia (I), which for a hollow cylinder, is calculated as I = m*r^2. This equation allows us to account for the distribution of the cylinder's mass, based on the cylinder's mass and the square of its radius. When we plug our known values, we get I = 3*(0.4)^2 = 0.48 kg m^2. Step 3) Next, we need to determine the torque (T), which is the force that causes an object to rotate around an axis. We use the equation T = F * r. With our known values of 30N for the force and 0.4 m for the radius, we find T = 30*0.4 = 12 Nm. Step 4) We remember that Torque is also equal to Moment of Inertia times Angular Acceleration, i.e. T = I*α. With this, we can isolate α to find the angular acceleration. α = T/I = 12/0.48 = 25 rad s^-2. Step 5) Finally, we calculate the linear acceleration. We utilize the relationship between the linear acceleration (a) and the angular acceleration (α), which is a = R*α.  After plugging in the radius (0.4 m) and the angular acceleration (25 rad s^-2) we just calculated into this formula, we obtain a = 0.4*25 = 10 m s^-2.",
    "Solution Outline": "Step 1) We collect the given values: mass (m) = 3 kg, radius (r) = 0.4 m, and force (F) = 30 N. Step 2) To determine the moment of inertia (I) of a hollow cylinder, we use the equation I = m*r^2, which allows us to account for the mass and its distribution. Step 3) For determining the torque (T), which is the force that causes rotation, we use the formula T = F * r. Step 4) We relate torque, moment of inertia, and angular acceleration (α) using the equation T = I*α. This equation allows us to isolate and solve for α (the angular acceleration).  Step 5) We finally calculate the linear acceleration (a) using the relationship between linear and angular acceleration, which is a = R*α. This allows us to obtain the linear acceleration of the rope."
}