{
    "Question": "Q.11: The coefficient of volume expansion of glycerine is 49 × 10^(–5) K^(–1). What is the fractional change in its density for a 30 C rise in temperature?",
    "Original Solution": "Given:\r\nCoefficient of volume expansion of glycerine, αV = 49 × 10^(-5) K^(-1)\r\nRise in temperature, ΔT = 30C\r\nFractional change in volume = \\(\\begin{array}{l}\\frac{ \\Delta V }{ V }\\end{array} \\)\r\nWe know:αV ΔT = \\(\\begin{array}{l}\\frac{ \\Delta V }{ V }\\end{array} \\)\r\nOr, \\(\\begin{array}{l}V_{T_{2}} -V_{T_{1}} = V_{T_{1}}\\alpha _{v}\\Delta T\\\\\\end{array} \\)\r\nOr,\\(\\begin{array}{l}\\\\\\frac{m}{\\rho _{T_{2}}} -\\frac{m}{\\rho _{T_{1}}} = \\frac{m}{\\rho _{T_{1}}}\\alpha _{v}\\Delta T\\end{array} \\)\r\nWhere m = mass of glycerine\r\n\\(\\begin{array}{l}\\rho _{T_{2}}\\end{array} \\) = Final density at T2\\(\\begin{array}{l}\\\\\\rho _{T_{1}}\\end{array} \\)  = Initial density at T1\r\n\\(\\begin{array}{l}\\\\\\Rightarrow\\end{array} \\)  \\(\\begin{array}{l}\\frac{\\rho _{T_{1}} -\\rho _{T_{2}}}{\\rho _{T_{2}}}\\end{array} \\) = Fractional change in densityTherefore, Fractional change in density = 1.47 × 10^-2",
    "Detailed Solution": "Step 1) The problem details present two important pieces of information to us, firstly, the 'coefficient of volume expansion of glycerine', which is αV = 49 × 10^(-5) K^(-1), and, secondly, the 'rise in temperature', that is ΔT = 30° C. These are known values from the problem statement.\\n\nStep 2) Now let's understand the term 'fractional change in volume'. If the volume of the glycerine changes, possibly due to a change in temperature, the fractional change in volume is the change in volume divided by the original volume, represented by ΔV/V. αV ΔT represents the fractional volume change due to a change in temperature.\\n\nStep 3) Now that we know this, we can substitute our given values and we get an equation as follows: V_T2 - V_T1 = V_T1 αV ΔT, where V_T2 is the final volume, V_T1 is the initial volume, αV is the coefficient of volume expansion, and ΔT is the change in temperature. This equation simply states the initial volume adjusted by the volume change due to temperature rise equals the final volume.\\n\nStep 4) However, volume can also be presented as mass over density; let's substitute this into our equation: m/ρ_T2 - m/ρ_T1 = m/ρ_T1 αV ΔT, where ρ_T2 is the final density, ρ_T1 is the initial density, and m is mass. This equation now links the change in volume to the change in density, since density= mass/volume.\\n\nStep 5) After rearranging the formula a bit, we can determine the fractional change in density as given by the equation (ρ_T1 - ρ_T2) / ρ_T2, where ρ_T1 is the initial density, and ρ_T2 is the final density after the rise in temperature. The result is a measure of how much the density decreases for every unit of volume increase due to temperature rise.\\n\nStep 6) After performing the calculations using the provided values, we find that the fractional change in density is 1.47 × 10^-2, which is our final answer.",
    "Solution Outline": "Step 1) Identify the problem details which are the 'coefficient of volume expansion of glycerine', αV = 49 × 10^(-5) K^(-1), and the 'rise in temperature', ΔT = 30° C.\\n\nStep 2) Understand the term 'fractional change in volume' as the ratio of change in volume followed by the temperature change divided by the initial volume, or αV ΔT.\\n\nStep 3) Apply these knowns to the equation of V_T2 - V_T1 = V_T1 αV ΔT, to express the relationship between initial volume, final volume and temperature rise.\\n\nStep 4) Substitute volume as mass over density into the equation, yielding m/ρ_T2 - m/ρ_T1 = m/ρ_T1 αV ΔT, to link volume change with density change, since density= mass/volume.\\n\nStep 5) Reformat the equation to highlight the fractional change in density as (ρ_T1 - ρ_T2) / ρ_T2. \\\nStep 6) Upon final calculation, obtain the fractional change in density which is 1.47 × 10^-2."
}