{
    "Question": "Q6. Find the components along the x, y, and z axes of the angular momentum l of a particle whose position vector is r with components x, y, and z and whose momentum is p with components px, py and pz. Show that if the particle moves only in the x-y plane, the angular momentum has only a z-component.",
    "Original Solution": "Linear momentum , \\(\\begin{array}{l}\\vec{p} = p_{x}\\hat{i} + p_{y}\\hat{j} + p_{z}\\hat{k}\\end{array} \\)\r\n\r\nPosition vector of the body , \\(\\begin{array}{l}\\vec{r} = x\\hat{i} + y\\hat{j} + z\\hat{k}\\end{array} \\)\r\n\r\nAngular momentum , \\(\\begin{array}{l}\\vec{I} = \\vec{r} \\times \\vec{p}\\end{array} \\)\r\n\r\n= \\(\\begin{array}{l}(x\\hat{i} + y\\hat{j} + z\\hat{k}) \\times (p_{x}\\hat{i} + p_{y}\\hat{j} + p_{z}\\hat{k})\\end{array} \\)\r\n\r\n= \\(\\begin{array}{l}\\begin{bmatrix} \\hat{i} & \\hat{j} & \\hat{k}\\\\ x & y & z\\\\ p_{x}& p_{y} & p_{z} \\end{bmatrix}\\end{array} \\)=\\(\\begin{array}{l}\\hat{i}(yp_{z} -zp_{y}) +\\hat{j}( zp_{x} – xp_{z} ) + \\hat{k}(xp_{y} -yp_{x})\\end{array} \\)\r\n\r\n \r\nFrom this, we can conclude\r\nlX = ypZ – zpyy ,  lY = zpX – xpZ and lZ = xpY – ypX\r\nIf the body only moves in the x-y plane, then z = pz = 0. Which means\r\nlX =  lY = 0\r\nHence, only lZ = xpY – ypX , which is just the z component of angular momentum.",
    "Detailed Solution": "Step 1) The problem is asking for the components of angular momentum along the x, y, and z axes. Angular momentum is calculated by the cross product between the position vector and the momentum of the particle. In the representation of vectors, we have the position vector r = xî + yĵ + zk̂ and the momentum vector p = pxî + pyĵ + pk̂. These are given by the problem statement.\nStep 2) To find the angular momentum, we need to find the cross product of the vectors r and p. This is done using the cross product formula for vectors in Cartesian coordinates. This results in the calculation: (xî + yĵ + zk̂) x (pxî + pyĵ + pk̂).\nStep 3) This cross product is further calculated using the determinant method in 3 dimensions. We set up this determinant with î, ĵ, k̂ on the top row, and the components of the vectors r and p in the second and third rows respectively.\nStep 4) Solving this determinant gives us our angular momentum components: î(yp - zpy) + ĵ(zpx – xpz) + k̂(xpy - ypx). Here each term corresponds to the x, y and z components of the angular momentum respectively.\nStep 5) From this result, we can write expressions for each component of the angular momentum: lX = ypz - zpy, lY = zpx - xpz, lZ = xpy - ypx.\nStep 6) Now we come to the second part of the problem which states that if the particle only moves in the x-y plane, then z and pz = 0 (as there is no movement in the z direction).\nStep 7) Substituting these values into the expressions for each angular momentum component, we find that both lX and lY become 0, as they both contain terms that multiply z or pz.\nStep 8) Therefore, we are only left with the z component of the angular momentum: lZ = xpy – ypx. This means that when the particle only moves in the x-y plane, the angular momentum has only a z-component.",
    "Solution Outline": "Step 1) Begin with the given momentum vector and position vector of the particle.\nStep 2) Compute the angular momentum by finding the cross product of the position vector and the momentum vector.\nStep 3) Calculate the cross product using the determinant method for vectors in three dimensions.\nStep 4) Solve the determinant to obtain the x, y, and z components of the angular momentum.\nStep 5) Extract individual expressions for each component of the angular momentum.\nStep 6) Apply the condition of movement only in the x-y plane, setting z and pz equal to zero to find the values of angular momentum components.\nStep 7) Substituting z=0 and pz=0 into the angular momentum equations yields that the x and y components are zero.\nStep 8) Hence, it indicates that only the z-component of angular momentum remains, reaffirming that for motion in the x-y plane, the angular momentum only has a z-component."
}