{
    "Question": "28: In Millikan’s oil drop experiment, what is the terminal speed of an uncharged drop of radius 2.0 × 10^–5 m and density 1.2 × 10^3 kg m^–3? Take the viscosity of air at the temperature of the experiment to be 1.8 × 10^–5 Pa s. How much is the viscous force on the drop at that speed? Neglect buoyancy of the drop due to air.",
    "Original Solution": "Given:\r\nAcceleration due to gravity, g = 9.8 m/s^2\r\nRadius of the uncharged drop, r = 2.0 × 10^(-5) m\r\nDensity of the uncharged drop, ρ = 1.2 × 10^3 kg m^-3  Viscosity of air, η =  1.8 × 10^(-5) Pa s\r\nWe consider the density of air to be zero in order to neglect the buoyancy of air.\r\nTherefore, terminal velocity (v) is\r\nv =  \\(\\begin{array}{l}\\frac{ 2 r^{ 2 } g \\rho }{ 9 \\eta }\\end{array} \\)\r\n= \\(\\begin{array}{l}\\frac{ 2 \\left ( 2.0 \\times 10^{ -5 } \\right )^{ 2 } \\times 9.8 \\times 1.2 \\times 10^{ 3 } }{ 9 \\times 1.8 \\times 10^{ -5 } }\\end{array} \\) = 5.8 cm^(-1)\r\nAnd the viscous force on the drop is\r\nF = 6πηrv\r\n= 6 x 3.14 x 1.8 × 10^(-5) x 2 x 10^(-5) x  5.8 x 10^(-2)= 3.91 x 10^(-10) N",
    "Detailed Solution": "Step 1) The problem provides the values for acceleration due to gravity (g = 9.8 m s^-2), radius of an uncharged oil drop (r = 2.0 x 10^-5 m), density of the uncharged oil drop (ρ = 1.2 x 10^3 kg m^-3), and the viscosity of air (η = 1.8 x 10^-5 Pa s). Note that we are assuming air buoyancy is negligible, treating the air's density as zero. This assumption simplifies our calculations by taking out factors that would typically counteract the drop's downward motion. Step 2) We use the formula for terminal velocity, v = 2 r^2 g ρ / (9 η), which can be derived from first principles by balancing the forces of gravity and the drag force from the oil drop in air at terminal velocity. These forces are equal at terminal velocity because the velocity is constant, and thus, there is no acceleration. Step 3) Substitute the known values into the equation and perform the calculations, units should be paid attention to in order to maintain consistency across the equation. The terminal velocity v comes out to be 5.8 cm/s. Step 4) With terminal speed calculated, we can now determine the viscous force on the drop at this speed. We use the formula for viscous force F = 6πηrv. This equation is derived from Stokes' Law, which describes the force required to move a small sphere through a viscous fluid. Step 5) Insert the known values into the force equation (η = 1.8 x 10^-5 Pa s, r = 2.0 x 10^-5 m, and v = 5.8 x 10^-2 m s^-1) and perform the calculations. The total viscous force F is found as 3.91 x 10^-10 N.",
    "Solution Outline": "Step 1) Take note of the given values, considering the density of air zero to neglect buoyancy. Step 2) Use the equation for terminal velocity (v = 2 r^2 g ρ / 9 η), which represents a balance between gravity and drag. Step 3) Perform the substitution and calculation of terminal speed. Step 4) Use Stokes' Law (F = 6πηrv) to find the viscous force acting on the drop at this terminal speed. Step 5) Substituting the known values of viscosity, radius, and recently found terminal velocity into the Stokes' Law, perform the calculations to find the viscous force."
}