{
    "Question": "Q28. A man standing at a certain distance from an observer blows a horn of frequency 200 Hz in still air. (a) Find the horn’s frequency for the observer when the man (i) runs towards him at 20 m/s  (ii) runs away from him at 20 m /s.\r\n(b) Find the speed of sound in both cases.\r\n[Speed of sound in still air is 340 m/ s]",
    "Original Solution": "Given,\r\nFrequency of the horn, νH = 200 Hz\r\nVelocity of the man, vT = 20 m/ s\r\nVelocity of sound, v = 340 m/ s\r\n(a) We know,\r\n(i) The apparent frequency of the horn as the man approaches the observer is:\r\nv’ = vH [ v/(v – vT) ]\r\n= 200 [ 340 /(340 – 20) ]\r\n= 212.5 Hz.\r\n(ii) The apparent frequency of the horn as the man runs away from  the observer is:\r\nv’’ = vH [ v/(v + vT) ]\r\n= 200 [ 340 /(340 + 20) ]\r\n= 188.88 Hz.(b) The speed of sound is 340 m/s in both cases. The apparent change in frequency is a result of the relative motions of the observer and the source.",
    "Detailed Solution": "Step 1) Take note of the given parameters: frequency of the horn (νH) is 200 Hz, velocity of the man (vT) is 20 m/s, and velocity of sound (v) is 340 m/s. These values are considered constants, given by the problem. Step 2) Understand the equation for the apparent frequency of the horn as the man approaches the observer: v' = vH [ v/(v – vT) ]. This equation is an application of the Doppler effect, which describes how the frequency of a wave changes due to the motion of the source. v' represents the frequency heard by the observer. Step 3) Substitute the constants into the equation: v' = 200 [ 340 /(340 – 20) ]. This helps in calculating the apparent frequency when the source of the sound is moving toward the observer. After performing the calculation, we find that v' equals approximately 212.5 Hz. Step 4) Now, consider the case where the man is moving away from the observer. The equation that relates these parameters is: v'' = νH [ v/(v + vT) ]. This equation is similar to the one used in step 2, but there's a slight modification due to the change in relative motion between the observer and the source. Step 5) Substitute the constants into the equation: v'' = 200 [ 340 /(340 + 20) ]. This aids in calculating the apparent frequency when the source of the sound is moving away from the observer. Conducting the math, we find that v'' equals approximately 188.88 Hz. Step 6) Finally, it's important to note that in both cases, the speed of sound, v, remains 340 m/s. This is crucial because it signifies that the change in apparent frequency isn't a result of a change in the speed of sound, but rather due to the relative motions of the observer and the source of the sound.",
    "Solution Outline": "Step 1) Take note of the given parameters (frequency of the horn, velocity of the man, velocity of sound). Step 2) Understand the Doppler effect equation for calculating apparent frequency when the man is moving towards the observer (v' = νH [ v/(v – vT) ]). Step 3) Substitute the given parameters into the equation to find the apparent frequency (approx. 212.5 Hz). Step 4) Understand the modified Doppler effect equation for calculating apparent frequency when the man is moving away from the observer (v'' = νH [ v/(v + vT) ]). Step 5) Substitute the given parameters into this equation to find the apparent frequency when the man is moving away (approx. 188.88 Hz). Step 6) Remember that the speed of sound is constant (340 m/s) in both cases, indicating that the observed frequency change is due to relative motion between the observer and the source, not a change in the speed of sound."
}