{
    "Question": "21. A stone of mass 0.25 kg tied to the end of a string is whirled round in a circle of radius 1.5 m with a speed of 40 rev./min in a horizontal plane. What is the tension in the string? What is the maximum speed with which the stone can be whirled around if the string can withstand a maximum tension of 200 N?\r\n",
    "Original Solution": "Mass of the stone = 0.25 kg\r\nRadius, r = 1.5 m\r\nNumber of revolution in a second, n= 40/60 = (⅔) rev/sec\r\nThe angular velocity, ω = 2πn = 2 x 3.14 x (⅔)\r\nThe tension on the string provides the necessary centripetal force\r\nT = mω2r\r\nT = 0.25 x 1.5 x [2 x 3.14 x (⅔)]^2\r\n= 6.57 N\r\nMaximum tension on the string, Tmax= 200 N\r\nTmax= m(vmax)^2/r\r\n(vmax)^2 = (Tmax  x r)/m\r\n= ( 200 x 1.5)/0.25 = 1200\r\nvmax = 34. 6 m/s\r\nTherefore, the maximum speed of the stone is 34.64 m/s",
    "Detailed Solution": "Step 1) Start by listing the given values. We know that the mass of the stone is 0.25 kg, the radius at which it is swung is 1.5 m, and its rotational speed is 40 rev./min. These are known quantities that we can use when solving the problem. Step 2) Convert the rotational speed from rev./min to rev./sec by dividing the original rate by 60. This is because there are 60 seconds in a minute. This gives us 40/60 = (⅔) rev/sec. The conversion is necessary because we will be working with equations that use SI units, which utilize seconds for time rather than minutes. Step 3) Comprehend that the circular motion of the stone is caused by the tension in the string, which acts as the centripetal force. Step 4) To compute this tension, we first need to find out the angular velocity of the stone. The angular velocity, ω, is found by multiplying the revolution rate (ώ) by 2π. This is because there are 2π radians in each revolution, so we get ώ = 2π * (⅔). Step 5) To compute the tension on the string, we use the formula T = mω^2r, which is derived from the formula for centripetal force F = mω^2r, which is equal to m*v^2/r where v is the speed and m is the mass. Here, T is the tension, m is the mass, ω is the angular velocity and r is the radius. This formula equates the centripetal force required to keep the object in circular motion to the tension on the string. Step 6) Substitute the known values from Step 1 and calculated values from Step 4 into the formula T = mω^2r, resulting in T = 0.25 x 1.5 x [2 x 3.14 x (⅔)]^2. Solve this to get T = 6.57 N. This result represents the tension in the string due to the stone's motion. Step 7) We are also asked to find the maximum speed the stone can travel given a maximum tension of 200 N. Step 8) The maximum tension Tmax= 200 N can be related to the maximum speed vmax using the formula Tmax= m(vmax)^2/r, which simplifies from the same centripetal force equation but with vmax as the speed at the max tension. Step 9) Rearrange the equation from Step 8 to solve for vmax: (vmax)^2 = (Tmax  x r)/m, then substitute the known quantities to find (vmax)^2 = (200 x 1.5)/0.25. Take the square root to solve for vmax and find vmax = 34.64 m/s. Hence, the maximum speed the stone can be whirled around in the circle without breaking the string is 34.64 m/s.",
    "Solution Outline": "Step 1) Write down the given values: mass of the stone, radius of the circle, and the speed of the stone. Step 2) Convert the speed of the stone from rev./min to rev./sec for consistency with the SI units system. Step 3) Understand that the tension in the string equals the centripetal force required for the stone's circular motion. Step 4) Calculate the angular velocity by multiplying the revolution rate by 2π. Step 5) Use the formula T = mω^2r to calculate the tension in the string. Plug in the known values and the angular velocity obtained in Step 4 into the formula and find the tension. Step 6) To find the maximum speed the stone can travel, remember that the maximum tension corresponds to the maximum speed. Step 7) Use the expression Tmax= m(vmax)^2/r derived from the centripetal force equation to solve for vmax when Tmax = 200 N. Step 8) Rearrange the expression and substitute the known values to solve for vmax. The result of this is the maximum speed with which the stone can be whirled around without the string breaking."
}