{
    "Question": "Q13. Given below are functions of x and t to describe the displacement (longitudinal or transverse) of an elastic wave. Identify the ones describing  (a) a stationary wave, (b) a travelling wave and (c) neither of the two:\r\n(i) y = 3 sin( 5x – 0.5t ) + 4cos( 5x – 0.5t )\r\n(ii) y = cosx sint + cos2x sin2t.\r\n(iii) y = 2 cos (3x) sin (10t)\r\n(iv) y = \\(\\begin{array}{l}2\\sqrt{x – vt}\\end{array} \\)",
    "Original Solution": "(i) This equation describes a travelling wave, as the harmonic terms ωt and kx, are in the combination of kx – ωt.\r\n(ii) This equation describes a stationary wave because the harmonic terms ωt and kx appear separately in the equation. In fact, this equation describes the superposition of two stationary waves.\r\n(iii) This equation describes a stationary wave because the harmonic terms ωt and kx appear separately.\r\n(iv) This equation does not contain any harmonic term. Thus, it is neither a travelling wave nor a stationary wave.",
    "Detailed Solution": "Step 1) We start with the given functions and aim to figure out which ones represent a stationary wave, a travelling wave, and neither of the two. The three scenarios are characterised differently. For a stationary wave, the harmonic terms ωt and kx appear separately. For a travelling wave, these terms combine as (kx – ωt) or (kx + ωt). If neither of these characteristics is fulfilled, the function doesn't describe either type of wave. Step 2) Looking at the first function y = 3 sin( 5x – 0.5t ) + 4cos( 5x – 0.5t ), we see that our arguments in both sin and cos functions are in the form of (kx - ωt). This complies to the characteristics of a travelling wave. Therefore, (i) expresses a travelling wave. Step 3) Examining the second function y = cosx sint + cos2x sin2t, we see that it's a superposition of two harmonic terms, where the arguments kx and ωt appear separately. According to our known characteristics, this configuration depicts a stationary wave. So, (ii) represents a stationary wave. Step 4) For the third equation, y = 2 cos (3x) sin (10t), the arguments of our trigonometric functions appear separately, indicating a stationary wave. Therefore, (iii) also portrays a stationary wave. Step 5) Finally, examining the last function y = 2√(x - vt), we realize it doesn't contain any trigonometric function nor does it show the harmonic argument form. Hence, this function doesn't describe a stationary or a travelling wave. Therefore, (iv) doesn't represent either type of the waves.",
    "Solution Outline": "Step 1) We look at the given functions and one by one identify whether they represent stationary waves, travelling waves or neither by looking at the harmonic terms. Step 2) For function (i), the harmonic terms are combined as kx - ωt, indicating a travelling wave. Thus, (i) is a travelling wave. Step 3) Function (ii) shows separately appearing harmonic terms, indicating a stationary wave. So, (ii) is a stationary wave. Step 4) Similarly, in function (iii), the harmonic terms appear separately, revealing that (iii) is also a stationary wave. Step 5) Lastly, function (iv) shows neither combined nor separately appearing harmonic terms, so it doesn't illustrate a stationary or travelling wave. As a result, (iv) represents neither type of wave."
}