{
    "Question": "14. The piston in the cylinder head of a locomotive has a stroke (twice the amplitude) of 1.0 m. If the piston moves with simple harmonic motion with an angular frequency of 200 rad/min, what is its maximum speed?",
    "Original Solution": "Given\r\nAngular frequency of the piston, ω = 200 rad/ min\r\nStroke = 1.0 m\r\nAmplitude, A = 1.0 / 2\r\n= 0.5 m\r\nThe maximum speed (vmax) of the piston is given by the relation:\r\nvmax = Aω\r\n= 200 x 0.5\r\nWe get,\r\n= 100 m/ min\r\nTherefore, its maximum speed is 100 m / min",
    "Detailed Solution": "Step 1) The problem provides us with two main pieces of information: the stroke of the piston is 1.0 m, and it moves with an angular frequency (ω) of 200 rad/min. A stroke refers to the distance the piston travels, and it is usually twice the amplitude of a harmonic motion. The angular frequency is related to how fast the oscillation is. Step 2) The amplitude, A, is understood as half of the stroke in harmonic motion, as the stroke is defined as a complete cycle of oscillation from one extreme, through the less extreme to the other extreme. In this case, A = 1.0 m / 2 = 0.5 m. Step 3) The maximum speed (vmax) of an oscillating object, such as our piston, in simple harmonic motion is given by the equation: vmax = Aω. This means the top speed is the product of the amplitude and the angular frequency. Step 4) We can now substitute the known values of A = 0.5 m and ω = 200 rad/min into this relation. vmax = Aω = 200 rad/min * 0.5 m = 100 m/min. Thus, the maximum speed of the piston is 100 m/min.",
    "Solution Outline": "Step 1) Identify the provided values: the stroke is 1.0 m and the angular frequency, ω, is 200 rad/min. Step 2) Determine the amplitude as half the stroke since the stroke is twice the amplitude in a simple harmonic motion. Here, amplitude, A= 1.0 m / 2 = 0.5 m. Step 3) Recognize the formula for maximum speed in simple harmonic motion, which is vmax = Aω. This shows that the maximum speed is found by multiplying the amplitude by the angular frequency. Step 4) Substitute the known values into this formula (A = 0.5 m, ω = 200 rad/min) to obtain vmax = 100 m/min. Hence, we conclude that the maximum speed of the piston is 100 m/min."
}