{
    "Question": "Q7. An ultrasonic scanner operating at 4.2 MHz is used to locate tumours in tissues. If the speed of sound is 2 km/s in a certain tissue, calculate the wavelength of sound in this tissue.",
    "Original Solution": "Given,\r\nSpeed of sound in the tissue, vT = 2 km/s = 2 × 10^3 m/s\r\nOperating frequency of the scanner, ν = 4.2 MHz = 4.2 × 10^6 Hz\r\nTherefore, the wavelength of sound:\r\nλ = vT / v\r\n= (2 × 10^3)/ (4.2 × 10^6)\r\n= 4.76 x 10^-4 m.",
    "Detailed Solution": "Step 1) The problem gives us the frequency of the ultrasonic scanner as 4.2 MHz. We know that a MHz is a unit of frequency equal to one million (10^6) cycles per second, or hertz (Hz). So, we convert 4.2 MHz to Hz by multiplying 4.2 by 10^6, which gives us 4.2 × 10^6 Hz.\nStep 2) Next, we are given the speed of sound in the tissue as 2 km/s. Since we are dealing with physics and the standard unit of speed is meter per second (m/s), we convert 2 km/s to m/s. We know that 1 km equals 1000 m (10^3 m), so multiplying 2 by 10^3 gives us 2 × 10^3 m/s.\nStep 3) Now that we have the frequency (ν) and the speed of sound, also known as velocity (vT), we are ready to find the wavelength (λ). The formula relating these three quantities in wave physics is λ = vT / ν. \nStep 4) Finally, we substitute the provided values into the equation. The speed is the numerator, and the frequency is the denominator. Plugging in, we get λ = (2 × 10^3) / (4.2 × 10^6), which yields the result 4.76 x 10^-4 meters or 4.76 micrometers. Note that the result is in the standard unit of meters as we made the necessary conversions at the start.",
    "Solution Outline": "Step 1) Firstly, convert the given frequency from MHz to Hz, by multiplying by 10^6, to be consistent with standard units in physics.\nStep 2) Convert the given speed of sound from km/s to m/s, using the fact that 1km equals 1000m.\nStep 3) Use the wave physics formula λ = vT / ν to relate the speed of sound, frequency, and wavelength together.\nStep 4) Substitute the already converted values into the formula, therefore, λ = (2 × 10^3) / (4.2 × 10^6), which comes to the final result 4.76 x 10^-4 meters. This result is in meters due to our initial unit conversions."
}