{
    "Question": "Q.13. A copper block of mass 2.5 kg is heated in a furnace to a temperature of 500 C and then placed on a large ice block. What is the maximum amount of ice that can melt? (Specific heat of copper = 0.39 J g^–1 K^–1; the heat of fusion of water = 335 J g^–1 )",
    "Original Solution": "The mass of the copper block, m = 2.5 kg\r\nThe temperature of the block, ΔT= 5000 C\r\nThe pecific heat of copper, c= 0.39 J g^–1 K^–1\r\nThe latent heat of fusion of water, L = 335 J g^–1\r\nLet m’ be the mass of the ice melted.\r\nTherefore, Heat gained by ice = Heat lost by copper\r\nm’L = mcΔT\r\nm’ = mc ΔT/L\r\n= (2500 x 0.39 x 500)/335 = 1500 g = 1.5 kg",
    "Detailed Solution": "Step 1) We first look at the information provided to us. The mass of the copper block (m) = 2.5 kg, the initial temperature of the copper block (ΔT) = 500° C, the specific heat of copper (c) = 0.39 J g^–1 K^–1, and the latent heat of fusion (L) = 335 J g^–1. We are asked to find out the maximum amount of ice that can melt, so let's call that m’. Step 2) Remembering that energy cannot be created or destroyed, just transferred, informs us that the heat lost by the copper block must be exactly equal to the heat gained by the ice. Thus, we can create the equality: m’L = mcΔT. Step 3) We want to find m', the mass of the ice melted, so we should rearrange the equation to isolate m’ on one side to get the equation: m’ = mcΔT / L. Step 4) Now we just have to plug in the values we know. We substitute m with 2500 g (since 1 kg = 1000 g we get 2.5 x 1000), c with 0.39 J g^–1 K^–1, ΔT with 500 (we must convert the Celsius to Kelvin because the specific heat capacity is given per degree Kelvin. But the temperature change is the same in both units because a 1 degree change in Celsius is the same as 1 degree change in Kelvin), and L with 335 to get m' = (2500 x 0.39 x 500) / 335 = 1500 g. Step 5) Convert the melted ice mass from grams to kilograms since the standard unit of mass in the SI system is kg. So we divide by 1000 to get m’ = 1.5 kg.",
    "Solution Outline": "Step 1) Gather all key information provided in the question. Step 2) Use the law of conservation of energy to equate the heat lost by the copper block to the heat gained by ice. Step 3) Isolate m’, the mass of the ice melted, in the consequent equation. Step 4) Substitute the values into the equation and perform the operation. Step 5) Standardize the answer to SI system by converting the result from g to kg."
}