{
    "Question": "Comets move around the sun in highly elliptical orbits. The gravitational force on the comet due to the sun is not normal to the comet’s velocity in general. Yet the work done by the gravitational force over every complete orbit of the comet is zero. Why?",
    "Original Solution": "The force due to gravity is a conservative force. The work done on a closed path by the conservative force is zero. Hence, for every complete orbit of the comet, the work done by the gravitational force is zero.",
    "Detailed Solution": "Step 1) Understand the question. It is asked why the sun’s gravitational force does not work on the comet over a complete orbit. You have to remember that in any celestial body's movement around the sun, the gravitational force that the sun applies on that body is not perpendicular to the body’s velocity, in fact, it is rarely so. Yet, despite this fact, the work done by this force over an entire orbit is zero. Here, the concept of 'work' in physics is being applied, where work is calculated by the force applied on an object and the distance that object moves due to that force. Step 2) Recall the definition of conservative forces, which are forces whose work done does not depend on the path taken but only on the initial and final positions. Some examples of conservative forces include gravitational force, electrostatic force, and spring force. They have this unique characteristic where the net work done by them over a closed path, which means a path that starts and ends at the same position, is zero. This is primarily due to the fact that the total energy of a system remains conserved. Step 3) Apply this definition to our comet-sun problem. Since the force due to gravity is a conservative force, and the comet's path is a full orbit that ends where it started, the work done by the gravitational force over the entire orbit is zero. This is even though the gravitational force is not normal to the comet's velocity. This conclusion is derived from the fundamental properties of conservative forces, not individual calculations.",
    "Solution Outline": "Step 1) Apply the concept of 'work' in physics and understand the path of a celestial body in orbit around the Sun. Step 2) Recall that a conservative force does work based on the initial and final positions, not the path, and that the work done over a closed path is zero because total energy is conserved. Some examples of conservative forces are gravitational force, electrostatic force, and spring force. Step 3) Realize that the gravitational force between Sun and the comet is a conservative force. Hence, despite not being perpendicular to the comet's velocity, it does zero work over a full orbit (a closed path) according to properties of conservative forces."
}