{
    "Question": "Q8. On a two-lane road, car A is travelling at a speed of 36 km/h. Two cars, B andC, approach car A in opposite directions with a speed of 54 km/h each. At acertain instant, when the distance AB is equal to AC, both being 1 km, B decidesto overtake A before C does. What is the minimum acceleration of car B required toavoid an accident?\r\n",
    "Original Solution": "The speed of car A = 36 km/h = 36 x (5/8) = 10 m/s\r\nSpeed of car B = 54 km/h = 54 x (5/18) = 15 m/s\r\nSpeed of car C = – 54 km/h = -54 x (5/18) = -15 m/s (negative sign shows B and C are in opposite directions)\r\nRelative speed of A w.r.t. C, VAC = VA – VB = 10 – (-15) = 25 m/s\r\nRelative speed of B w.r.t. A, VBA = VB – VA = 15 – 10 = 5 m/s\r\nDistance between AB = Distance between AC = 1 km = 1000 m\r\nTime taken by the car C to cover the distance AC, t = 1000/VAC = 1000/ 25 = 40 s\r\nIf a is the acceleration, then\r\ns = ut + (1/2) at^2\r\n1000 = (5 x 40) + (1/2) a (40)^ 2\r\na = (1000 – 200)/ 800 = 1 m/s^2\r\nThus, the minimum acceleration of car B required to avoid an accident is 1 m/s^2",
    "Detailed Solution": "Step 1) The problem first mentions the speed of car A at 36 km/h. To use it in computations, we need to convert it to a more basic unit, meters per second (m/s). This is done using the conversion factor 5/18 (because 1 km = 1000 metres and 1 hour = 3600 seconds).Therefore, the speed of car A becomes 36 x (5/18) = 10 m/s. \n\nStep 2) Similarly, we convert the speeds of car B and C, which are both 54 km/h, into m/s, obtaining 54 x (5/18) = 15 m/s. As B and C are moving in opposite directions, we depict the speed of car C as negative, -15 m/s. \n\nStep 3) The next step is to find the relative speed of car A (VA) with respect to car C (VC) and car B (VB) with respect to A. The relative speed VAC is obtained by subtracting the speed of the car respect to which we are determining (in this case, VC) from VA, yielding VAC = VA - VC = 10 - (-15) = 25 m/s. For the relative speed of VB w.r.t A (VBA), we subtract VA from VB, which gives VBA = VB - VA = 15 - 10 = 5 m/s.\n\nStep 4) The problem states that the distance between A and B and between A and C (both denoted as AB and AC) are the same at 1 km. For computations, we should convert this into m, therefore, 1 km becomes 1000 m. \n\nStep 5) With the distance between AC and the relative speed of A w.r.t C, we find how long car C would take to cover the distance. The time taken by car C to cover the distance AC can be calculated using the relationship t = Distance / Speed, which gives, t = 1000 / VAC = 1000 / 25 = 40 seconds.\n\nStep 6) This is where we find the minimal acceleration (a) of car B needed to avoid collision. We need to use the equation of motion: s = ut + 1/2 at^2 where, 's' is the displacement (which happens to be the distance AB = 1000m), 'u' is the initial velocity (which is the relative speed of B w.r.t A = 5m/s), 't' is the time = 40s and 'a' is what we are finding. Inserting the given values gives us: 1000 = (5 x 40) + (1/2) a x (40)^2. Solving this equation for 'a' gives us a = 1 m/s^2.\n\nStep 7) Thus, the minimum acceleration of car B required to avoid an accident is 1 m/s^2.",
    "Solution Outline": "Step 1) Convert speeds of cars A, B, and C from km/h into m/s. Denote the speed of car C as negative because B and C are moving in different directions. \n\nStep 2) Calculate the relative speeds of car A with respect to car C (VAC) and of car B with respect to car A (VBA) by subtracting the velocities.\n\nStep 3) Convert the distances between AB and AC from km to m.\n\nStep 4) Use the distance AC and the relative speed VAC to find the time it takes for car C to cover the distance AC.\n\nStep 5) Use the equation of motion (s = ut + 1/2 at^2) to solve for the acceleration 'a' using the values for displacement (s), initial velocity (u), and time (t) obtained from the previous steps.\n\nStep 6) Finally, interpret the value of 'a'. This represents the minimum acceleration car B must have to avoid a collision."
}