{
    "Question": "Q17: A stone tied to the end of a string 80 cm long is whirled in a horizontal circle with a constant speed. If the stone makes 14 revolutions in 25 s, what is the direction and magnitude of the acceleration of the stone?\r\n",
    "Original Solution": "Length of the string, l = 80 cm = 0.8 m\r\nNo. of revolutions = 14\r\nTime taken = 25 s\r\nFrequency, v = \\(\\begin{array}{l}\\frac{No. \\; of \\; revolution}{Time \\; taken}\\end{array} \\) = \\(\\begin{array}{l}\\frac{14}{25}\\end{array} \\) Hz\r\nAngular frequency \\(\\begin{array}{l}\\omega\\end{array} \\),\r\n= \\(\\begin{array}{l}2\\pi v\\end{array} \\)\r\n= \\(\\begin{array}{l}2 \\times \\frac{22}{7} \\times \\frac{14}{25}\\end{array} \\)\r\n= \\(\\begin{array}{l}\\frac{88}{25} \\; rad \\; s^{-1}\\end{array} \\)\r\nCentripetal acceleration:\r\nThe direction of centripetal acceleration is always directed along the string, toward the centre, at all points.",
    "Detailed Solution": "Step 1) Identify the provided values: The string's length is given as 80 cm, which needs to be converted into meters. Therefore, we have l = 80 cm = 0.8 m. We're also told that the stone makes 14 revolutions in 25 seconds. Step 2) Determine the frequency (v) using the provided equation v = Number of revolutions / Time taken. Taking the number of revolutions as 14 and the time taken as 25 seconds, we get v = 14/25 Hz. This is the rate at which the stone is making revolutions per second. Step 3) Compute the angular frequency (ω), which is related to the frequency we just computed using the equation ω = 2πv. By substituting v = 14/25 into this equation, we can calculate the angular frequency using ω = 2 * (22/7) * (14/25) = 88/25 rad s^-1. It's important to note that the term 'rad s^-1' denotes that the angular frequency is measured in radians per second. Step 4) Discuss the centripetal acceleration's direction. In physics, there is a rule that the direction of the centripetal acceleration in a circular motion is always directed along the string towards the center. Hence, no matter where the stone is in its circular path, the acceleration will always point to the center of the circular path.",
    "Solution Outline": "Step 1) Identify the given values and conduct necessary unit conversions (like converting cm to m). Step 2) Use these values to compute the frequency (v) using the equation v = No. of revolutions / Time taken. Step 3) Calculate the angular frequency (ω) using the equation ω = 2πv, by substituting the calculated frequency (v). This gives the rate of motion in radians per second. Step 4) Conclude that the direction of the centripetal acceleration, which is relevant in a circular motion setting, is always towards the center of the circle."
}