{
    "Question": "27: A plane is in level flight at a constant speed, and each of its wings has an area of 25 m^2. If the speed of the air is 180 km/h over the lower wing and 234 km/h over the upper wing surface, determine the plane’s mass. (Take air density to be 1 kg/m^3, g = 9.8 m/s^2",
    "Original Solution": "Area of the wings of the plane, A=2×25=50 m^2\r\nSpeed of air over the lower wing, V1\r\n​=180km/h= 180 x (5/18) = 50 m/s\r\nSpeed of air over the upper wing, V2\r\n=234km/h= 234 x (5/18) = 65 m/s\r\nDensity of air, =1kg/m^3\r\nPressure of air over the lower wing =P1\r\n​Pressure of air over the upper wing =P2\r\n​Pressure difference,ΔP = P1​−P2 = (1/2) ρ (V22 – V12)\r\n= (1/2) x 1 x (652 – 502) = 862.5 Pa\r\n​The net upward force F=ΔP x A\r\nThe upward forces balance the weight of the plane\r\nmg = ΔP x A\r\nm = (ΔP x A)/g\r\n= (862.5 x 50)/9.8​\r\n=4400kg\r\nThe mass of the plane is 4400 kg.",
    "Detailed Solution": "Step 1) We begin by assimilating the known information. We know that the total area of the wings (accounting for both wings) A of the plane is equal to 2 x 25 m^2, or 50 m^2. This is a simple multiplication of the given wing area by 2 as there are two wings on the plane. Step 2) Next, we convert the speed of air over the lower and upper wing surfaces from km/h to m/s, as it's easier to work with SI units. For the lower wing, V1 = 180 km/h = 180 x (5/18) = 50 m/s. For the upper wing, V2 = 234 km/h = 234 x (5/18) = 65 m/s. We achieve these conversions by a standard factor of 5/18 that translates speed from km/h to m/s. Step 3) Now, we assume the pressure of air over the lower wing to be P1, and over the upper wing to be P2. Their pressure difference ΔP forms the basis of the difference in lift on either wing surface. Although we don't directly know the values of P1 and P2, we know that ΔP can be calculated using the formula ΔP = (1/2) ρ (V2^2 – V1^2), where ρ is the known density of air, which in this case is 1 kg/m^3. Step 4) Plugging known values, we get ΔP = (1/2) x 1 x (65^2 – 50^2) = 862.5 Pa. Step 5) We then calculate the net upward force F=ΔP x A. This is calculated by formula from fluid dynamics, where the net upwards force resulting from difference in air pressure across a surface is given by the product of the pressure difference and the area. Step 6) The plane is in level flight at a constant speed. This implies that the net upward force must balance the weight of the plane, hence we set mg, where m is the plane's mass and g is the acceleration due to gravity, equal to ΔP x A. Rearranging the equation to solve for m, we get m = (ΔP x A) / g. Step 7) Substituting the known values, we get m = (862.5 x 50) / 9.8​, which simplifies to m =4400 kg. This designates the mass of the plane.",
    "Solution Outline": "Step 1) Determine the total wing area of the plane as A = 2 x 25 m^2. Step 2) Convert the speeds of air over the lower wing (V1) and upper wing (V2) from km/h to m/s using the conversion factor 5/18. Step 3) Derive the formula for the pressure difference ΔP across the wings based on known physical principles: ΔP = (1/2) ρ (V2^2 – V1^2). Here, ρ signifies air density. Step 4) Calculate ΔP using the given values. Step 5) Determine the net upward force F=ΔP x A, that results from the pressure difference and wing area. Step 6) Balance this force with the weight of the airplane to obtain the equation mg = ΔP x A. From this, derive the formula to calculate the plane's mass as m = ΔP x A / g. Step 7) Calculate the plane's mass by substituting the known values into the derived formula. The mass obtained is the required solution."
}