{
    "Question": "Q7. Two trains, A and B, of length 400 m each, are moving on two parallel tracks with auniform speed of 72 km h^(–1) in the same direction, with A ahead of B. The driver ofB decides to overtake A and accelerates by 1 m s^(–2). If, after 50 s, the guard of B justbrushes past the driver of A, what was the original distance between them?\r\n",
    "Original Solution": "Length of trains A and B = 400 m\r\nSpeed of both the trains = 72 km/h = 72 x (5/18) = 20m/s\r\nUsing the relation, s = ut + (1/2)at^2\r\nDistance covered by the train B\r\nSB = uBt + (1/2)at^2\r\nAcceleration, a = 1 m/s\r\nTime = 50 s\r\nSB = (20 x 50) + (1/2) x 1 x (50)^2\r\n= 2250 m\r\nDistance covered by the train A\r\nSA = uAt + (1/2)at^2\r\nAcceleration, a = 0\r\nSA = uAt  = 20 x 50 = 1000 m\r\nTherefore, the original distance between the two trains = SB – SA = 2250 – 1000 = 1250 m",
    "Detailed Solution": "Step 1) We are given the problem, which states that two trains A and B, each 400 m long, are moving parallel to each other with a uniform speed of 72 km/hour. Train B tries to overtake train A, and in doing so, accelerates at 1 m/s^2. After 50 seconds, train B is just ahead of train A. We are asked to calculate the original distance between A and B. \nStep 2) We first convert the speed from km/h to m/s, to match the units of the other quantities given in the question. Hence, speed = 72 km/hr x (5/18) = 20 m/s. Both trains were initially moving at this speed.\nStep 3) We then make use of the formula of motion, which states that the total distance travelled, s, is equal to the initial speed (u) multiplied by time (t) plus half of the acceleration (a) times the time squared. In equation form: s = ut + 0.5at^2. \nStep 4) We can calculate the distance covered by train B using the above equation. Train B has an original speed of 20 m/s (uB), time of travel is 50 seconds (t) and acceleration of 1 m/s^2 (a). Plugging these values into the equation, we get: SB = (20 x 50) + (0.5 x 1 x (50)^2) = 2250 m.\nStep 5) Using same motion equation to calculate the distance covered by train A. Given that train A is constantly moving at the same speed and does not accelerate, so acceleration, a = 0. SA = uAt = 20*50 = 1000 m. \nStep 6) The original distance between the two trains can then be found by subtracting the distance covered by train A from the distance covered by train B. So, Original Distance = SB - SA = 2250 - 1000 = 1250 m.",
    "Solution Outline": "Step 1) Understand the problem and what we are asked to solve for. Parse out the given information. \nStep 2) Convert the given speed from km/h to m/s to match the other units in the problem. Both trains were initially moving at this speed.\nStep 3) Apply the formula of motion to calculate the total distance traveled. The formula takes into account the initial speed, time of travel, and acceleration.\nStep 4) Use the formula of motion to find the distance covered by the accelerating train B by substituting the respective values (speed = 20 m/s, time = 50 sec, and acceleration = 1 m/s^2).\nStep 5) Using the same formula of motion, find the distance covered by the constant speed train A (speed = 20 m/s, time = 50 sec, acceleration = 0).\nStep 6) Compute the original distance between the trains by subtracting the distance covered by train A from the distance covered by train B."
}