{
    "Question": "18. Two billiard balls, each of mass 0.05 kg, moving in opposite directions with speed 6 ms^(-1) collide and rebound with the same speed. What is the impulse imparted to each ball due to the other?",
    "Original Solution": "Mass of each ball = 0.05 kg\r\nInitial velocity of each ball = 6 m/s\r\nThe initial momentum of each ball before the collision\r\n= 0.05 x 6 = 0.3 kg m/s\r\nAfter the collision, the balls change in the direction of motion without a change in the magnitude of the velocity\r\nFinal momentum after collision of the first ball = – 0.05 x 6 = – 0.3 kg m/s\r\nFinal momentum after collision of the second ball = 0.3 kg m/s\r\nImpulse imparted to the first ball = (-0.3) – (0.3) = – 0.6 kg m/s\r\nImpulse imparted to the second ball = (0.3) – (-0.3) = 0.6 kg m/s\r\nThe two impulses are opposite in direction.",
    "Detailed Solution": "Step 1) We start with known values in the question, with the mass of each billiard ball being 0.05 kg and their initial speed in opposite directions identified as 6 m/s. \n\nStep 2) We can calculate the initial momentum of each ball before the collision using the basic momentum equation, which is P_initial = mass x velocity_initial. So, momentum of each ball initially = 0.05 kg x 6 m/s = 0.3 kg m/s. \n\nStep 3) After the collision, the direction of motion changes for each ball, but the magnitude of velocity (speed) remains the same as before. This means the subsequent (post-collision) momentum will have the same magnitude but an inverted sign, as it's moving in the opposite direction now. So, the final momentum of the first ball = -0.05 kg x 6 m/s = -0.3 kg m/s, and for the second ball = 0.3 kg m/s since its direction didn't change.\n\nStep 4) Now, the impulse imparted to each billiard ball is calculated by finding the difference between the final and initial momentum, according to the Impulse-Momentum theorem. The first ball goes from a positive to a negative direction, so we subtract the final momentum from the initial one, thus getting the impulse on the first ball of (-0.3 kg m/s) - (0.3 kg m/s) = -0.6 kg m/s. \n\nStep 5) Similarly, the impulse imparted on the second ball is the difference in momentum; however, this ball remained in the same direction before and after the collision, and hence, its impulse is calculated as (0.3 kg m/s) - (- 0.3 kg m/s) = 0.6 kg m/s. \n\nStep 6) In conclusion, the two impulses are of equal magnitude, but opposite in direction, reflecting the principle of conservation of momentum.",
    "Solution Outline": "Step 1) Identify the known quantities i.e., mass and initial velocity.\n\nStep 2) Compute the initial momentum of each ball using the momentum formula.\n\nStep 3) Post-collision, since the direction of motion undergoes a change, final momentum calculations will take into account the opposed direction.\n\nStep 4) Impulse is calculated by the difference between the final and initial momentum.\n\nStep 5) Apply these calculations distinctly to the two balls based on their direction of motion post-collision.\n\nStep 6) Ends with observing that the two impulses are of equal magnitude but in opposite directions, reflecting the principle of conservation of momentum."
}