{
    "Question": "22: As you have learnt in the text, a geostationary satellite orbits the earth at the height of nearly 36,000 km from the surface of the earth. What is the potential due to the earth’s gravity at the site of this satellite? (Take the potential energy at infinity to be zero.) Mass of the earth = 6.0×10^24 kg, radius = 6400 km\r\n",
    "Original Solution": "Given:\r\nRadius of the Earth, R = 6400 km = 0.64 × 10^7 m\r\nMass of Earth, M = 6 x 10^24 kg\r\nHeight of the geostationary satellite from the earth’s surface, h = 36000 km = 3.6 x 10^7 m\r\nTherefore, gravitational potential at height ‘h’ on the geostationary satellite due to the earth’s gravity\r\nGP = \\(\\begin{array}{l}\\frac{-GM}{R+h}\\end{array} \\)\r\n\\(\\begin{array}{l}\\\\\\Rightarrow\\end{array} \\) GP = \\(\\begin{array}{l}\\frac{-(6.67\\times 10^{-11})\\times (6\\times 10^{24})}{(0.64\\times 10^{7})+(3.6\\times 10^{7})}\\end{array} \\)\r\n\\(\\begin{array}{l}\\\\\\Rightarrow\\end{array} \\) GP = \\(\\begin{array}{l}\\frac{-40.02\\times 10^{13}}{4.24\\times 10^{7}}\\end{array} \\)= -9.439 × 10^6 J/Kg\r\nTherefore, the gravitational potential due to Earth’s gravity on a geostationary satellite orbiting earth is -9.439 × 10^6 J/Kg",
    "Detailed Solution": "Step 1) First, let's identify what we know from the problem. The radius of the Earth (R) is given as 6400 km, which we convert to meters to give 0.64 x 10^7 m. The mass of the Earth (M) is 6 x 10^24 kg, and the altitude of the geostationary satellite from the Earth's surface (h) stands at 36,000 km, or 3.6 x 10^7 m after the conversion to meters. It's critical to convert all units to a common system - in this case, meters - to ensure accuracy in our calculations. \n\nStep 2) Next, we need to consider the formula for the gravitational potential (GP) at height 'h'. Gravitational potential describes the potential energy per unit mass as an object is moved to a specific position within a gravitational field. It is given by the formula GP = -GM / (R + h). This formula is derived from the laws of gravitational potential energy and tells us about the energy required to move a mass from infinity to a point inside a gravitational field.\n\nStep 3) Now, we substitute the given values and the gravitational constant (G = 6.67 x 10^-11 Nm²/kg²) into the gravitational potential formula. This results in GP = -(6.67 x 10^-11) x (6 x 10^24) / [(0.64 x 10^7) + (3.6 x 10^7)]. The - sign is key here. It represents the gravitational force acting as an attractive force, pulling the satellite towards the earth. A positive value would mean that the force is repulsive, pushing the satellite away from the earth.\n\nStep 4) We perform the calculation in the numerator first, calculating GM to be -40.02 x 10^13.\n\nStep 5) Next, we sum R + h in the denominator to get 4.24 x 10^7. The denominator calculation is important because it represents the total distance from the center of the Earth to the geostationary satellite.\n\nStep 6) Finally, we divide the numerator by the denominator to find the gravitational potential, which amounts to -9.439 x 10^6 J/kg. The negative sign tells us that work must be done against the gravitational field to move a unit mass from the given place to an infinite distance away. Therefore, the gravitational potential due to Earth’s gravity on the geostationary satellite is -9.439 x 10^6 J/Kg.",
    "Solution Outline": "Step 1) Convert given values in kilometers to meters for consistent units. \n\nStep 2) Identify the formula for gravitational potential, GP = -GM / (R + h). This tells us the potential energy for each unit of mass at a specific height within a gravitational field.\n\nStep 3) Substitute given values and the gravitational constant into the formula, resulting in GP = -(6.67 x 10^-11) x (6 x 10^24) / [(0.64 x 10^7) + (3.6 x 10^7)].\n\nStep 4) Perform the calculations starting with the numerator GM to obtain -40.02 x 10^13.\n\nStep 5) Compute the sum of R + h in the denominator yielding 4.24 x 10^7. \n\nStep 6) Divide the calculated numerator by the calculated denominator to find the gravitational potential, which is -9.439 x 10^6 J/kg. This result represents the gravitational potential energy per unit mass at the geostationary satellite's altitude."
}