{
    "Question": "Q17. A metre stick is balanced on a knife edge at its centre. When two coins, each of mass 5 g are put one on top of the other at the 12.0 cm mark, the stick is found to be balanced at 45.0 cm. What is the mass of the metre stick?",
    "Original Solution": "The centre of mass of the meter rule shifts to 45 cm mark from 50 cm mark when 2 coins are added at 12 cm mark.\r\nMass of two coins, m = 10 g\r\nDistance at which the coins are placed from the new support d1= 45 – 12 = 33 cm\r\nDistance of the centre of mass from the new support= 50- 45 = 5 cm\r\nTo find the mass of the scale, we should use the balancing moments.\r\nMoment due to the coins, r1 = m x d1\r\nMoment due to the mass of the scale r2 = M x d2\r\nr1 = r2\r\nm x d1 = M x d2\r\nSubstituting, we get\r\n10 x 33 = M x d2\r\nM = (10 x 33) /5 = 330/5 = 66 g",
    "Detailed Solution": "Step 1) Take note of the problem. You are told a metre stick is balanced on a knife edge at its centre. When two coins, each of mass 5 g are put one on top of the other at the 12.0 cm mark, the stick is found to be balanced at 45.0 cm. So the first thing you need to find is the weight of these two coins, which is 5 g each, hence in total, you have 10 g. Step 2) Next, calculate distance at which the coins are placed from the new support, defined as d1. The coins are at the 12 cm mark and the new balance point is at the 45 cm mark. So, d1= 45 – 12 = 33 cm. Step 3) Calculate the distance of the centre of mass from the new support, defined as d2. The centre of mass originally was at the 50 cm mark, it has now shifted to the 45 cm mark, hence, d2 = 50 - 45 = 5 cm. Step 4) Now, we apply the principle of moments, which implies for the metre stick to be balanced, the moment due to the mass of the coins (r1) must be equal to the moment due to the mass of the stick itself (r2). This can be expressed mathematically as: 'r1 = m x d1' and 'r2 = M x d2'. By substituting the known values into these equations we find: Moment due to the coins, r1 = m x d1 = 10 g x 33 cm and Moment due to the mass of the scale (unknown yet), r2 = M x d2, which equals M x 5 cm. Since r1 = r2, we equate the two to find the mass of the stick (M). Step 5) After equating, you get: m x d1 = M x d2 which simplifies to 10 x 33 = M x 5. Solving this for M, (the mass of the stick) gives: M = (10 x 33) /5 = 330/5 = 66g. So, the mass of the metre stick is 66 g.",
    "Solution Outline": "Step 1) Identify known values: the mass of the two coins is 10 g, the coins are placed at the 12 cm mark, and the stick balances at the 45 cm mark. Step 2) Calculate the distance d1 from the new balance point to the coins: d1= 45 – 12 = 33 cm. Step 3) Calculate the distance d2 from the original balance point to the new one: d2 = 50 - 45 = 5 cm. Step 4) Apply the principle of moments to equalise the moment due to the coins (r1 = m x d1) and the moment due to the stick (r2 = M x d2). Step 5) Substitute the known values into r1 = r2 to derive the equation 10 x 33 = M x 5. Solve this equation for M to find that the mass of the stick, M, is 66 g."
}