{
    "Question": "11. A truck starts from rest and accelerates uniformly at 2.0 ms^(-2). At t = 10 s, a stone is dropped by a person standing on the top of the truck (6 m high from the ground). What are the (a) velocity, and (b) acceleration of the stone at t = 11s? (Neglect air resistance.)",
    "Original Solution": "Initial velocity, u = 0\r\nAcceleration, a = 2 ms^(-2),\r\nt=10 s\r\nUsing equation, v = u + at, we get\r\nv = 0 + 2 x 10 = 20 m/s\r\nThe final velocity, v = 20 m/s\r\nAt time, t = 11 sec, the horizontal component of the velocity in the absence of the air resistance remains unchanged\r\nVx =20 m/s\r\nThe vertical component of the velocity is given by the equation\r\nVy = u + ayt\r\nHere t = 11 – 10 = 1s and ay= a = 10 m/s\r\nTherefore, the resultant velocity v of the stone is\r\nv = ( vx2 + vy2)^0.5\r\nv = (20 2 + 10 2)^0.5\r\nv = 22.36 m/s\r\ntan θ = vy/vx = 10/20 = 0.5\r\nθ = tan^(-1) (0.5 ) = 26. 56 degrees from the horizontal\r\n(b) When the stone is dropped from the truck, the horizontal force on the stone is zero. The only acceleration of the stone is that due to gravity which is equal to 10 m/s^2 and it acts vertically downwards.",
    "Detailed Solution": "Step 1) We start off with what we know. The truck starts from rest, which means its initial velocity (u) is 0. It then accelerates uniformly at a rate of 2 ms^(-2) (acceleration, a), and this continues for 10 seconds (time, t). Step 2) Using the equation of motion, v = u + at, where v is final velocity, u is initial velocity, a is acceleration and t is time, we substitute our values in. This equation is used to find the final velocity after a certain time under constant acceleration. Step 3) We get v = 0 + 2 x 10 = 20 m/s. So, when the stone is being dropped, the truck's velocity is 20 m/s. This is the initial horizontal velocity of the stone once it's dropped. Step 4) After the stone is dropped, its vertical motion is independent of its horizontal motion. So for the vertical component of velocity, we use the equation Vy = u + ayt, with time, t = 11 – 10 = 1s and acceleration due to gravity, ay= a = 10 m/s. Step 5) Using Pythagoras theorem, we calculate the resultant velocity v of the stone using v = ( vx2 + vy2)^0.5 where vx and vy are the horizontal and vertical velocities respectively. This gives us v = (20 2 + 10 2)^0.5 = 22.36 m/s. This is the magnitude of the stone's velocity at t=11s. Step 6) To know the direction of this velocity, we can use basic trigonometry. tan θ = vy/vx = 10/20 = 0.5, where θ is the angle from the horizontal. We then find the angle itself with θ = tan^(-1) (0.5 ) = 26. 56 degrees. Step 7) Finally, we answer the second part of the question, which is about the stone's acceleration at t = 11s. After it's dropped, the horizontal force on the stone is zero, because gravity is the only force acting on it. So, its acceleration is only due to gravity, which is 10 m/s^2 and it's acting vertically downwards.",
    "Solution Outline": "Step 1) Set the initial conditions: initial velocity (u) is 0, the truck's acceleration (a) is 2 ms^(-2), and time (t) is 10 seconds. Step 2) Use the equation of motion, v = u + at, to find the final velocity (v). Step 3) Calculate v using the given values which gives v = 20 m/s. This is the stone's horizontal velocity when dropped. Step 4) For the vertical velocity (Vy), use the equation Vy = u + ayt with time (t) being 1s and acceleration (ay) as 10 m/s. Step 5) Combine the horizontal and vertical velocities to find the overall velocity using Pythagorean theorem v = ( vx2 + vy2)^0.5. This gives v = 22.36 m/s. Step 6) Use trigonometry to find θ which represents the angle of velocity from the horizontal. tan θ = vy/vx gives θ = 26.56 degrees. Step 7) Lastly, note that at t=11s, the stone's acceleration is only due to gravity, which equals to 10 m/s^2 vertically downwards."
}