{
    "Question": "Q32. Read each statement below carefully, and state, with reasons, if it is true or false.\r\n(a) During rolling, the force of friction acts in the same direction as the direction of motion of the CM of the body.\r\n(b) The instantaneous speed of the point of contact during rolling is zero.\r\n(c) The instantaneous acceleration of the point of contact during rolling is zero.\r\n(d) For perfect rolling motion, work done against friction is zero.\r\n(e) A wheel moving down a perfectly frictionless inclined plane will undergo slipping (not rolling) motion.",
    "Original Solution": "(a) False. The direction of frictional force is opposite to the direction of motion of the centre of mass. In the case of a rolling object, the centre of mass moves backwards, so the frictional force acts in the forward direction\r\n(b) True. During rolling, the point of the body in contact with the ground does not move ahead (this would be slipping) instead, it only touches the ground for an instant and lifts off following a curve. Thus, only if the point of contact remains in touch with the ground and moves forward will the instantaneous speed not be equal to zero.\r\n(c) False. For a rolling object, instantaneous acceleration will have a value it is not zero\r\n(d ) True. This is because during perfect rolling frictional force is zero, so work done against it is zero.\r\n(d)  True. This is because during perfect rolling frictional force is zero, so work done against it is zero.\r\n(e) True. Rolling occurs only when there is a frictional force to provide the torque, so in the absence of friction, the wheel simply slips down the plane under the influence of its weight.",
    "Detailed Solution": "Step 1) Understanding the problem: The question presents multiple statements with different concepts embedded. We are going to determine if the statements are true or false and provide the reasons behind it. Step 2) For Statement (a): 'During rolling, the force of friction acts in the same direction as the direction of motion of the Centre of Mass (CM) of the body', it is stated as false. Reason: In physics, the force of friction acts in a direction opposite to the direction of motion. When a body rolls, the CM of the body moves in one direction and the frictional force provides a retarding force in the opposite direction to prevent slipping. Step 3) For Statement (b): 'The instantaneous speed of the point of contact during rolling is zero', it is stated as true. Reason: During rolling, the point of contact is constantly changing. At any instant, the specific point in contact with the ground is momentarily at rest, thus the instantaneous speed is zero. This prevents slipping and ensures smooth rolling instead. Step 4) For Statement (c): 'The instantaneous acceleration of the point of contact during rolling is zero', it is stated as false. Reason: Even though the point of contact has zero instantaneous speed, it doesn't mean its acceleration is zero. As the points on the rolling body move along a circular path, they are constantly changing direction. This directional change represents acceleration. Step 5) For Statement (d): 'For perfect rolling motion, work done against friction is zero', it is stated as true. Reason: During perfect rolling, the motion of the body is such that there is no relative movement or slippage at the point of contact with the ground. This means frictional force does not do any work, hence, the work done against friction is zero. Step 6) For Statement (e): 'A wheel moving down a perfectly frictionless inclined plane will undergo slipping (not rolling) motion', it is stated as true. Reason: Friction brings about the turning of a wheel down an inclined plane. If the inclined plane is frictionless, the wheel won't roll but will rather slide or slip down under its weight.",
    "Solution Outline": "Step 1) Interpret the problem: It presents a series of statements for us to verify as true or false. Step 2) Analyzing Statement (a): It says that during rolling, the force of friction acts in the same direction as the motion of the CM. This is false because the frictional force opposes the motion to prevent slipping. Step 3) Analyzing Statement (b): It states that the instantaneous speed of the point of contact during rolling is zero, which is true. This happens because the point of contact is momentarily at rest during rolling. Step 4) Analyzing Statement (c): The statement contends that the instantaneous acceleration of the point of contact during rolling is zero. This is false because the constant change in direction of the points on the body means there is acceleration. Step 5) Analyzing Statement (d): The statement claims that the work done against friction is zero in case of perfect rolling. This is true because in perfect rolling, frictional force doesn’t do any work as there is no slipping. Step 6) Analyzing Statement (e): It states that a wheel slips down a perfectly frictionless inclined plane, which is true as without friction there is no torque to induce rolling and the wheel just slips down under its weight."
}