{
    "Question": "Q11. The transverse displacement of a wire (clamped at both its ends) is described as:\r\ny (x, t) = \\(\\begin{array}{l}0.06sin(\\frac{2\\pi}{3}x)cos(120\\pi t)\\end{array} \\)\r\nThe mass of the wire is 6 x 10-2 kg, and its length is 3m.\r\nProvide answers to the following questions:\r\n(i) Is the function describing a stationary wave or a travelling wave?\r\n(ii) Interpret the wave as a superposition of two waves travelling in opposite directions. Find the speed, wavelength and frequency of each wave.\r\n(iii) Calculate the wire’s tension.\r\n[X and y are in meters and t in secs]",
    "Original Solution": "We know,\r\nThe standard equation of a stationary wave is described as:\r\ny (x, t) = 2a sin kx cos ωt\r\nThe given equation y (x, t) =\\(\\begin{array}{l}0.06sin(\\frac{2\\pi}{3}x)cos(120\\pi t)\\end{array} \\) is similar to the general equation.\r\n(i) Thus, the given function describes a stationary wave.\r\n(ii) We know a wave travelling in the positive x-direction can be represented as:\r\ny1 = a sin( ωt – kx )\r\nAlso,\r\nA wave travelling in the negative x-direction is represented as:\r\ny2 = a sin( ωt + kx )\r\nSuper-positioning these two waves gives:\r\ny = y1 + y2\r\n= a sin( ωt – kx ) – a sin( ωt + kx )\r\n= asin(ωt)cos(kx) – asin(kx)cos(ωt) – asin(ωt)cos(kx) – asin(kx)cos(ωt)\r\n= – 2asin(kx)cos(ωt)\r\n= \\(\\begin{array}{l}-2asin(\\frac{2\\pi }{\\lambda }x)cos(2\\pi vt)\\end{array} \\) . . . . . . . . . . . . . . ( 1 )\r\nThe transverse displacement of the wires is described as:\r\n\\(\\begin{array}{l}0.06sin(\\frac{2\\pi}{3}x)cos(120\\pi t)\\end{array} \\)             . . . . . . . . . . . . . . . . .( 2 )\r\nComparing equations ( 1 ) and ( 2 ), we get\r\n2π/ λ = 2π/ 3\r\nTherefore, wavelength  λ = 3m\r\nAlso, 2πv/λ = 120π\r\nTherefore, speed v = 180 m/s\r\nAnd, Frequency = v/λ = 180/3\r\n= 60 Hz\r\n(iii)Given,\r\nThe velocity of the transverse wave, v = 180 m / s\r\nThe string’s mass, m = 6 × 10^-2 kg\r\nString length, l = 3 m\r\nMass per unit length of the string, μ = m/l = (6 x 10^-2 )/3\r\n= 2 x 10^-2 kg/m\r\nLet the tension in the wire be T\r\nTherefore, T = v^2 μ\r\n= 180^2 x 2 x 10^-2\r\n= 648 N.",
    "Detailed Solution": "Step 1) Recognize the structure of a stationary wave. From our studies, we know that the standard equation of a stationary wave is expressed as y (x, t) = 2a sin(kx) cos(wt). When we look at the given equation y (x, t) = 0.06sin(2π/3x)cos(120πt), we can see it matches the structure of our known stationary wave equation, except the amplitude is 0.06 instead of 2a. So, the given wave function describes a stationary wave. Step 2) The wave can be interpreted as the superposition of two waves traveling in opposite directions. We know that a wave traveling in the positive x-direction can be represented as y1 = a sin(wt - kx) and a wave traveling in the negative x-direction is represented as y2 = a sin(wt + kx). When we superposition these two waves, y = y1 + y2, we get the expression -2asin(kx)cos(wt) which is similar to our given wire displacement equation. Step 3) Comparing the resulting superposition equation to the given function of the wire displacement, we can find the wavelength λ = 3m and the speed v = 180 m/s. The frequency can also be calculated as v/λ = 60 Hz. Step 4) As for the wire's tension, we start by determining the mass per unit length of the string (μ) which is the string's mass (m) divided by the string's length (l). This gives us μ = (6 x 10^-2 )/3 = 2 x 10^-2 kg/m. We then use the equation for tension T = v^2 μ and substituting the known values, the tension in the wire equals 648 N.",
    "Solution Outline": "Step 1) Recognize that the given function matches the structure of a stationary wave equation. This informs us that our wave is stationary. Step 2) Understand that this stationary wave can be seen as the superposition of two waves traveling in opposite directions. This connects to the given function of the wire displacement. Step 3) Compare the resulting superposition equation of these two waves to the given function to find key wave characteristics such as wavelength, speed, and frequency. Step 4) Find the mass per unit length of the string and use it with the equation for tension to calculate the tension in the wire. After the calculations we find that the tension is 648 N."
}