{
    "Question": "Q. 29. A bullet fired at an angle of 30° with the horizontal hits the ground 3.0 km away. By adjusting its angle of projection, can one hope to hit a target 5.0 km away? Assume the muzzle speed to be fixed, and neglect air resistance.",
    "Original Solution": "A bullet is fired at an angle = 30°\r\nThe bullet hits the ground at a distance of 3km = 3000 m\r\nHorizontal range, R = u^2 sin2θ/g\r\n3000 = u^2 sin 600/9.8\r\nu^2 = (3000 x 9.8)/(√3/2)\r\n= 2 (3000 x 9.8)/√3 = 58800/1.732 = 33949\r\nAlso, R’ = u^2 sin 2θ/g = 5000 = (33949 x sin2θ)/9.8\r\nSin 2θ = (5000 x 9.8)/33949 = 49000/33949  =1.44\r\nThe sine of an angle cannot be more than 1. Therefore, a target 5 km away cannot be hit",
    "Detailed Solution": "Step 1) Begin by stating the known values provided in the question. The bullet is fired at an angle of 30 degrees with the horizontal and hits the ground 3 km away, which equals 3000 m. We want to find out if it is possible to hit a target 5 km (or 5000 m) away by adjusting the angle of projection. Step 2) The equation to find the horizontal range for a projectile is given by R = u^2 sin 2θ/g, where u is the initial velocity, g is the acceleration due to gravity, and θ is the firing angle. This equation comes from the physics of projectile motion. Step 3) Substitute values into the equation and solve for u^2. This gives us u^2 = (3000 x 9.8)/(√3/2), from which we simplify to get u^2 = 22960.789 m^2 per second^2. Step 4) Now let's consider the range at our new target distance (R’). The same equation is used, but instead of solving for initial velocity, we are now solving for the necessary angle, by using the equation R’ = u^2 sin 2θ/g = 5000. We will input the known parameters in order to solve for sin 2θ. Step 5) Substitute values into this equation to get sin 2θ = (5000 x 9.8)/33949 = 1.44. Step 6) It is known in math that the sine of an angle cannot be more than 1. Therefore, because our value is 1.44, which is greater than 1, it is not possible to hit a target 5 km away by adjusting the angle of projection.",
    "Solution Outline": "Step 1) Identify the known parameters: the initial firing angle, range, and the desired new range. Step 2) Use the range equation for projectile motion to solve for the bullet's initial velocity squared. Step 3) Plug the known values into the equation to calculate the initial velocity. Step 4) Use the same equation but solve for the firing angle needed to reach the new target range. Step 5) Plug values into this equation to solve for the theoretical required angle. Step 6) Recognize that the sine of an angle cannot be more than 1 and conclude that hitting a target 5 km away is not possible given the current muzzle speed."
}