{
    "Question": "Q30. A solid disc and a ring, both of radius 10 cm are placed on a horizontal table simultaneously, with an initial angular speed equal to 10 π rad s^-1. Which of the two will start to roll earlier? The coefficient of kinetic friction is µk = 0.2.",
    "Original Solution": "Given,\r\nRadii of the ring and the disc, r = 10 cm  = 0.10 m\r\nInitial angular speed, ω0 =10 π rad s–1\r\nCoefficient of kinetic friction, μk = 0.2\r\nThe motion of the two objects is caused by the force of friction. According to Newton’s second, the force of friction, f = ma\r\nμkmg= ma\r\nWhere,\r\na = Acceleration produced in the disc and the ring\r\nm = Mass\r\n a = μkg    . . . . .  .. . . . . . .  ( 1 )\r\nUsing the first equation of motion\r\nv = u + at\r\n= 0 + μkgt\r\n= μkgt       . . . . . . . . . . . . . .   ( 2 )\r\nThe frictional force applies torque in a perpendicularly outward direction and reduces the initial angular speed.\r\nTorque, T= –Iα\r\nWhere, α = Angular acceleration\r\nμkmgr = –Iα\r\n α = -μkmgr / I     . . .  . . . . . . ( 3 )\r\nAccording to the first equation of rotational motion, we have\r\nω = ω0 + αt\r\n= ω0 + (-μkmgr / I )t    . . . . . . . .( 4 )\r\nRolling starts when linear velocity, v = rω\r\nv = r (ω0 – μkmgrt / I )    …(5)\r\nUsing  equation ( 2 ) and equation ( 5 ), we have\r\nμkgt = r (ω0 – μkmgrt / I )\r\n= rω0 – μkmgr^2t / I    . . . . . . . . ( 6 )\r\nFor the ring,\r\nI = mr^2\r\nμkgt = rω0 – μkmgr^2t / mr^2\r\n= rω0 – μkgt\r\n2μkgt = rω0\r\n t = rω0 / 2μkg\r\n= ( 0.1 × 10 × 3.14) / (2 × 0.2 × 10 )  =  0.80 s    . . . . ( 7 )\r\nFor the disc, I = (1/2)mr^2\r\n∴ μkgt = rω0 – μkmgr2t / (1/2)mr2\r\n= rω0 – 2μkgt\r\n3μkgt = rω0\r\n∴ t = rω0 / 3μkg\r\n= ( 0.1 x 10 × 3.14) / (3 × 0.2 × 9.8 )  =  0.53  s   …..( 8)\r\nSince tD > tR, the disc will start rolling before the ring.",
    "Detailed Solution": "Step 1) First, let's note down the information we have from the problem. The radius of the solid disc and the ring (r) is 10 cm or 0.10 m, the initial angular speed (ω0) is 10 π rad s–1, and the coefficient of kinetic friction (μk) is 0.2. \n\nStep 2) The movement of these objects is caused by the force of friction. From Newton’s Second Law of Motion, we know that force equals mass times acceleration (f = ma). Since the force here is friction, we write it as μkmg = ma. \n\nStep 3) If we rearrange the equation to solve for the acceleration (a), we have a = μkg, where 'm' represents the mass and 'g' is the acceleration due to gravity. \n\nStep 4) Now, we refer to the first equation of motion - v = u + at - where v is final velocity, u is initial velocity and at is the product of acceleration and time. In our scenario, the initial velocity u is 0 (the objects are initially at rest), hence we can simplify the equation to v = μkgt.\n\nStep 5) The frictional force applies torque in a perpendicularly outward direction, reducing the initial angular speed. We depict this with the equation - Torque (T) = −Iα, where α is the Angular acceleration and 'I' represents rotational inertia.\n\nStep 6) By rearranging the above formula, we find that angular acceleration α = -μkmgr / I.\n\nStep 7) Applying the first equation of rotational motion, ω = ω0 + αt, we substitute α in terms of -μkmgr / I from the step above, obtaining ω =  ω0 + (-μkmgr / I )t\n\nStep 8) Rolling starts when the linear velocity equals the product of radius and angular velocity - v = rω. Plugging in ω from the previous step, we get v = r(ω0 - μkmgrt / I). \n\nStep 9) Equating v from step 4 and step 8, and simplifying the resulting equation, we get: μkgt = rω0 - μkmgr^2t / I .\n\nStep 10) To find out when does each object start rolling, we need to substitute I for each object and solve for 't'. For the ring, I = mr^2 and hence the time it would start rolling (tR) = rω0 / 2μkg = ( 0.1 × 10 × 3.14) / (2 × 0.2 × 10 ) = 0.80 s.\n\nStep 11) For the disc, the moment of inertia (I) is different, I = (1/2)mr^2. Hence the time it would start rolling (tD) = rω0 / 3μkg = ( 0.1 x 10 × 3.14) / (3 × 0.2 × 9.8 ) = 0.53 s.\n\nStep 12) Comparing the times, we see that tD < tR, implying that the disc will start to roll earlier than the ring.",
    "Solution Outline": "Step 1) Begin by noting down the given values from the problem - radius, initial angular speed and the coefficient of kinetic friction.\n\nStep 2) Understand that the motion of these objects is due to the force of friction, which according to Newton’s Second Law of motion gives us μkmg = ma.\n\nStep 3) Re-arrange to get to the acceleration, a = μkg.\n\nStep 4) Use the first equation of motion to determine the relation v = μkgt.\n\nStep 5) Realize that the frictional force lowers the initial angular speed, depicted by T = –Iα.\n\nStep 6) Solving for angular acceleration, we get α = -μkmgr / I.\n\nStep 7) Use the first equation of rotational motion and replace α in terms of other variables to obtain ω = ω0 + (-μkmgr / I )t.\n\nStep 8) Ascertain that rolling starts when linear velocity equals radius times angular velocity, substituting ω from the above step.\n\nStep 9) Equate the two expressions of v to establish one equation in terms of t: μkgt = rω0 - μkmgr^2t / I.\n\nStep 10) Substitute the moment of inertia for each object into the equation from step 9 to solve for 't' for each object.\n\nStep 11) Based on the 't' values, conclude that the disc will start to roll before the ring as it has a lesser 't'."
}