{
    "Question": "14. A Saturn year is 29.5 times the Earth year. How far is Saturn from the Sun if the Earth is 1.50 x 10^8 km away from the Sun?",
    "Original Solution": "According to Kepler’s third law of planetary motion,\\begin{array}{l}T =\\sqrt{\\frac{4\\pi ^{2}r^{3}}{GM}}\\end{array}\r\nFrom the above equation, we get T2 ∝r3\r\nTs and rs are the orbital periods and the mean distance of Saturn from the Sun, respectively.\r\nTe and re are the orbital periods and the mean distance of Earth from the Sun, respectively.\r\nThe time period of Saturn,Ts = 29.5 Te\r\n⇒rs3/re3 = Ts2/Te2\r\nrs=re(Ts/Te)2/3\r\n= 1.5 x 108 x 29.52/3\r\n= 14.3 x 108 km",
    "Detailed Solution": "Step 1) We have to solve for the distance of Saturn from the Sun, given that a Saturn year is 29.5 Earth years and the Earth is 1.50 x 10^8 km away from the Sun. Step 2) Kepler’s third law of planetary motion holds the key to this problem - T = sqrt{(4π^2)r^3/GM}. This law describes the relationship between the orbital period (T) of a planet and its average distance (r) from the Sun. Step 3) In this equation, G is the gravitational constant, M is the mass of the Sun, and the 4π^2 is a constant derived from the mathematics of a planet’s orbit. Partially simplifying the equation, we get T^2 ∝ r^3. Step 4) We denote the orbital period and the mean distance of Saturn from the Sun as Ts and rs respectively. Similar notation (Te and re) is used for Earth. Step 5) Since we know a Saturn year is 29.5 times an Earth year, we can write Ts = 29.5 Te. Step 6) From T^2 ∝ r^3, we get rs^3/re^3 = Ts^2/Te^2. This equation tells us that the ratio of the cubes of the average distances of two planets from the Sun is equal to the ratio of the squares of their orbital periods. Step 7) Isolating rs, we get rs = re(Ts/Te)^2/3. This equation allows us to solve for Saturn's mean distance from the Sun in terms of Earth's mean distance from the Sun and the ratio of their orbital periods. Step 8) Substituting known values into the formula, we get rs = 1.5 x 10^8 x (29.5)^2/3 = 14.3 x 10^8 km. Thus, we find that Saturn is approximately 14.3 x 10^8 km from the Sun.",
    "Solution Outline": "Step 1) Identify that we are given the relative length of a Saturn year, the length of an Earth year, and the distance between Earth and the Sun, and that we are trying to find the distance between Saturn and the Sun. Step 2) Refer to Kepler’s third law of planetary motion, T = sqrt{(4π^2)r^3/GM}, which connects the orbital period of a planet to its distance from the Sun. The equation simplifies to T^2 ∝ r^3. Step 3) Use the notation Ts and rs for Saturn, and Te and re for Earth to specify periods and mean distances. Step 4) Given that Ts = 29.5 Te, substitute this into the proportional relation rs^3/re^3 = Ts^2/Te^2. Step 5) Rearrange this equation into the form rs = re(Ts/Te)^2/3 that can be used to solve for rs. Step 6) Finally, substitute the given values into this equation to get the distance of Saturn from the sun."
}