{
    "Question": "Q19. Explain how:\r\n(i) A sound wave’s pressure antinode is a displacement node and vice versa.\r\n(ii) The Ganges river dolphin, despite being blind, can manoeuvre and swim around obstacles and hunt down prey.\r\n(iii) A guitar note and violin note are being played at the same frequency, however, we can still make out which instrument is producing which note.\r\n(iv) Both transverse and longitudinal waves can propagate through solids, but only longitudinal waves can move through gases.\r\n(v) In a dispersive medium, the shape of a pulse propagating through it gets distorted.",
    "Original Solution": "(i) An antinode is a point where pressure is the minimum, and the amplitude of vibration is the maximum. On the other hand, a node is a point where pressure is the maximum, and the amplitude of vibration is the minimum.(ii) The Ganges river dolphin sends out click noises which return back as a vibration, informing the dolphin about the location and distances of objects in front of it. Thus, allowing it to manoeuvre and hunt down prey with minimum vision.(iii) The guitar and the violin produce overtones of different strengths. Thus, one can differentiate between the notes coming from a guitar and a violin, even if they are vibrating at the same frequencies.(iv) Both solids and fluids have a bulk modulus of elasticity. Thus, they both allow longitudinal waves to propagate through them. However, unlike solids, gases do not have a shear modulus. Thus, transverse waves cannot pass through gases.(v) A pulse is a combination of waves of un-similar wavelengths. These waves move at different velocities in a dispersive medium. This causes distortion in its shape.",
    "Detailed Solution": "Step 1) Let's begin with the first part of the question concerning sound wave's pressure antinode and displacement node. In wave terms, an antinode is a point where pressure is at its minimum, while simultaneously, the intensity of the wave vibration or amplitude is at its maximum. This is because pressure and amplitude are inversely related. What this means is that where pressure decreases, the physical response or amplitude increases and vice versa. Now, a displacement node is where the physical response or amplitude of the wave is minimum. Thus, a pressure antinode, where amplitude is maximum, coincides with a displacement node, where amplitude is minimum. This is why a sound wave's pressure antinode is a displacement node, and vice versa. \n\nStep 2) Now, let's move onto the second part of the question, about the Ganges river dolphin. Despite being blind, this dolphin can make its way around obstacles and successfully hunt for food. This is possible due to the dolphin's exceptional use of echolocation - a biological sonar. The dolphin sends out 'click' noises, which then reflect off objects in its path and return as vibrations. These vibrations provide the dolphin with information about an object's location, size, and distance, thus helping it navigate and hunt with minimum or no vision. This explains how the Ganges river dolphin can manoeuvre despite its blindness.\n\nStep 3) The third part of the question deals with the differentiation of sounds produced by a guitar and a violin, even when they are played at the same frequency. The fact we can distinguish between these sounds lies in the concept of 'overtones.' Even when the fundamental frequency is the same for both instruments, they produce overtones of differing strengths. This creates a unique tonal color or 'timbre' for each instrument, enabling us to differentiate between their sounds. Thus, even at the same frequencies, we can make out whether a note is being played by a guitar or a violin.\n\nStep 4) The fourth part of the question talks about why both transverse and longitudinal waves can propagate through solids, but only longitudinal waves can move through gases. Both solids and fluids share a property known as the 'bulk modulus of elasticity', which permits longitudinal waves to pass through them. However, gases, unlike solids, lack something called a 'shear modulus.' This absence disables transverse waves from passing through gases, meaning only longitudinal waves can. This explains why gases only allow the propagation of longitudinal waves, whereas both wave types can pass through solids.\n\nStep 5) In the final part of the question, we are asked to explain why the shape of a pulse gets distorted as it propagates through a dispersive medium. A pulse is a mix of differing wavelength waves, and these waves do not move at the same speed within a dispersive medium. This unequal movement causes the shape of the pulse to become distorted as it travels.",
    "Solution Outline": "Step 1) A sound wave's pressure antinode is a displacement node, and vice versa, because these terms are inversely related. In other words, where pressure decreases, wave vibration or amplitude increases and vice versa.\n\nStep 2) The Ganges river dolphin can detect objects and hunt despite being blind because it uses echolocation. By emitting 'click' noises and interpreting the returning vibrations, the dolphin gathers data about objects' locations, sizes, and distances.\n\nStep 3) We can tell the difference between a guitar and a violin note played at the same frequency because of 'overtones'. Each instrument produces a distinct combination of overtones even at the same fundamental frequency, giving it a unique tonal color that allows sound differentiation.\n\nStep 4) Both transverse and longitudinal waves can move through solids due to the 'bulk modulus of elasticity,' which gases also possess, allowing for longitudinal waves to pass. However, gases lack a 'shear modulus,' so transverse waves cannot pass through them.\n\nStep 5) The distortion of a pulse as it propagates through a dispersive medium is due to the differing speeds of its component wavelengths, which causes the pulse shape to change."
}