{
    "Question": "Q21: A particle starts from the origin at t = 0 s with the velocity of \\(\\begin{array}{l}10 \\; \\hat{j} \\; m \\; s^{-1}\\end{array} \\) and moves in the x –y plane with a constant acceleration of \\(\\begin{array}{l}\\left ( 8.0 \\; \\hat{i} + 2.0 \\; \\hat{j}\\right ) \\; m \\; s^{-2}\\end{array} \\).\r\n(a) At what time is the x-coordinate of the particle 16 m? What is the y-coordinate of the particle at that time? \r\n(b) What is the speed of the particle at the time?",
    "Original Solution": "(a) Velocity of the particle = \\(\\begin{array}{l}10 \\; \\hat{j} \\; m \\; s^{-1}\\end{array} \\)\r\n\r\nAcceleration of the particle = \\(\\begin{array}{l}\\left (8.0 \\; \\hat{i} + 2.0 \\; \\hat{j}\\right) \\; m \\; s^{-2}\\end{array} \\)\r\nBut, \\(\\begin{array}{l}\\vec{a} = \\frac{\\vec{dv}}{dt} = 8.0 \\; \\hat{i} + 2.0 \\; \\hat{j}\\end{array} \\)\r\n\\(\\begin{array}{l}\\vec{dv} = \\left (8.0 \\; \\hat{i} + 2.0 \\; \\hat{j} \\right )\\ ;dt\\end{array} \\)\r\nIntegrating both sides:\r\nWhere, \\(\\begin{array}{l}\\vec{u}\\end{array} \\) = velocity vector of the particle at t = 0\r\nBut, \\(\\begin{array}{l}\\vec{v} = \\frac{\\vec{dr}}{dt}\\end{array} \\)\r\n\\(\\begin{array}{l}\\vec{dr} = \\vec{v}\\; dt\\end{array} \\)\r\n= \\(\\begin{array}{l}\\left (8.0 t \\; \\hat{i} + 2.0 t \\; \\hat{j} + \\vec{u} \\right ) \\; dt\\end{array} \\)\r\nIntegrating the equations with the conditions:\r\nAt t = 0; r = 0 and at t = t; r = r.\r\nSince the motion of the particle is confined to the x-y plane, on equating the coefficients of \\(\\begin{array}{l}\\hat{i} \\; and \\; \\hat{j}\\end{array} \\), we get\r\nt = \\(\\begin{array}{l}\\left (\\frac{x}{4} \\right)^{\\frac{1}{2}}\\end{array} \\)\r\ny = \\(\\begin{array}{l}10 t + t^{2}\\end{array} \\)\r\nWhen x = 16 m:\r\nTherefore, y = 10 × 2 + \\(\\begin{array}{l}\\left (2 \\right)^{2}\\end{array} \\) = 24 m\r\n(b) Velocity of the particle:\r\nAt t = 2 s:  \\begin{array}{l}\\vec{v} ( t ) = 16 \\; \\hat{i} + 14\\; \\hat{j}\\end{array}\r\nTherefore, the speed of the particle:  \\begin{array}{l}\\left |\\vec{v} \\right | = 21.26 \\; m \\; s^{-1}\\end{array}",
    "Detailed Solution": "Step 1) First, recognize the given values. The initial velocity is given as 10 j m/s (which signifies that the particle is moving in the y-direction), and the acceleration is given as (8.0 i + 2.0 j) m/s^2 (which signifies that the particle is experiencing constant acceleration in both x and y-directions). Step 2) The acceleration vector is given by a = dv/dt, where 'dv' is the change in velocity and 'dt' is change in time. Substitute the given acceleration into this equation to get dv = (8.0 i + 2.0 j) dt. Step 3) Integrate both sides of this equation. The integration of the left-hand side gives the change in velocity from the initial velocity at t = 0, denoted by the velocity vector 'u'. Step 4) 'v' is velocity which can also be represented as dr/dt, where 'dr' is the change in position. Substitute for 'v' to obtain dr = (8.0t i + 2.0t j + u) dt, which indicates how the position of the particle changes over time due to its velocity and acceleration. Integrate this equation to find the coefficients for i and j, which represent the x and y coordinates of the particle at any time t. Step 5) Comparing the equations for x and y coordinates, we find that the time, t, is given by (x/4)^(1/2). Also, the y coordinate is represented as y = 10t + t^2. Substituting x = 16m into these equations, we find that the time is 2s and y = 24m. Step 6) Finally, the velocity at t = 2s is v(t) = 16 i + 14 j. The speed of the particle is the magnitude of this velocity vector, which comes out to be approximately |v| = 21.26 m/s.",
    "Solution Outline": "Step 1) Identify the known values. The initial velocity is 10 j m/s and the constant acceleration is (8.0 i + 2.0 j) m/s^2. Step 2) Use the equation for acceleration, a = dv/dt, to write an equation for change in velocity, dv = (8.0 i + 2.0 j) dt, by simply replacing the acceleration with the given values. Step 3) Integrate this to get the change in velocity as a function of time. Step 4) Recognize that velocity 'v' can also be expressed as dr/dt, where 'dr' is the change in position. Substituting in the previous equation gets dr = (8.0t i + 2.0t j + u) dt, showing the change in position as a function of time. Integration helps find the x and y coordinates. Step 5) Compare coefficients to find expressions for time and y coordinate in terms of x coordinate, giving t = (x/4)^(1/2) and y = 10t + t^2. Substituting x=16m gives the time as 2s and y-coordinate as 24m. Step 6) To find the speed at this moment, calculate the velocity vector at t=2s as v(t) = 16 i + 14 j, and then determine its magnitude to get |v| = 21.26 m/s."
}