{
    "Question": "18. The bob of a pendulum is released from a horizontal position. If the length of the pendulum is 1.5 m, what is the speed with which the bob arrives at the lowermost point, given that it dissipated 5% of its initial energy against air resistance?",
    "Original Solution": "Length of the pendulum, l= 1.5 m\r\nPotential of the bob at the horizontal position = mgh = mgl\r\nThe initial energy dissipated against air resistance when the bob moves from the horizontal position to the lowermost point= 5%\r\nThe total kinetic energy of the bob at the lowermost position = 95% of the total potential energy at the horizontal position\r\n(1/2)mv^2 = (95/100) mgl\r\nv^2 =2 [(95/100) x 9.8 x 1.5]\r\n\r\nv^2 =2 ( 13.965) = 27.93\r\nv = √27.93 = 5.28 m/s",
    "Detailed Solution": "Step 1) First, identify the known values in our problem. We know that the length of the pendulum, which we'll denote as 'l', is 1.5 m. We also know that the bob dissipates 5% of its initial energy to air resistance as it swings. Step 2) We calculate the potential energy of the bob at its highest point (when it's horizontal), using the equation for gravitational potential energy, which is m * g * h. Here 'm' is mass, 'g' is the acceleration due to gravity, and 'h' is height. Considering that the bob is at the maximum height which equals to the length of the pendulum (since it's swinging from a horizontal position), the potential energy can be written as m * g * l. Step 3) The bob loses 5% of its total energy to air resistance. This means that it retains 95% of its total energy, which is converted into kinetic energy at the lowermost point of its swing. Step 4) Use this information to form the equation for kinetic energy at the bottom point, which is 1/2 * m * v^2 = (95/100) * m * g * l. Here 'v' is the final speed of the bob. Notice that 'm' is present in both sides of the equation, so it can be canceled. Step 5) Simplify this equation to get an expression for v^2, which is v^2 = 2 * [(95/100) * g * l]. Step 6) Substitute values we know into this equation: plug in 9.8 m/s^2 for 'g' and 1.5 m for 'l'. This gives us v^2 = 2 * (13.965) = 27.93. Step 7) Solve for 'v' by taking the square root of both sides, yielding v = sqrt(27.93) = 5.28 m/s. So, the speed with which the bob arrives at the lowermost point is 5.28 m/s.",
    "Solution Outline": "Step 1) Identify known quantities: pendulum length 'l' = 1.5 m and energy dissipated = 5%. Step 2) Calculate potential energy of bob at horizontal point, using the formula m * g * l. Step 3) Understand that 95% of this total potential energy is converted to kinetic energy at the lowermost point of swing due to energy loss to air resistance. Step 4) Setup an equation relating kinetic energy and potential energy: 1/2 * m * v^2 = (95/100) * m * g * l. Step 5) Simplify this equation removing 'm' from both sides to get v^2 = 2 * [(95/100) * g * l]. Step 6) Substitute the known values for 'g' = 9.8 m/s^2 and 'l' = 1.5 m into this equation. Step 7) Solve for 'v' by square rooting both sides, arriving at the final speed of the bob = 5.28 m/s."
}