{
    "Question": "Q29. A truck parked outside a petrol pump blows a horn of frequency 200 Hz in still air.  The wind then starts blowing towards the petrol pump at 20 m/s. Calculate the wavelength, speed, and frequency of the horn’s sound for a man standing at the petrol pump. Is this situation completely identical to a situation when the observer moves towards the truck at 20 m/s and the air is still?",
    "Original Solution": "For the standing observer:\r\nFrequency, νH = 200 Hz\r\nVelocity of sound, v = 340 m/s\r\nSpeed of the wind, vW = 20 m/s\r\nThe observer will hear the horn at 200 Hz itself because there is no relative motion between the observer and the truck.\r\nGiven that the wind blows in the observer’s direction at 20 m/s.\r\nEffective velocity of the sound, vE = 340 + 20 = 360 m/s\r\nThe wavelength ( λ ) of the sound :\r\nλ = vE /vH  = 360/200\r\nλ = 1.8 m\r\nFor the observer running towards the train:\r\nSpeed of the observer, vo = 20 m/s\r\nWe know,\r\nThe apparent  frequency of the sound as the observers move towards the truck is:\r\nv’ =   vH [(v + vo)/v ]\r\n=  200[ (20 + 340 )/ 340 ] =  211.764 Hz\r\nAs the air is still, the effective velocity of sound is still 340 m/s.\r\nAs the truck is stationary, the wavelength remains 1.8 m.\r\nThus, the two cases are not completely identical.",
    "Detailed Solution": "Step 1) To begin, identify the given information from the problem: the frequency of the horn (νH) is 200 Hz, the speed of sound in still air (v) is 340 m/s, and the speed of the wind (vW) is 20 m/s. Given these, we can understand that the wind is changing the conditions in which the sound wave is propagating. Step 2) Note that the frequency the observer hears (from the stationary truck) remains the same as the horn’s original frequency due to no relative motion between the observer and the truck. This is in coherence with Doppler's effect. Step 3) With the wind blowing towards the observer, the effective speed of the sound changes. It is determined by adding the speed of sound in still air and the speed of the wind, i.e., vE = v + vW = 340 m/s + 20 m/s = 360 m/s. This altered speed is due to the movement of the medium (air). Step 4) To find the wavelength of the sound (λ), we use the equation λ = vE /νH , effectively dividing the effective velocity of sound by the sound’s frequency. This gives us a wavelength of 1.8 m. Step 5) Now, consider the scenario where the observer runs towards the truck with a speed of 20 m/s. The frequency (ν') the observer perceives in this case is different from before due to the movement of the observer, calculated using the Doppler's effect formula: ν' = νH [ (v + vo) / v ], resulting in an apparent frequency of 211.764 Hz. Step 6) Given that there is no wind, the effective velocity of sound remains the unaltered at 340 m/s. And because the truck is stationary, the wavelength of the sound remains 1.8 m. Step 7) Upon comparing both cases, it is clear the circumstances are not identical. The frequencies experienced by the observer in two cases are different while the wavelengths remain the same.",
    "Solution Outline": "Step 1) Identify known values given by the problem: horn frequency (200 Hz), speed of sound in still air (340 m/s), and wind speed (20 m/s). Step 2) Since there's no relative motion between the observer and the stationary truck, the observer's perceived frequency remains the same as the horn’s original frequency. Step 3) The wind's motion impacts the effective speed of the sound, calculated as vE = v + vW. Step 4) The wavelength (λ) of the sound is determined with the equation λ = vE /νH. Step 5) Contrarily, when the observer moves towards the stationary truck at 20 m/s in still air, they perceive a different frequency due to their motion, calculated using Doppler's Effect formula. The effective velocity of the sound remains the same, 340 m/s. Step 6) Despite the observer's motion, the wavelength of the sound remains 1.8 m because the truck is stationary. Step 7) Upon comparing these two scenarios, it becomes clear that the observer's experiences are not identical: while the wavelengths remain the same, the frequencies they perceive are different."
}