{
    "Question": "7. The motion of a particle executing simple harmonic motion is described by the displacement function,x(t) = A cos (ωt + φ ).If the initial (t = 0) position of the particle is 1 cm and its initial velocity is ω cm/s, what are its amplitude and initial phase angle? The angular frequency of the particle is π s^–1. If instead of the cosine function, we choose the sine function to describe the SHM: x = B sin (ωt + α), what are the amplitude and initial phase of the particle with the above initial conditions.",
    "Original Solution": "Displacement function x(t) = A cos (ωt + φ )\r\nAt position,  t = 0;\r\nDisplacement, x(0)=1 cm\r\nInitial velocity, v=ω cm/s\r\nAngular frequency, ω=π s^−1\r\nThe given function is  x(t)=Acos(ωt+ϕ) ——–(1)\r\n1=Acos(ω×0+ϕ)=Acosϕ\r\nAcosϕ=1  —————(2)\r\nDifferentiating equation (1) w.r.t “t”\r\nVelocity, v=dx/dt\r\nv=−Aωsin(ωt+ϕ) ——(3)\r\nt = 0 and v = ω\r\n1=−Asin(ω×0+ϕ)=−Asinϕ\r\nAsinϕ=−1 ———-(4)\r\nSquaring and adding equations (2) and (4), we get:\r\nA^2(sin^2 ϕ+cos^2 ϕ)=1+1\r\nA = √2 cm\r\nDividing equation (4) by equation (2),\r\n(A sin ϕ/A cos ϕ) = -1/1\r\ntanϕ=−1\r\n⇒ ϕ=3π/4, 7π/4\r\nIf sine function is used\r\nx=Bsin(ωt+α)\r\nAt t = 0, x = 1 and v = ω we get\r\n1=Bsin(ω×0+α]=1+1\r\nBsinα=1 —- (5)\r\nVelocity, v= dx/dt = Bωcos(ωt+α)\r\ntaking v = ω\r\n1 = Bcos(ω(0)+α) = Bcos α——(6)\r\nSquaring and adding equations(5) and (6), we get:\r\nB^2[sin^2 α+cos^2 α]=1+1\r\nB^2 =2\r\nB= √2 cm\r\nDividing equation (5) by equation (6), we get:\r\nBsinα/Bcosα=1/1\r\ntanα=1\r\nTherefore, α=π/4,5π/4,……",
    "Detailed Solution": "Step 1) We are given the displacement function x(t) = A cos (ωt + φ). The variables in the function represent the following: x(t) is the displacement of the particle, A is the amplitude, ω is the angular frequency (π s^−1), and φ (phi) is the initial phase angle. Step 2) The initial position and velocity of the particle are stated in the problem: at time t = 0, the displacement x(0) is 1 cm and the velocity v is ω cm/s. Step 3) Substituting these initial conditions into the displacement function, we get A cos ϕ = 1. This equation comes from cos(0) = 1. Step 4) Next, we differentiate the displacement function with respect to time 't' to get the velocity function v = dx/dt = -Aωsin(ωt + φ). Then, we substitute the initial conditions into the velocity equation, which yields Asinϕ = -1, because sin(0) = 0. Step 5) With these two equations (Acosϕ = 1 and Asinϕ = -1), we square and add them. The left hand side will yield A^2, while the right hand side equals 2, yielding A = √2 cm. This square root is the result of applying the Pythagorean identity sin^2 φ + cos^2 φ = 1. Step 6) Next, we divide equation Asinϕ = -1 by the equation Acosϕ = 1 to get tanϕ = -1, hence ϕ = 3π/4 or 7π/4. Step 7) Now we restate the problem but now using a sine function: x(t) = B sin (ωt + α) for comparison. Step 8) Applying the initial conditions to this function, we find that Bsinα = 1. Step 9) Differentiating the sine function to find the velocity function, we find that dx/dt = Bωcos(ωt + α). Applying the initial conditions, we get Bcosα = 1. Step 10) Squaring and adding the equations Bcosα = 1 and Bsinα = 1 gives us B^2 = 2, thus B = √2 cm. Step 11) Dividing Bsinα = 1 by Bcosα = 1 gives us tanα = 1, hence α = π/4 or 5π/4",
    "Solution Outline": "Step 1) Identify the meaning of each variable in the given displacement function. Step 2) Understand the provided initial conditions: the displacement and the velocity at time t = 0. Step 3) Substituting these initial conditions into the displacement function to find a relationship involving A and φ. Step 4) Differentiate the displacement function to get the velocity function and then substitute the initial conditions into this velocity equation to get another relationship involving A and φ. Step 5) Use the equations derived in steps 3 and 4 to compute the amplitude A. Step 6) Then, use those same relationships to find the phase angle φ. Step 7) Repeat steps 3 to 6 using a new function, this time a sine function. Step 8) Again, substitute the initial conditions into this new function to get a relationship involving B and α. Step 9) Differentiate this new function to get another relationship involving B and α. Step 10) Use these equations to calculate B, the amplitude with the sine function. Step 11) Finally, use the relationships to calculate the phase angle α."
}