{
    "Question": "9. A body is initially at rest. It undergoes one-dimensional motion with constant acceleration. The power delivered to it at time t is proportional to\r\n(i) \\(\\begin{array}{l}t^{\\frac{1}{2}}\\end{array} \\)\r\n(ii) \\(\\begin{array}{l}t^{\\frac{3}{2}}\\end{array} \\)\r\n(iii) t^2 \r\n(iv) t",
    "Original Solution": "Body mass = m\r\nAcceleration = a\r\nAccording to Newton’s second law of motion,\r\nF = ma (constant)\r\nWe know that a = \\(\\begin{array}{l}\\frac{dv}{dt}\\end{array} \\) = constant\r\ndv = dt x constant\r\nOn integrating,\r\nv = \\(\\begin{array}{l}\\alpha\\end{array} \\)t \\(\\begin{array}{l}\\rightarrow\\end{array} \\) 1\r\nWhere, \\(\\begin{array}{l}\\alpha\\end{array} \\) is also a constant\r\nv \\(\\begin{array}{l}\\propto\\end{array} \\) t \\(\\begin{array}{l}\\rightarrow\\end{array} \\) 2\r\nThe relation of power is given by,\r\nP = F.v\r\nFrom equations 1 & 2,\r\nP \\(\\begin{array}{l}\\propto\\end{array} \\) t\r\nThus, from the above, we conclude that power is proportional to time.",
    "Detailed Solution": "Step 1) We are given that a body is initially at rest and it undergoes one-dimensional motion with constant acceleration. We also know that the power delivered to it at time 't' is proportional to t, t^2, t^3/2 and t^1/2. So, we have to establish the relation between power and time. \n\nStep 2) We begin by considering the standard equation for force according to Newton's second law of motion, which is F = ma, where 'm' is the mass of the body and 'a' is its acceleration. Here, acceleration is assumed to be constant. \n\nStep 3) Now, according to calculus, we know that acceleration, 'a', is derivative of velocity, 'v', with respect to time, i.e., a = dv/dt. Since acceleration is stated to be constant here, it means the rate of change of velocity with time, i.e. dv/dt is constant. \n\nStep 4) Because dv/dt is constant, we can rearrange this as dv = dt x constant. This implies that the change in velocity is equal to time multiplied by a constant value.\n\nStep 5) To find the relationship between velocity and time, we integrate both sides of the equation to get velocity, v = αt, where α is also a constant. Here, the implication is that velocity is directly proportional to time. We'll call this equation 1.\n\nStep 6) With these observations, we can determine an expression for power. Power (P) in physics is expressed as the dot product of force and velocity i.e., P = F.v.\n\nStep 7) We insert our earlier derived equations into this power equation. Hence, substituting F with ma, and v with αt (from equation 1), we find that power is derived to be proportional to time. Thus, concluding that power is in fact proportional to time.",
    "Solution Outline": "Step 1) Recall given problem details: a body at rest, undergoing one-dimensional motion with constant acceleration, and power delivered to it is proportional to t, t^2, t^3/2 and t^1/2.\n\nStep 2) Apply Newton's second law of motion equation, F = ma, where 'm' is the body's mass and 'a' is its acceleration.\n\nStep 3) Use the calculus concept that acceleration 'a' equals dv/dt (derivative of velocity with respect to time). Given acceleration is constant, dv/dt is constant.\n\nStep 4) Rearrange to dv = dt x constant, implying change in velocity equals time times a constant.\n\nStep 5) Integrate this equation, obtaining the relationship v = αt, meaning velocity is proportional to time. Call this equation 1.\n\nStep 6) Recall the formula for power P = F.v, where P represents power, F force, and v velocity.\n\nStep 7) Substitute F = ma and v = αt (from equation 1) into the power formula, yielding power proportional to time. We conclude that power is proportional to time."
}