{
    "Question": "1.The sign of work done by a force on a body is important to understand. State carefully if the following quantities are positive or negative.\r\n(a) Work done by a man in lifting a bucket out of a well by means of a rope tied to the bucket.(b) Work done by the gravitational force in the above case.(c) Work done by friction on a body sliding down an inclined plane.(d) Work done by an applied force on a body moving on a rough horizontal plane with uniformvelocity.(e) Work done by the resistive force of air on a vibrating pendulum in bringing it to rest.\r\n",
    "Original Solution": "(a) It is clear that the direction of both the force and the displacement is the same and thus, the work done on it is positive.\r\n(b) It can be noted that the displacement of the object is in an upward direction, whereas the force due to gravity is in a downward direction. Hence, the work done is negative.\r\n(c) It can be observed that the direction of motion of the object is opposite to the direction of the frictional force. So, the work done is negative.\r\n(d) The object which is moving in a rough horizontal plane faces the frictional force, which is opposite to the direction of the motion. To maintain a uniform velocity, a uniform force is applied to the object. So, the motion of the object and the applied force are in the same direction. Thus, the work done is positive.\r\n(e) It is noted that the direction of the bob and the resistive force of air which is acting on it are in opposite directions. Thus, the work done is negative.",
    "Detailed Solution": "Step 1) We begin by understanding the concept of work. In physics, work is a measure of energy transfer that occurs when an object is moved by an applied force along a displacement. The sign of work (positive or negative) is determined by the direction of both the force applied and the direction of the displacement. If they are in the same direction, the work is positive. If they are in opposite directions, the work is negative. Step 2) For the first case (a), analyze the directions involved. The man applies force to lift the bucket upwards, while the bucket also moves upwards. Hence, the force and displacement are in the same direction. By our definition from step 1, the work done here is positive. Step 3) Now, consider the second case (b). The displacement of the bucket is still upwards, but the force of gravity always pulls objects downwards, meaning the force and displacement are in opposite directions. Thus, according to our definition, the work done by the gravitational force would be negative. Step 4) In the third case (c), the frictional force acts opposite to the motion of the body on the inclined plane. Therefore, the direction of motion and the frictional force are opposite, making the work done negative. Step 5) In the fourth case (d), even though there is a frictional force that is opposite to the body’s motion on the rough horizontal plane, an external force is being applied in the direction of the motion. This force exactly counteracts the friction, allowing the body to move with a uniform velocity. Therefore, the work done by the applied force (which is in the same direction as motion) is positive. Step 6) Lastly, in the fifth case (e), the resistance or drag force by air combatting the motion of the pendulum is in the opposite direction of the motion, resulting in negative work.",
    "Solution Outline": "Step 1) Define the concept of work and its sign, which depends on the direction of the force and the direction of the displacement. Step 2) For scenario (a), the force and the displacement are in the same direction, so the work done is positive. Step 3) In scenario (b), while the displacement of the object is upwards, gravity is always pulling it downwards in the opposite direction. Hence, the work done is negative. Step 4) In scenario (c), the body is sliding down an inclined plane while the direction of the frictional force is upwards. This means that work done is negative. Step 5) Scenario (d) sees the object moving with a uniform velocity on a rough plane, so even though there is a frictional force acting against the motion, an applied force is applied in the same direction as the motion, making the work done positive. Step 6) Finally, for scenario (e), air resistance acts against the pendulum's direction of motion, making the work done here negative."
}