{
    "Question": "Q18. A solid sphere rolls down two different inclined planes of the same heights but different angles of inclination. (a) Will it reach the bottom with the same speed in each case? (b) Will it take longer to roll down one plane than the other? (c) If so, which one and why?",
    "Original Solution": "( a ) Let the mass of the ball = m\r\nLet the height of the ball = h\r\nLet the final velocity of the ball at the bottom of the plane = v\r\nAt the top of the plane, the ball possesses Potential energy = mgh\r\nAt the bottom of the plane, the ball possesses rotational and translational kinetic energies.\r\nThus, total kinetic energy = (1 / 2)mv2 + (1/2) I ω2\r\nUsing the law of conservation of energy, we have\r\n(1/2)mv2 + (1/2)Iω2 = mgh \r\nFor a solid sphere, the moment of inertia about its centre, I = ( 2 / 5 )mr2\r\nThus, equation ( i ) becomes\r\n(1 / 2)mv^2 + (1 / 2)[ (2 / 5)mr^2 ] ω^2  =  mgh\r\n(1 / 2) v^2 + ( 1/5 ) r^2 ω^2  =  gh\r\nAlso, we know v = rω\r\n We have : ( 1/2 )v^2 + ( 1/5 )v^2  =  ghv^2 ( 7/10 ) = ghv =   \\(\\begin{array}{l}\\sqrt{\\frac{10}{7}gh}\\end{array} \\)\r\nSince the height of both planes is the same, the velocity of the ball will also be the same, irrespective of which plane it is rolled down.\r\n( b )  Let the inclinations of the two planes be  θ1 and θ2, where\r\nθ1 < θ2\r\nThe acceleration of the ball as it rolls down the plane with an inclination of θ1 is\r\ng sinθ1\r\nLet R1 be the normal reaction to the sphere.\r\nSimilarly, the acceleration in the ball as it rolls down the plane with an inclination of θ2 is\r\ng sin θ2Let R2 be the normal reaction to the ball.\r\nHere, θ2 > θ1; sin θ2 > sin θ1     . . . .  ..  .. . . .. . .  ( 1 )\r\n a2 > a1        . . .. . . .. . .. . . .. . . .. . . .. . . . ( 2 )\r\nInitial velocity, u = 0\r\nFinal velocity, v = Constant\r\nUsing the first equation of motion,v = u + at\r\n t ∝ ( 1/a )\r\nFor inclination θ1 :  t1 ∝ ( 1 / a1  )\r\nFor inclination θ2 :  t2 ∝ ( 1 / a2  )\r\nAs a2 > a1  we havet2  <  t1\r\n( c )Therefore, the ball will take a greater amount of time to reach the bottom of the inclined plane having the smaller inclination.",
    "Detailed Solution": "Step 1) Start by defining the problem. In this case, our problem involves a solid sphere rolling down two different inclined planes of equal height. We're asked to determine if the sphere will reach the bottom at the same speed, and also if it might take longer to roll down one plane than the other due to the difference in their angles of inclination. To tackle these questions, it's necessary to declare certain variables: let the mass of the sphere be 'm', the height of the incline be 'h', and the eventual velocity of the sphere at the bottom of the plane be 'v'.\n\nStep 2) Calculate the potential energy of the ball at the top of the plane. Given the gravitational constant 'g', we can say that the potential energy equals mgh.\n\nStep 3) We now need to calculate the kinetic energy of the ball as it rolls down. This energy differs because it's split into two kinds: rotational kinetic energy and translational kinetic energy. The total kinetic energy is thus (1/2)mv² + (1/2)Iω².\n\nStep 4) Use the principle of conservation of energy to equate the potential energy to the total kinetic energy, which leads us to the equation (1/2)mv² + (1/2)Iω² = mgh.\n\nStep 5) But for a solid sphere, the moment of inertia about its centre can be defined as I = (2/5)mr². So substitute I = (2/5)mr² into our equation from Step 4.\n\nStep 6) We can simplify our equation further, we also know that v = rω , substituting this into our equation from Step 5, we left with v²(7/10) = gh, thus final velocity of the sphere v is given by v = √(10gh/7). Since the height of both planes is the same, the velocity of the sphere when it reaches the bottom will also be the same, regardless of the differences in their inclinations.\n\nStep 7) We look into the times it takes for the sphere to roll down the two different planes. For two planes with inclinations θ1 and θ2 (where θ1 < θ2), we can calculate the acceleration due to gravity along the plane with these inclinations as gsinθ1 and gsinθ2 respectively.\n\nStep 8) Using acceleration in the first equation of motion, we find that the time taken is directly proportional to the inverse of acceleration (t ∝ 1/a). So, for plane θ1, time t1 will be proportional to 1/a1, and for plane θ2, time t2 will be proportional to 1/a2.\n\nStep 9) Because sin θ2 > sin θ1 (since θ2 > θ1), it follows that a2 > a1. So, because t is inversely proportional to a, we can determine that t2 < t1. This tells us that the ball will take a longer time to reach the bottom if the inclination is less steep, or in other words, when it rolls down the plane with the smaller inclination.",
    "Solution Outline": "Step 1) Define our problem and necessary variables (mass 'm', height 'h', and velocity 'v').\n\nStep 2) Calculate potential energy of the ball at the top of the incline using mgh.\n\nStep 3) Calculate kinetic energy of the ball which is a sum of rotational and translational kinetic energy.\n\nStep 4) Apply conservation of energy to equate potential energy to total kinetic energy.\n\nStep 5) Substitute the moment of inertia of a solid sphere I = (2/5)mr² into the energy equation.\n\nStep 6) Further substitute and simplify, realizing the end velocity is the same on both planes because the heights are the same.\n\nStep 7) Determine the gravitational accelerations gsinθ1 and gsinθ2.\n\nStep 8) Recognize the time taken to roll down is proportional to the inverse of acceleration t ∝ 1/a.\n\nStep 9) Because sin θ2 > sin θ1, it follows that a2 > a1 hence, the ball will take longer to roll down an incline of lesser steepness."
}