{
    "Question": "6. Which of the following relationships between the acceleration a and the displacement x of a particle involve simple harmonic motion? \r\n(a) a = 0.7x \r\n(b) a = –200x^2\r\n(c) a = –10x \r\n(d) a = 100x^3",
    "Original Solution": "Condition of SHM\r\nAcceleration is directly proportional to negative of displacement of particle\r\nIf ‘a’ is acceleration\r\nx is displacement\r\nThen, for Simple Harmonic Motion,\r\na = – kx where k is constant\r\n(a) a = 0.7x\r\nThis is not in the form of a = -kx\r\nHence, this is not SHM\r\n(b) a = – 200x^2\r\nClearly, it is not SHM\r\n(c) a = -10x\r\nThis is in the form of a = -kx\r\nHence, this is SHM\r\n(d) a = 100x^3\r\nIt’s clear it is not SHM",
    "Detailed Solution": "Step 1) Let's start by identifying the known values. Here, those variables are 'a' for acceleration and 'x' for displacement. Notice that we have four given equations that represent four relationships between a and x. Step 2) We need to understand the simple harmonic motion (SHM) condition which states that acceleration is directly proportional to the negative of displacement. Mathematically this is represented by a = -kx, where k is a constant. Now we need to compare each equation given in options (a), (b), (c), and (d) with the standard SHM equation 'a = -kx' to identify which equations represent SHM. Step 3) Let's look at option (a), a = 0.7x. However, putting it into the form of a = -kx, we would have to let k = -0.7. This is not possible, as k has to be positive. Hence, this equation does not represent SHM. Step 4) Moving to option (b), a = -200x^2. The exponent on x (which is 2) disqualifies this equation from being SHM as it's not exactly in the format of 'a=-kx' where k is a positive constant. Hence, this equation does not represent SHM. Step 5) Now, looking at option (c), a = -10x. If you compare this with a = -kx, it implies that k = 10. This fits the condition of SHM, meaning that this equation does represent SHM. Step 6) Finally, let's take option (d), a = 100x^3. This doesn't fit into our SHM equation a = -kx either. The exponent on x in this equation is 3, disqualifying this equation from being SHM. Hence, this equation does not represent SHM. From the evaluations, we can conclude that the only viable candidate for simple harmonic motion is the equation from option (c)",
    "Solution Outline": "Step 1) First, recognize the known variables which are 'a' for acceleration and 'x' for displacement. Notice four different given equations that show relationships between a and x. Step 2) Remember that Simple Harmonic Motion is represented by the formula a = -kx, where k is a constant. We'll systematically compare each given equation to this standard formula. Step 3) The equation a = 0.7x in option (a) doesn't match the standard SHM formula, because here k would have to be -0.7, but k must be positive. Hence, option (a) does not represent SHM. Step 4) Option (b) has an equation a = -200x^2, which isn't in the standard SHM form due to the square on the x. Therefore, (b) does not represent SHM. Step 5) Looking at option (c), a = -10x is exactly in the form 'a=-kx' fulfilling the condition for SHM. So, option (c) represents SHM. Step 6) And finally, the equation a = 100x^3 in option (d) is not of the SHM form due to the cubic on the x. Hence, (d) isn't SHM. In conclusion, only option (c) satisfies the condition for SHM."
}