{
    "Question": "Q.16. A child running a temperature of 101F is given an antipyrin (i.e. a medicine that lowers fever) which causes an increase in the rate of evaporation of sweat from his body. If the fever is brought down to 98 F in 20 minutes, what is the average rate of extra evaporation caused by the drug? Assume the evaporation mechanism to be the only way by which heat is lost. The mass of the child is 30 kg. The specific heat of the human body is approximately the same as that of water, and the latent heat of evaporation of water at that temperature is about 580 cal g^–1.",
    "Original Solution": "The initial temperature of the child, Ti =101 F\r\nThe final temperature of the child, Tf=98F\r\nThe decrease in the temperature, △T=(101−98)= 30 F = 3×(5/9)= 1.670 C\r\nThe mass of the child, m=30 kg=30×10^3 g\r\nThe time taken to reduce the temperature, t = 20 min\r\nThe specific heat of the human body = Specific heat of water = c =1000 cal kg^-1 C^-1\r\nThe latent heat of evaporation of water, L=580 cal g^−1\r\nThe heat lost by the child is given as\r\n△θ=mc△T\r\n=30×1000× 1.67\r\n=50100 cal\r\nLet m’ be the amount of water evaporated from the child’s body in 20 min.\r\nm’ =△θ/L\r\n=(50100/580)=86.37 g\r\nTherefore, the average rate of evaporation=86.2/20\r\n=4.3 g/min.",
    "Detailed Solution": "Step 1) Let's list down the values we know from the question: The initial temperature of the child (Ti) is 101 F and the final temperature after medicine was given to the child (Tf) is 98 F. The decrease in temperature (ΔT) is (101−98)°F. Since we normally work with Celsius (C) in heat calculations, let's convert this to Celsius using the conversion formula (F-32)*(5/9) which equals 1.670 C. The mass of the child (m) is provided as 30 kg which we convert into grams (g) by multiplying by 1000 because heat calculations typically use grams for mass, so m=30*10^3 g. The time it took to reduce the temperature (t) is given as 20 minutes. The specific heat capacity (c) for the human body, approximated as water's specific heat, is c =1000 cal kg^-1 C^-1. The latent heat of evaporation for water (L), which the body uses to dissipate heat via sweat evaporation, is given as L=580 cal g^−1. Step 2) By the principle of heat transfer, the heat lost by the child's body due to the fever and drug induced sweat evaporation can be computed by the formula Δθ = mcΔT, where Δθ is the total heat lost. Substituting the known values, we get Δθ = 30*1000*1.67 = 50100 cal. This is the total amount of heat that has been lost by the child. Step 3) Next, we want to understand how much water (in weight) has been evaporated from the child’s body due to this process. We denote the mass of evaporated water by m’. According to the law of conservation of energy, the total heat lost by the body (Δθ) should be equal to the latent heat gained by water evaporation, or m’ = Δθ/L. So this gives us m’ = (50100/580) = 86.37 g. Step 4) To find the rate of evaporation, we divide the total weight of the evaporated water (m’) by the time it took to achieve that (t). This gives us the average rate of evaporation = 86.2/20 = 4.3 g/min.",
    "Solution Outline": "Step 1) From the given problem, identify and extract all known values, such as initial and final temperatures, the mass of the child, time taken, specific heat, and latent heat. Convert any units as required to standard units, which are used in the formulas (grams and Celsius in this case). Step 2) Calculate the total heat lost from the child's body by using the heat transfer formula Δθ = mcΔT, where m is the mass of the child, c is the specific heat capacity, and ΔT is the change in temperature. Substitute all known values into this formula to get the total heat lost. Step 3) Now find the mass of water evaporated from the body using energy conservation principle stating that the total heat lost should be equal to the latent heat gained due to water evaporation. Use the formula m’ = Δθ/L, where m’ is the mass of water evaporated, Δθ is the total heat lost, and L is the latent heat of water. Step 4) Finally, determine the rate of evaporation, which is the mass of water evaporated per time unit. Use the formula rate = m’/t and substitute the known values to get the rate."
}