{
    "Question": "Q. 10. A brass rod of length 50 cm and diameter 3.0 mm is joined to a steel rod of the same length and diameter. What is the change in length of the combined rod at 250 C, if the original lengths are at 40.0 C? Is there a ‘thermal stress’ developed at the junction? The ends of the rod are free to expand (Co-efficient of linear expansion of brass = 2.0 × 10^(–5) K^(–1), steel = 1.2 × 10^(–5) K^(–1) ).",
    "Original Solution": "Length of the brass rod = Length of the steel rod = L0 = 50 cm\r\nDiameter of the brass rod = Diameter of the steel rod = 3 mm\r\nThe initial temperature ( T1) = 40C\r\nThe final temperature ( T2) = 250C\r\nTherefore, the increase in temperature (∆T) = 250 – 40 =210C\r\nThe coefficient of linear expansion of brass, ∝ = 2 × 10^(-5) K^(-1)\r\nThe coefficient of linear expansion of steel, β = 1.2 × 10^(-5) K^(-1)\r\nThe final length of brass, L1\r\nL1 = Lo(1 + ∝∆T)\r\n= 50( 1 + (2 × 10^(-5) × 210))\r\n=50( 1 + 420 × 10^(-5))\r\n= 50× 1.00420\r\n= 50.21 cm\r\nIncrease in length of brass ( ∆L) = L2 – L1\r\n= 50.21 – 50\r\n= 0.21 cm\r\nFinal length of steel, L2= Lo(1 + β∆T)\r\n= 50( 1 + (1.2 × 10^(-5) × 210))\r\n= 50 × 1.00252\r\n= 50.126 cm\r\nIncrease in length ( ∆L’) = 50.126 cm – 50 cm = 0.126 cm\r\nThe total increase in the length = ∆L + ∆L’\r\n= 0.21 + 0.126\r\n= 0.336 cm",
    "Detailed Solution": "Step 1) First, we identify the known variables. We know that both the brass and steel rod are the same length and diameter, 50 cm and 3 mm respectively. The initial temperature (T1) is 40°C and the final temperature (T2) is 250°C. We're given the co-efficient of linear expansion of brass as 2.0 × 10^(-5) K^(-1) and for steel it's 1.2 × 10^(-5) K^(-1). \n\nStep 2) Now, the increase in temperature, (∆T), is calculated by subtracting T1 from T2. ∆T = T2 – T1, thus ∆T = 250 – 40, resulting in ∆T =210°C.\n\nStep 3) We are looking for the change in lengths of both rods, so we must solve it separately for each rod. Starting with the brass rod, we use its co-efficient of linear expansion and apply it to the formula L1 = L0(1 + ∝∆T). So L1 = 50(1 + 2 × 10^(-5)×210) = 50(1 + 420 × 10^(-5)) = 50× 1.00420 = 50.21 cm.\n\nStep 4) Now the increase in length of this brass rod is calculated by taking away the initial length from the final length. Increase in length of brass ( ∆L) = L1 – L0, which results in ∆L = 50.21 – 50, giving us ∆L = 0.21 cm.\n\nStep 5) We follow a similar procedure for the steel rod. We use its co-efficient of linear expansion in the formula L2= L0(1 + β∆T). Thus, L2 = 50(1 + 1.2 × 10^(-5)×210) = 50 × 1.00252 = 50.126 cm.\n\nStep 6) Similarly, we calculate the increase in length of this steel rod. Increase in length ( ∆L’) = L2 – L0, which gives us ∆L’ = 50.126 cm – 50 cm = 0.126 cm.\n\nStep 7) Finally, we add the increases in lengths of both rods to get the total increase in length = ∆L + ∆L’ = 0.21 + 0.126 = 0.336 cm.",
    "Solution Outline": "Step 1) Identify all known variables and coefficients. In this case, it includes the lengths, diameters, initial and final temperatures, and co-efficient of linear expansion for both rods.\n\nStep 2) Calculate the change in temperature, ∆T, by subtracting the initial temperature from the final temperature.\n\nStep 3) Calculate the final length of the brass rod using its co-efficient of linear expansion and the formula for thermal expansion.\n\nStep 4) Calculate the increase in the length of the brass rod itself by subtracting the original length from the final length.\n\nStep 5) Using a similar process as step 3, calculate the final length of the steel rod.\n\nStep 6) Calculate the increase in the length of the steel rod by subtracting the original length from the final length.\n\nStep 7) Lastly, to get the total change in length of the combined rod, add the increases in lengths of both rods together."
}