{
    "Question": "20. Two stars, each of one solar mass (= 2×10^30 kg), are approaching each other for a head-on collision. When they are at a distance 10^9 km, their speeds are negligible. What is the speed with which they collide? The radius of each star is 10^4 km. Assume the stars remain undistorted until they collide. (Use the known value of G.)",
    "Original Solution": "Mass of each star, M = 2 × 10^30 kg\r\nRadius of each star, R = 10^4 km = 10^7 m\r\nDistance between the stars, r = 10^9 km = 10^12m\r\nInitial potential energy of the system = -GMm/r ——–(1)\r\nTotal K.E. of the stars = 1/2Mv^2 + 1/2Mv^2 = Mv^2\r\nWhere v is the speed of stars with which they collide. The distance between the centres of the stars at collision r = 2 R.\r\nTherefore, the final potential energy of two stars when they are close to each other = -GMm/2R\r\nThus, the total energy of the two stars just before the collision\r\nE = Mv^2 -GMm/2R\r\nSince the energy is conserved, the initial energy is equal to the final energy\r\nMv^2 -GMm/2R = -GMm/r\r\nv^2 =(Gm/2R) – (Gm/r)\r\n= Gm (1/2R – 1/r)\r\n= 6.67 x 10^(-11) x 2 x 10^30 [(1/2 x 10^7) – (1/10^12)]\r\nv^2= 6.67 x 10^12\r\nv =  2.58 x 10^6 m/s",
    "Detailed Solution": "Step 1) Identify the given values. The mass of each star is given to be 2 × 10^30 kg, the radius of each star is 10^4 km (or 10^7 m in SI units), and the distance between the stars is given as 10^9 km (or 10^12 m in SI units). The initial speeds of the stars are said to be negligible. Step 2) Calculate the initial potential energy of the system using the formula for gravitational potential energy, which is -GMm/r. In this context, G is the gravitational constant, M and m are the masses of the two stars and r is their distance from each other. Step 3) Identify the equation for the total kinetic energy of the two stars as Mv^2 (since the kinetic energy of each star is 1/2Mv^2). Here, v is the speed of the stars as they collide. Step 4) At the moment of collision, the two stars are as close as they can be, with the distance between their centres being equal to twice the radius of a star. This yields a final potential energy of -GMm/2R. Step 5) Combine the kinetic and potential energy components to form the total energy of the system before the collision, which is E = Mv^2 -GMm/2R. Step 6) Since energy is conserved, set the initial potential energy equal to the final energy to get the equation Mv^2 -GMm/2R = -GMm/r. Step 7) Solve this equation for v^2 to find v^2 = Gm(1/2R - 1/r), which simplifies to v^2 = 6.67 x 10^(-11) x 2 x 10^30 [(1/2 x 10^7) - (1/10^12)]. Finally, Step 8) Simplify this result to find the collision speed v^2 = 6.67 x 10^12, yielding v = 2.58 x 10^6 m/s.",
    "Solution Outline": "Step 1) Identify the masses, radii and the distance between the two stars given in the problem. Step 2) Use the formula for gravitational potential energy, -GMm/r, to find the system's initial potential energy. Step 3) Identify the total kinetic energy of the stars using the formula Mv^2. Step 4) Calculate the final potential energy at the moment of collision using the formula -GMm/2R. Step 5) Combine the kinetic and potential energies, resulting in the total energy equation. Step 6) Ensure the energy conservation law by equating the initial and final energies. Step 7) Reorganise the resulting equation to find v^2. Step 8) Solve this final equation to find the collision speed of the two stars."
}