{
    "Question": "29. Ten one rupee coins are put on top of one another on a table. Each coin has a mass of m kg. Give the magnitude and direction of\r\n(a) the force on the 7th coin (counted from the bottom) due to all coins above it\r\n(b) the force on the 7th coin by the eighth coin \r\n(c) the reaction of the sixth coin on the seventh coin",
    "Original Solution": "(a) The force on the 7th coin is due to the weight of the three coins kept above it.\r\nWeight of one coin is mg. So the weight of three coins is 3mg\r\nForce exerted on the 7th coin is (3mg)N and the force acts vertically downwards.\r\n(b) The eighth coin is already under the weight of two coins above it and it has its own weight too. Hence, the force on the 7th coin due to the 8th coin will be the same as the force on the 7th coin by the three coins above it.\r\nTherefore, the force on the 7th coin by the 8th coin is (3mg)N and the force act vertically downwards.\r\n(c) The sixth coin is under the weight of four coins above it and experiences a downward force due to the four coins.\r\nThe total downward force on the 6th coin is 4mg\r\nApplying Newton’s third law of motion, the 6th coin will exert a reaction force upwards. Therefore, the force exerted by the 6th coin on the 7th coin is equal to 4mg and acts in the upward direction.",
    "Detailed Solution": "Step 1) Identify what the problem is asking you to find. The problem is asking us to compute the force on the 7th coin due to all the coins above it, due to the 8th coin, and the reaction of the 6th coin on the 7th. We are given that each coin has a mass of 'm' kg. Step 2) For part (a), we note that force due to gravity (weight) is given by the equation 'F = mg', where 'F' is the force, 'm' is the mass and 'g' is the acceleration due to gravity. In this case, the force on the 7th coin will be due to the weight of three coins above it. Plugging numbers into the equation, we get a force of 3mg Newton. This force is acting in the vertically downward direction, due to gravity. Step 3) For part (b), we're asked the force exerted on the 7th coin due to the 8th coin. By the same logic as above, this coin is experiencing the weight of the coins above it, plus its own weight. Thus, this results in the same force - 3mg Newton - once again acting in the vertically downward direction. Step 4) For part (c), we're asked the reaction of the 6th coin on the 7th coin. Once again utilizing the weight equation 'F = mg', computing the weight of the four coins above the 6th coin yields a force of 4mg Newton. According to Newton's third law, for every action, there is an equal and opposite reaction. Consequently, the force that the 6th coin exerts on the 7th coin is equal and opposite to the force it is experiencing from the coins above it. Thus, the reaction is 4mg Newton acting in the upwards direction.",
    "Solution Outline": "Step 1) Understand the problem and the terms it lays out, in this case, the mass of each coin and quantity to find. Step 2) For part (a), use the formula for weight F = mg to calculate the force from the three coins above the 7th coin leading to a force acting downwards of 3mg Newton. Step 3) For part (b), determine the force on the 7th coin exerted by the 8th coin. Given it has the same conditions as in part (a), it also results in a force of 3mg Newton facing downwards. Step 4) For part (c), calculate the force that the 6th coin experiences due to the four coins above using the weight formula to give us a force of 4mg Newton. Remembering Newton's third law, this corresponds to an equal upward reaction force on the 7th coin of 4mg Newton."
}