{
    "Question": "31: (a) According to the law of atmospheres density of air decreases with an increase in height y as ρ=\\(\\begin{array}{l}\\rho _{0}e^{\\frac{-y}{y_{0}}}\\end{array} \\). Where ρ0 =1.25 kg m^-3 is the density of air at sea level, and y0 is a constant. Derive this equation/law considering that the atmosphere and acceleration due to gravity remain constant.\r\n(b) A zeppelin of volume 1500 m^3 is filled with helium, and it is lifting a mass of 400 kg. Assuming that the radius of the zeppelin remains constant as it ascends. How high will it rise? [ y0 = 8000 m and ρHe =0.18 kg m^-3].",
    "Original Solution": "(a). We know that rate of decrease of density ρ of air is directly proportional to the height y.\r\ni.e., \\(\\begin{array}{l}\\frac{ d \\rho }{ d y } = \\;- \\frac{ \\rho }{ y_{ 0 }}\\end{array} \\) . . . . . . . . . . . . . . ( 1 )Where y is the constant of proportionality and the –ve sign indicates the decrease in density with an increase in height.\r\nIntegrating equation (1), we get \r\n\\(\\begin{array}{l}\\int_{\\rho _{0}}^{\\rho }\\frac{d}{\\rho } =\\; – \\int_{0}^{y } \\frac{1}{y_{0}}dy\\\\\\end{array} \\)\r\n\\(\\begin{array}{l}[log \\rho ]_{\\rho _{0}}^{\\rho } = -[\\frac{y}{y_{0}}]_{0}^{y}\\end{array} \\)\r\nWhere ρ0 = density of air at sea level, i.e., y =0\r\nOr, loge(ρ0 /ρ ) = -y/y0Therefore, \\(\\begin{array}{l}\\rho =\\rho _{0}\\;e^{\\frac{y}{y_{0}}}\\end{array} \\)\r\n\r\n(b).  Given:\r\nVolume of zeppelin  = 1500 m^3  Mass of payload, m = 400 kg\r\ny0 = 8000 m\r\nρ0 =1.25 kg m^-3\r\nDensity of helium, ρ He =0.18 kg m^-3   Density ρ = \\(\\begin{array}{l}\\frac{ Mass }{ Volume }\\end{array} \\) = \\(\\begin{array}{l}\\frac{ Mass \\;of \\;payload + Mass \\;of \\;helium }{ Volume }\\end{array} \\)\r\n\r\n= \\(\\begin{array}{l}\\frac{ 400 + 1500 \\times  0.18 }{ 1500 }\\end{array} \\)  [Mass = volume × density]  =  0.45 kg m^-3   Using equation (1), we will get\r\n\\(\\begin{array}{l}\\rho =\\rho _{0}e^{\\frac{y}{y_{0}}}\\\\\\end{array} \\)\r\n\\(\\begin{array}{l} \\\\\\Rightarrow log_{e}(\\frac{\\rho _{0}}{\\rho })= \\frac{y_{0}}{y}\\\\\\end{array} \\)\r\nOr, \\(\\begin{array}{l}\\\\y= \\frac{y_{0}}{log_{e}(\\frac{\\rho _{0}}{\\rho })}\\\\\\end{array} \\)\r\n\\(\\begin{array}{l} \\\\\\Rightarrow y= \\frac{8000}{log_{e}(\\frac{1.25}{0.45 })}\\end{array} \\)\r\nTherefore,  y ≈ 8km",
    "Detailed Solution": "Step 1) First, we need to understand the given problem. It relates the rate of decrease in the density of the air with the increase in the height. It utilizes the law of atmospheres which states that the density of air decreases as the height increases and this decrease is modeled as an exponential decay. Mathematically, this is expressed as dρ/dy = - ρ/y0. The negative sign signifies that as y (height) increases, ρ (density) decreases. y0 here is the characteristic height, or the height at which the density reduces to 1/e (approximately 0.3679) of its original value. \n\nStep 2) Next, note that this is a first-order differential equation in ρ. To solve such differential equations, we can separate variables and integrate. In this case, we integrate the expression dρ/ρ from ρ0 (density at sea level) to ρ (density at height y) and dy/y0 from 0 (sea level) to y (the height where density ρ is measured). \n\nStep 3) After integration, we have [loge ρ] evaluated from ρ0 to ρ = -(y/y0). The left side after evaluation becomes loge (ρ / ρ0). Setting it equal to the right side gives us loge (ρ0 / ρ) = y/y0.\n\nStep 4) Solving the above for ρ gives ρ = ρ0 * e^(-y/y0), which is the equation that describes how the density of air changes with height in our atmosphere.\n\nStep 5) For the second part, we are given that a zeppelin of volume 1500 m^3 is lifting a payload mass of 400 kg. The zeppelin is filled with helium, a lighter-than-air gas. As the zeppelin ascends, the volume remains constant but the density decreases. Based on the mass density relation, we find the density at which the zeppelin floats by putting the combined mass (payload + gas inside zeppelin) over the volume of the zeppelin.\n \nStep 6) Plugging in the formula for density as mass/volume, we get a density of 0.45 kg/m^3. Here, we account for the mass of the helium as well as the payload to get the overall mass.\n\nStep 7) We can then find the height at which this density is reached using the formula for density derived in the first part: ρ = ρ0 * e^(-y/y0). Solve this for y to find the height at which the zeppelin floats. \n\nStep 8) Plugging in the values for ρ, ρ0, and y0 and solving for y gives us y ≈ 8000 meters, or 8 kilometers.",
    "Solution Outline": "Step 1) Recognize that the problem sets up a first-order differential equation relating the rate of decrease of air density ρ to the height y.\n\nStep 2) Solve this differential equation to get an expression for ρ as a function of y by separating variables and integrating.\n\nStep 3) For the second part of the problem, we find the density of the zeppelin by taking its overall mass (payload + helium mass) and dividing it by the volume.\n\nStep 4) Next, we solve the expression derived in step 2 for y to get the height.\n\nStep 5) Substitute appropriate values of ρ, ρ0, and y0, to find y, which represents the height up to which the zeppelin will rise."
}