{
    "Question": "2.1 (a) What is the volume of a cube off side 1 cm? (b) What is the surface area of a cylinder of radius 2.0 cm and height 10.0 cm? (c) What is the distance traveled for a vehicle moving at 18 km/h in 1 second?",
    "Original Solution": "(a) Volume of cube, V = (1 cm)^3 = (10^{-2} m)^3 = 10^{-6} m^3\r\n(b) Surface area = curved area + area on top /base = 2πrh + 2πr^2 = 2πr (h + r)\r\nr = 2 cm = 20 mm\r\nh = 10 cm = 100 mm\r\nSurface area = 2πr (h + r) = 2 x 3.14 x 20 (100 + 20) = 15072  mm^2\r\nHence, the answer is 15072 mm^2\r\n(c) Speed of vehicle = 18 km/h\r\n1 km = 1000 m\r\n1 hr = 60 x 60 = 3600 s\r\n1 km/hr = 1000 m/3600 s = 5/18 m/s\r\n18 km/h = = (18 x 1000)/3600\r\n= 5 m/s\r\nDistance travelled by the vehicle in 1 s = 5 m",
    "Detailed Solution": "Step 1) In part (a), the volume V of a cube is given as the cube of one of its sides. Since the side is 1 cm, we calculate V = (1 cm)^3. Step 2) Because often scientific calculations use the metric system, we convert the centimeters to meters. There are 100 cm in a meter, so 1 cm is 10^{-2} m. Substituting this into the calculation, we find our result is 10^{-6} m^3.\nStep 3) For part (b), the surface area of a cylinder is composed of the curved side area and the areas of the top and bottom circles. This can be calculated using the formula 2πrh (the curved side area) + 2πr^2 (top and bottom circles), which simplifies to 2πr (h + r).\nStep 4) We are given r = 2 cm and h = 10 cm. To match the units, let's convert these into millimeters as follows: r = 20 mm and h = 100 mm. \nStep 5) Plug these values into our formula for the surface area, we obtain: Surface area = 2 x 3.14 x 20 (100 + 20) = 15072 mm^2.\nStep 6) In the last part (c), we are given a vehicle moving at a speed of 18 km/h and we want to find the distance traveled in one second. \nStep 7) We first convert the speed into more useful units. Knowing that 1 km = 1000 m and 1 hour = 60 x 60 seconds, we can convert 1 km/hr into 1000 m/3600 s = 5/18 m/s.\nStep 8) Do the same conversion for 18 km/h to get 5 m/s. This means the vehicle travels 5 meters in 1 second.",
    "Solution Outline": "Step 1) Compute the volume of a cube with side length 1 cm using cube of one of its sides. Step 2) Then convert this value from cm^3 to m^3 for standardizing the units. \nStep 3) Start solving part (b) by referring to the formula for the surface area of a cylinder, which involves summing the areas of the curved side and the two ends.\nStep 4) Convert the given radius and height from cm to mm for uniformity. \nStep 5) Substitute these converted values into the formula to get the surface area in mm^2. \nStep 6) In part (c), begin with the given speed of the vehicle in km/h.\nStep 7) Convert this speed from km/h to the equivalent m/s using a conversion factor.\nStep 8) Since we know from the conversion that the vehicle travels 5 meters every second, this is our answer for the distance traveled in 1 second."
}