{
    "Question": "Q.9. A brass wire 1.8 m long at 27 C is held taut with little tension between two rigid supports. If the wire is cooled to a temperature of –39 C, what is the tension developed in the wire, if its diameter is 2.0 mm? Co-efficient of linear expansion of brass = 2.0 × 10^(–5) K^(–1); Young’s modulus of brass = 0.91 × 10^11 Pa.",
    "Original Solution": "The initial temperature, T1=27C\r\nThe length of the brass wire at 27C, l =1.8m\r\nThe final temperature, T2=- 390C\r\nThe diameter of the wire, d=2.0mm=2×10^(−3)m\r\nThe coefficient of linear expansion of brass,α =2.0×10^(−5) K^(−1)\r\nYoung’s modulus of brass, Y=0.91×10^11 Pa\r\nYoung’s modulus is given by the relation.\r\nY= Stress / Strain\r\nY=(F/A)/ (ΔL/L)\r\nY = (F x L) /(A x ΔL)\r\nΔL=F×L/(A×Y) ……(1)\r\nWhere,\r\nF= Tension developed in the wire\r\nCross-sectional area of the wire, A = (πd^2)/4 = (π (2×10^−3)^2) / 4\r\nThe change in the length (ΔL) is given by the relation:\r\nΔL= αL(T2 -T1) …..(2)\r\nEquating equations (1) and (2), we get\r\nαL(T2−T1)=(F×L)/(A×Y)\r\nF = [αL(T2−T1) x A x Y]/L\r\nF= α(T2−T1)Yπ(d/2)2\r\n= 2×10^(−5) × (−39−27) x 0.91×10^11 ×3.14 x ((2×10^(−3)) / 2)^2\r\n= 2×10^(−5) × (- 66) x 0.91×10^11 ×3.14 ×1 x10^−6\r\n= – 377.18\r\n= – 3.77 x 10^2 N\r\n\r\nThe negative sign indicates that the tension is directed inward.\r\nHence, the tension developed in the wire is 3.77×10^2 N.",
    "Detailed Solution": "Step 1) Identify the values given in the problem. You are given: the initial length of the brass wire (l) as 1.8 meters; the initial temperature (T1) as 27 degrees Celsius; the final temperature (T2) as -39 degrees Celsius; the diameter of the wire (d) as 2.0 mm, which converts to 2×10^(−3) meters; the coefficient of linear expansion of brass (α) as 2.0×10^(−5) K^(−1); and Young’s modulus of brass (Y), which is a measure of its rigidity, as 0.91×10^11 Pascal(Pa). You are asked to find the tension developed in the wire, indicated by (F). Step 2) Understand the relationship between Young’s modulus, stress and strain. The formula to calculate Young's modulus is Y = stress / strain. Since stress is also equal to force / area (F/A) and strain is change in length over original length (ΔL/L), substitute the equations into the Young's modulus formula to get Y = (F x L) /(A x ΔL). Rearranging the equation, you get ΔL=F×L/(A×Y). In this equation, A is the cross-sectional area of the wire and can be calculated as A = (πd^2)/4 = (π(2×10^−3)^2) / 4. Step 3) Understand that the change in length of the wire (ΔL) can also be calculated using thermal expansion principles, given by the formula: ΔL= αL(T2 -T1).Step 4) Set these two equations for ΔL equal to each other to relate the the tension force in the wire (F), the change in temperature, and the physical properties of the wire. This gives you αL(T2−T1)=(F×L)/(A×Y). Solve the equation for F: F = [αL(T2−T1) x A x Y]/L, simplifying to F = α(T2−T1)Yπ(d/2)^2. Step 5) Substitute the known values into the equation to find F. F = 2×10^(−5) × (−39−27) x 0.91×10^11 ×3.14 x ((2×10^(−3)) / 2)^2, which equals = – 377.18, or – 3.77 x 10^2 N. The negative sign indicates tension is being applied in the inward direction. Thus, the tension developed in the wire is 3.77×10^2 N.",
    "Solution Outline": "Step 1) Identify the provided values and set up necessary equations. The main two equations being Young's modulus, Y = (F x L) /(A x ΔL), and the thermal expansion formula ΔL= αL(T2 -T1). Step 2) Equate the two formulas for ΔL to form a single equation that includes all variables of interest, leading to F = α(T2−T1)Yπ(d/2)², where F is the tension in the wire. Step 3) Substitute known values into the equation to solve for F, the tension in the wire. With negative sign indicating the inward direction, the tension developed is 3.77×10^2 N."
}