{
    "Question": "21. The windmill sweeps a circle of area A with its blades. If the velocity of the wind is perpendicular to the circle, find the air passing through it in time t and also the kinetic energy of the air. 25 % of the wind energy is converted into electrical energy, and v = 36 km/h, A = 30 m^2 and the density of the air is 1.2 kg m^(-3). What is the electrical power produced?\r\n",
    "Original Solution": "Area = A\r\nVelocity = V\r\nDensity = \\(\\begin{array}{l}\\rho\\end{array} \\)\r\n\r\n(a) Volume of the wind through the windmill per sec = Av\r\nMass = \\(\\begin{array}{l}\\rho\\end{array} \\)Av\r\nMass m through the windmill in time t = \\(\\begin{array}{l}\\rho\\end{array} \\)Avt\r\n(b) kinetic energy = \\(\\begin{array}{l}\\frac{1}{2}\\end{array} \\)mv^2\r\n= \\(\\begin{array}{l}\\frac{1}{2}\\end{array} \\) (\\(\\begin{array}{l}\\rho\\end{array} \\)Avt)v^2 = \\(\\begin{array}{l}\\frac{1}{2}\\end{array} \\) \\(\\begin{array}{l}\\rho\\end{array} \\)Av^3t\r\n(c) Area = 30 m^2\r\nVelocity = 36 km/h\r\nDensity of air \\(\\begin{array}{l}\\rho\\end{array} \\) = 1.2 kg m^(-3)\r\nElectric energy = 25 % of wind energy\r\n= \\(\\begin{array}{l}\\frac{25}{100}\\end{array} \\) x kinetic energy\r\n= \\(\\begin{array}{l}\\frac{1}{8}\\end{array} \\) \\(\\begin{array}{l}\\rho\\end{array} \\)Av^3t\r\nPower = \\(\\begin{array}{l}\\frac{Electric\\;energy}{Time}\\end{array} \\)\r\n= \\(\\begin{array}{l}\\frac{1}{8}\\end{array} \\) \\(\\begin{array}{l}\\frac{\\rho Av^{3}t}{t}\\end{array} \\) = \\(\\begin{array}{l}\\frac{1}{8}\\end{array} \\) \\(\\begin{array}{l}\\rho\\end{array} \\)Av^3\r\n= \\(\\begin{array}{l}\\frac{1}{8}\\end{array} \\) x 1.2 x 30 x 10^3\r\n= 4.5 x 10^3 W =4.5 kW",
    "Detailed Solution": "Step 1) First, identify the known values from the problem. We know the area A of the windmill blades is 30 m^2, the wind's velocity v is 36 km/h, and the air density ρ is 1.2 kg/m^3. We also know that 25% of the wind energy is converted to electrical energy. Step 2) Calculate the volume of wind passing through the windmill every second, which is the area A times the wind's velocity v, or Av. Step 3) From this, calculate the mass of air passing through the windmill each second by multiplying the volume of air Av by the air's density ρ, yielding ρAv. For a time of t seconds, the mass passing through will be ρAvt. Step 4) Next, compute the kinetic energy of the air, which according to the kinetic energy formula is 1/2 m v^2 where m is the mass and v is the velocity. Substituting the mass m = ρAvt into the formula results in 1/2 ρAvt v^2, and simplifying by combining like terms leaves us with 1/2 ρAv^3t. Step 5) Now that we know the kinetic energy of the wind, we can calculate the electrical energy produced by multiplying the kinetic energy by the conversion factor of 25% (or 1/4). Doing so results in 1/4 * 1/2 ρAv^3t, and simplifying this fraction to 1/8 ρAv^3t gives us the electrical energy. Step 6) Lastly, get the power produced by dividing the electrical energy by the time t, yielding 1/8 ρAv^3t / t = 1/8 ρAv^3. Plugging in the known values gives 1/8 * 1.2 * 30 * (10,000)^3 which simplifies to 4.5 x 10^3 Watts, or 4.5 kW.",
    "Solution Outline": "Step 1) Identify the known quantities: area A, velocity v, air density ρ, and the wind to electrical energy conversion rate. Step 2) Calculate the volume of wind flowing through windmill per second, using the product of A and v. Step 3) Translate this volume into mass by multiplying by air density ρ and extend over time t to get the total mass m. Step 4) Determine the kinetic energy of the wind using the kinetic energy formula and substituting ρAvt for m. Step 5) Get the electrical energy by taking the kinetic energy and multiplying by the energy conversion rate of 25%. Step 6) Divide the total electrical energy by the time t to find the power output. Substitute the known values to solve."
}