{
    "Question": "2.3 A calorie is a unit of heat (energy in transit), which equals about 4.2 J, where 1J =1 kg m^2 s^–2. Suppose we employ a system of units in which the unit of mass equals α kg, the unit of length equals β m, and the unit of time is γ s. Show that a calorie has a magnitude of 4.2 α^(–1) β^(–2) γ^2 in terms of the new units.\r\n",
    "Original Solution": "1 calorie = 4.2 J = 4.2 kg m^2 s^–2\r\nThe standard formula for the conversion is\r\nDimensional formula for energy = \\(\\begin{array}{l}\\left [ M^{1}L^{2}T^{-2} \\right ]\\end{array} \\)\r\n\r\nHere, x = 1, y = 2 and z =- 2\r\nM1 = 1 kg, L1 = 1m, T1 = 1s\r\nand M2 = α kg, L2 = β m, T2 = γ s\r\nCalorie = 4.2α^(–1) β^(–2) γ^2",
    "Detailed Solution": "Step 1) Look at the problem statement. We are given that 1 calorie is equivalent to 4.2 Joules. A Joule is represented as kilogram meters squared per second squared (kg m^2 s^–2). So, a calorie can also be represented as 4.2 kg m^2 s^–2. Step 2) We understand that we are aiming to convert these units into a new system: where the unit of mass (M) is α kg, the unit of length (L) is β m, and the unit of time (T) is γ s. Step 3) We're told that energy, which is what a calorie measures, can be represented by the dimensional formula M^1 L^2 T^-2. This is because energy depends on the mass, the square of length and time inversely proportional to the square. Recall from physics that energy is equivalent to the product of mass, the square of length divided by the square of time. Step 4) In the given formula, M1 = 1 kg, L1 = 1m, and T1 = 1s represent the standard units of mass, length, and time. On the other hand, M2 = α kg, L2 = β m, and T2 = γ s are the new units that we want to convert to. Step 5) Finally, place these values into the appropriate places in the formula. The energy becomes 4.2 times the mass to the power of -1, times the length to the power of -2, times the time to the power of 2. This simplifies to 4.2 α^(–1) β^(–2) γ^2.",
    "Solution Outline": "Step 1) Recognize that 1 calorie is equivalent to 4.2 kg m^2 s^–2. Step 2) Acknowledge the new system of units given, where mass is given in terms of α kg, length in terms of β m, and time in terms of γ s. Step 3) Understand that when dealing with energy, the dimensional formula M^1 L^2 T^-2 is used. Step 4) Set M1 = 1 kg, L1 = 1m, T1 = 1s as the old units, and M2 = α kg, L2 = β m, T2 = γ s as the new units. Step 5) Substitute these values into the energy equation to convert the units, resulting in the expression 4.2 α^(–1) β^(–2) γ^2."
}