{
    "Question": "4. One end of a string of length l is connected to a particle of mass m and the other to a small peg on a smooth horizontal table. If the particle moves in a circle with speed v the net force on the particle (directed towards the centre) is : \r\n(i) T\r\n(ii) T – mv^(2)/l \r\n(iii) T + mv^(2)/l\r\n(iv) 0\r\nT is the tension in the string. [Choose the correct alternative].",
    "Original Solution": "(i) T\r\nThe net force acting on the particle is T, and it is directed towards the centre. It provides the centripetal force required by the particle to move along a circle.",
    "Detailed Solution": "Step 1) Understand the system. In this case, we have a particle tied to one end of a string and the other end attached to a peg on a smooth horizontal table. This particle is moving in a circular path with a known speed 'v', and the string exerting a tension 'T' towards the center of the motion. Step 2) Familiarize yourself with the laws of motion. Recall that the net force on an object moving in a circle is called the centripetal force, which always points towards the center of the circle. Step 3) Consider the tension in the string. This tension (T) is serving as the 'net force' on the particle. It is this tension that provides the necessary centripetal force to keep the particle in circular motion. Step 4) Connect the concept of centripetal force with the physical context of the problem. In order for the particle to continue in circular motion, the centripetal force (net force) must be provided, which in this case is the tension in the string. Hence, the net force acting on the particle and directed towards the center is 'T' which is the tension in the string.",
    "Solution Outline": "Step 1) Comprehend that we're dealing with a particle moving in a circular path, held by a string exerting tension 'T'. Step 2) Remember the concept of 'net force' in circular motion which is called centripetal force. Step 3) Recognize that in this case, this centripetal force is provided by the tension in the string, which is holding the particle since there's no other force acting on the particle. Step 4) Deduce from the physical context of the problem that this tension 'T' is the net force acting on the particle towards the center, hence, performing the role of the necessary centripetal force for circular motion."
}