{
    "Question": "Q6. The edge of an aluminium cube is 10 cm long. One face of the cube is firmly fixed to a vertical wall. A mass of 100 kg is then attached to the opposite face of the cube. The shear modulus of aluminium is 25 GPa. What is the vertical deflection of this face?",
    "Original Solution": "Edge of the aluminium cube, L = 10 cm =10/100= 0.1 m\r\nArea of each face, A = (0.1)^2 = 0.01 m^2\r\nMass attached to the opposite face of the cube = 100 kg\r\nTangential force acting on the face, F = 100 kg = 100 x 9.8 = 980 N\r\nShear modulus, η = Tangential stress/Shearing strain\r\nShearing strain = Tangential stress/ Shear modulus\r\n= F/Aη = 980/(0.01 x 25 x 10^9) = 3.92 x 10^-6\r\nShearing strain = Lateral strain/Side of the cube\r\nLateral strain = Shearing strain x Side of the cube = 3.92 x 10^-6 x 0.1\r\n= 3.92 x 10^-7 m ≈ 4 x 10^-7 m",
    "Detailed Solution": "Step 1) We start by identifying the known values: The edge of the aluminium cube, L, is given as 10 cm. To make subsequent calculations easier, we convert this length into meters by dividing by 100. So, L = 10/100 = 0.1 m. The mass attached to the opposite face of the cube is M = 100 kg.\nStep 2) Next, we need to calculate the area, A, of each cube face. Since a cube has all sides of equal length, we can square the length of the edge to get the area. Therefore, A = (0.1)^2 = 0.1 x 0.1 = 0.01 square meters (m^2).\nStep 3) We then determine the tangential force, F, acting on the face. Upon attaching the 100 kg mass to the face, it experiences a gravitational pull, F = M * g, where g is the acceleration due to gravity, taken as 9.8 m/s^2. Substituting for M, we find that F = 100 * 9.8 = 980 Newtons (N).\nStep 4) Introduce the definition of Shear modulus, η, which is the ratio of tangential stress to shearing strain. With the formula as 'η = Tangential stress/Shearing strain', we can rearrange and find the shearing strain = Tangential stress/ Shear modulus.\nStep 5) We substitute the values of F, A, and η, into the formula of shearing strain. Therefore, Shearing strain = F/Aη = 980 N/(0.01 m^2 * 25 * 10^9 N/m^2), which simplifies down to a shearing strain value of 3.92 * 10^-6.\nStep 6) Now, we need to find out the lateral strain, which is the ratio of the change in dimension of the material to its original dimension. Based on the fact that shearing strain equals the lateral strain over the side of the cube, we calculate the lateral strain to be the product of shearing strain and side of the cube = 3.92 * 10^-6 * 0.1 m. This gives us the value 3.92 * 10^-7 m, which can be approximated to 4 * 10^-7 m. This is our final solution: the vertical deflection of the face of the cube.",
    "Solution Outline": "Step 1) Identify known values given in the problem: Edge length of the cube, L = 10 cm, and Mass, M = 100 kg. Convert length into meters for ease of calculation. \nStep 2) Compute the area of each face, A, by squaring the length of the cube's edge.\nStep 3) Calculate the force, F, exerted on the face using the mass of the attached object and the gravitational acceleration constant, g.\nStep 4) Understand the definition of Shear modulus, which is the ratio of stress to strain. Using this formula, rearrange the equation to get the formula for shear strain.\nStep 5) Substitute values of F, A, and shear modulus into the formula to calculate shearing strain.\nStep 6) Realize that the lateral strain equals the shearing strain divided by the side of the cube. Multiply the lateral strain by the side of the cube to find the vertical deflection."
}