{
    "Question": "22. A person trying to lose weight (dieter) lifts a 10 kg mass one thousand times to a height of 0.5 m each time. Assume that the potential energy lost each time she lowers the mass is dissipated. (a) How much work does she do against the gravitational force? (b) Fat supplies 3.8 × 10^7J of energy per kilogram which is converted to mechanical energy with a 20% efficiency rate. How much fat will the dieter use up?\r\n",
    "Original Solution": "Mass, m = 10 kg\r\nHeight to which the mass is lifted, h = 0.5 m\r\nNumber of times, n = 1000\r\n(a) Work done against gravitational force.\r\nW = n(mgh) = 1000 x (10 x 9.8 x 0.5) = 49000J\r\n(b) Mechanical energy supplied by 1 kg of fat = 3.8 x 10^7 x 20/100 = 0.76 x10^7 J/kg\r\nTherefore, fat used up by the dieter ={1/(0.76 x 10^7)} x 49000 = 49000/(0.76 x 10^7) = 6.45 x 10^(-3) kg",
    "Detailed Solution": "Step 1) In the problem, we are given a set of known values: the mass of the object the dieter is lifting (m=10kg), the height the object is lifted each time (h=0.5m), and the number of times the dieter lifts the object (n=1000). Step 2) We use these known values in the formula for work done against gravitational force, W = n(mgh). This formula arises from the basic physics concept that work is equal to force multiplied by distance. Here, the force is the gravitational force, which is equal to the mass of the object multiplied by the acceleration due to gravity (g) - hence the term mgh. The total work is then this quantity multiplied by the number of times the object is lifted (n). Step 3) Plugging our known values into this formula, we do the arithmetic: 1000 times (10 kg multiplied by 9.8 m/s2 multiplied by 0.5 m) to get 49000J. Step 4) The problem also informs us that each kilogram of fat supplies 3.8 x 10^7J of energy which is converted to mechanical energy with a 20% efficiency rate. Therefore, the mechanical energy supplied by fat is 20% of this amount, which we calculate as 3.8 x 10^7 x 20/100 to get 0.76 x10^7 J/kg. Step 5) Since this is how much energy one kg of fat supplies, we can find how much fat the dieter uses up by dividing the total work done by the energy supplied by 1 kg of fat. Doing this calculation, 49000/(0.76 x 10^7), we find that the dieter uses up 6.45 x 10^(-3) kg of fat.",
    "Solution Outline": "Step 1) Identify the known values of mass, height, and number of repetitions given in the problem. Step 2) Use these values in the formula for work done against gravity, W = n(mgh). Step 3) Insert values and calculate to find the total work done. Step 4) Take the information given about the amount of energy supplied by 1 kg of fat, and account for the 20% efficiency rate. Step 5) Compute the fat usage by dividing the total work done by the energy supplied by 1 kg of fat."
}