{
    "Question": "18. A cylindrical piece of cork of density of base area A and height h floats in a liquid of density ρ1. The cork is depressed slightly and then released. Show that the cork oscillates up and down simple harmonically with a period T = 2π √hρ / ρ1g where ρ is the density of cork. (Ignore damping due to viscosity of the liquid)\r\n",
    "Original Solution": "Given\r\nBase area of the cork = A\r\nHeight of the cork = h\r\nDensity of the liquid = ρ1\r\nDensity of the cork = ρ\r\nIn equilibrium:\r\nWeight of the cork = Weight of the liquid displaced by the floating cork\r\nLet the cork be depressed slightly by x. As a result, some excess water of a certain volume is displaced.\r\nThus, an extra up-thrust acts upward and provides the restoring force to the cork\r\nUp-thrust = Restoring force, F = Weight of the extra water displaced\r\nF = – (Volume * Density * g)\r\nVolume = Area * Distance through which the cork is depressed\r\nVolume = Ax\r\nTherefore,\r\nF = – Ax * ρ1g …. (1)\r\nAccording to the force law:\r\nF = kx\r\nk = F / x\r\nwhere,\r\nk is constant\r\nk = F / x = – Aρ1g ……. (2)\r\nThe time period of the oscillations of the cork:\r\nT = 2π (√m / k) ……. (3)\r\nWhere,\r\nm = Mass of the cork\r\n= Volume of the cork * Density\r\n= Base area of the cork * Height of the cork * Density of the cork\r\n= Ahρ\r\nTherefore, the expression for the time period becomes:\r\nT = 2π √(Ahρ / Aρ1g)\r\nT = 2π √(hρ / ρ1g)",
    "Detailed Solution": "Step 1) Recognize Known Values: In this problem, we know the base area of the cork (A), the height of the cork (h), the density of the liquid (ρ1), and the density of the cork (ρ). Step 2) Identify that in equilibrium, the weight of the cork equals the weight of the liquid displaced by the floating cork. This establishes a balance between the downward force (gravity) and the force exerted by the displaced liquid (buoyancy). This forms the basis of the Fluid Mechanics principle in relation to floating bodies. Step 3) Assume that the cork is depressed slightly by an amount x. When the cork is depressed, the volume of liquid displaced increases, and hence there's an increment in the up-thrust that acts upward creating the restoring force to the cork. Step 4) Define Restoring Force: Up-thrust is equivalent to the restoring force, which we denote as F. This force equals the negative of the weight of the extra water displaced, which is volume times density times gravity. Here, volume is the product of area and the distance through which the cork is depressed, which can be formulated as F = −Ax * ρ1g (Equation 1). Step 5) Apply Hooke's Force Law: According to the principle of simple harmonic motions, the force on an object is proportional to its displacement from its equilibrium position, expressed as F=kx, where k is constant and x is the amount of depression (displacement). Solving this equation for k gives us k = F / x = −Aρ1g (Equation 2). Step 6) Identify Time Period formula: Now we also know the time period of the oscillations of the cork from the standard formula for simple harmonic motion, T = 2π (√m / k) (Equation 3). In this formula, m is the mass of the cork, which is found by multiplying the volume of the cork with its density, Ahρ. Step 7) Substitute Known Values: Finally, substituting the values of m and k in Equation 3, we get the expression for the time period as T = 2π √(Ahρ / Aρ1g), which simplifies to T = 2π √(hρ / ρ1g). This is the time period with which the cork oscillates up and down.",
    "Solution Outline": "Step 1) Understand the known parameters: Base area of the cork (A), height of the cork (h), densities of the liquid (ρ1) and the cork (ρ). Step 2) Understand the equilibrium condition: weight of cork equals weight of displaced liquid. Step 3) When the cork is depressed by a distance x, extra water is displaced causing an increased up-thrust which acts as the restoring force. Step 4) The restoring force (up-thrust) is mathematically expressed as F = –Ax * ρ1g. Step 5) Hooke's law is applied, leading to equation F = kx and its solution k = F / x = −Aρ1g. Step 6) The time period formula for a simple harmonic motion (T = 2π (√m / k)) is identified. For cork, m = Ahρ. Step 7) Substituting the known values into the time period formula results in T = 2π √(Ahρ / Aρ1g) simplifying to T = 2π √(hρ / ρ1g). This represents the period of oscillation of the cork."
}