{
    "Question": "Q.3: The electrical resistance in ohms of a certain thermometer varies with temperature according to the approximate law- R = Ro[1 + α (T – To )]. The resistance is 101.6 Ω at the triple-point of water 273.16 K, and 165.5 Ω at the normal melting point of lead (600.5 K). What is the temperature when the resistance is 123.4 Ω?",
    "Original Solution": "Triple point temperature, T0 =273.16 K\r\nResistance at the triple point, R0=101.6 Ω\r\nThe normal melting point of lead, T1= 600.5 K\r\nResistance at the normal melting point, R1 =165.5 Ω\r\nAccording to approximate law,\r\nR1=R0[1+α(T1−T0)]\r\n\r\n165.5=101.6[1+α(600.5 – 273.16)]\r\n\r\n165.5=101.6[1+α(327.34)]\r\n\r\n165.5=101.6+α(101.6)(327.34)\r\n165.5=101.6+α(101.6 x 327.34)\r\nα = (165.5 – 101.6) /(101.6 x 327.34)\r\nα = 63.9/(101.6 x 327.34)​\r\nNow, when resistance is 123.4Ω, then temperature T2 is\r\nR2=R0[1+α(T2−T0)]\r\n123.4=101.6[1+α(T2 – 273.16)]\r\n\r\n123.4= 101.6[1 +(63.9/(101.6 x 327.34)) (T2 – 273.16)]\r\n\r\n123.4 = 101.6 + (63.9/327.34)(T2 – 273.16)\r\n123.4  =101.6 +  (0.195)(T2) – (0.195) (273.16)\r\n123.4  =101.6 +  (0.195)(T2) – 53.32\r\nT2 = (123.4 – 101.6 + 53.32) /0.195 = 75.12/0.195  = 385.23",
    "Detailed Solution": "Step 1) Start with identifying the given values: the temperature at the triple point of water, T0 = 273.16 K, the resistance at the triple point of water, R0 = 101.6 Ω, the temperature at the normal melting point of lead, T1 = 600.5 K and the resistance at the normal melting point of lead, R1 =165.5 Ω. These are constants in our problem. Step 2) Understand that we are trying to find the coefficient of proportionality, α, using the formula R = Ro[1 + α(T – To )] which informs us how the resistance changes with temperature. Step 3) Substitute the values of R1, Ro, T1, To and α into the formula to get: 165.5 = 101.6 [1+α(600.5 – 273.16)], which simplifies to 165.5 = 101.6 + α(101.6) * 327.34. Step 4) Solve for the unknown variable, α, by isolating it on one side of the equation: α = (165.5 – 101.6) / (101.6 * 327.34). After performing the arithmetic operations, we find α to be approximately 0.00199. Step 5) Now, we wish to find the temperature when the resistance is 123.4 Ω. Plug the known values of α, the resistance R2 = 123.4 Ω, and the previously found values of T0 and R0 into the formula: 123.4 = 101.6 [1 + (0.00199)(T2 – 273.16)]. Simplify to find T2 = (123.4 - 101.6 + 0.195 * 273.16) /  0.195 = 385.23 K. So, the temperature (T2) when the resistance (R2) reaches 123.4 Ω is approximately 385.23 K.",
    "Solution Outline": "Step 1) Identify your known values: the temperature and resistance at the triple point of water and the normal melting point of lead. Step 2) Understand you are solving for the coefficient of proportionality, α, using the resistance formula, to calculate how resistance varies with temperature. Step 3) Use the known values to form an equation using the resistance formula. Step 4) Isolate unknown variable α and perform arithmetic operations to find its value. Step 5) With α known, use the resistance formula again, along with the known resistance to find the unknown temperature value. Essentially, the steps connect through the resistance formula; first, to find the coefficient of proportionality, and later, to find the unknown temperature."
}