{
    "Question": "Q21. A solid cylinder rolls up an inclined plane of the angle of inclination 30 degrees. At the bottom of the inclined plane, the centre of mass of the cylinder has a speed of 5 m/s.\r\n(a) How far will the cylinder go up the plane?\r\n(b) How long will it take to return to the bottom?",
    "Original Solution": "Given,\r\nInitial velocity of the solid cylinder, v = 5 m/s\r\nAngle of inclination, θ = 30 degrees\r\nAssuming that the cylinder goes up to a height of h. We get\r\n( 0.5 ) mv2 + ( 0.5 ) l ω2 = mgh\r\n( 0.5 ) mv2 + ( 0.5 ) ( 0.5 mr2) ω2 = mgh\r\n3/4 mv2 = mgh (since v = rω)h = 3v2 / 4g = (3 × 52) / 4 × 9.8 = 75/39.2 = 1.913 m\r\nLet d be the distance the cylinder covers up the plane, this means\r\nsin θ = h/d\r\nd = h/sin θ  = 1.913/sin 30 = 3.826m\r\nNow, the time required to return back\r\nt = \\(\\begin{array}{l}\\sqrt{\\frac{2d(1 +\\frac{K^{2}}{r^{2}})}{gsin\\Theta }}\\end{array} \\)\r\n= \\(\\begin{array}{l}\\sqrt{\\frac{2 * 3.826 (1 +\\frac{1}{2})}{9.8\\sin30^{\\circ} }}\\end{array} \\)\r\n= 1.53 s\r\nThus, the cylinder takes 1.53 s to return to the bottom.",
    "Detailed Solution": "Step 1) Understand the problem: We are given that a solid cylinder has a starting speed of 5 m/s at the bottom of a 30 degree inclined plane. Our goal is to find out how far up the incline it will roll and how long it will take to roll back down. Step 2) Use conservation of energy: The mechanical energy of the system will be conserved because there are no external forces acting on it, and so we can equate the initial kinetic energy of the cylinder to the potential energy at its highest point. Initially, the cylinder will have kinetic energy in two forms: translational and rotational. Hence, we can write 0.5 * mv² + 0.5 * Iω² = mgh, where m is the mass of the cylinder, v is its velocity, I is its moment of inertia, ω is its angular velocity, g is the acceleration due to gravity, and h is the height to which the cylinder rolls up the slope. Step 3) Simplify the equations: The moment of inertia of a solid cylinder rotating about its center is 0.5 * mr² and the relation between angular and linear velocity is ω = v/r. Substituting the moment of inertia and the relationship between linear and angular velocities into the equation, we get 3/4 * mv² = mgh. In this step, we make use of the fact that for a solid cylinder, the ratio of kinetic energy of translation to that of rotation is always 2:1. Step 4) Solve for h: Dividing the entire equation by m and then solving for h, we get h = 3v² / 4g = (3 × 5²) / (4 × 9.8) = 1.913 m. So, the cylinder will climb a physical height of 1.913 m from the bottom of the incline. Step 5) Convert height to distance up the slope: The height h and the distance d the cylinder goes up the inclined plane are related by the equation sin θ = h/d. Solving for d, we get d = h/sin θ = 1.913/sin 30 = 3.826 m. So, the cylinder will roll 3.826 m up the incline. Step 6) Determine the time for the cylinder to roll back down: Let's consider downward as the positive direction while going back then the net acceleration of the cylinder will be a combination of its translational and rotational accelerations. The time taken can be now calculated using the formula t = √(2d * (1+ K²/r²) / gsin θ) = √( 2*3.826 * (1 + 1/2) / 9.8*sin30) = 1.53 s. Hence, the cylinder will take 1.53 s to return to the bottom of the incline.",
    "Solution Outline": "Step 1) Identify the problem: We are given the initial speed of the cylinder and the incline angle of the plane. We are to find the distance up the plane and the return time of the cylinder. Step 2) Use the conservation of energy: The initial kinetic energy (both translational and rotational) equals to the potential energy at the highest point. This gives the equation 0.5 * mv² + 0.5 * Iω² = mgh. Step 3) Simplification: Replace I with 0.5 * mr² and ω with v/r and simplify the equation to 3/4 * mv² = mgh. Step 4) Solve for height: Solving the simplified energy equation for h gives h = 3v² / 4g. Step 5) Distance up the slope: Convert h to d using the trigonometric relation between height and distance along the slope, d = h/sin θ. Step 6) Return time: The return time t is found by using the derived formula t = √(2d * (1+ K²/r²) / gsin θ)."
}