{
    "Question": "Q14. Compute the fractional change in volume of a glass slab when subjected to a hydraulic pressure of 10 atm.",
    "Original Solution": "Given,\r\nPressure acting on the glass plate, p = 10 atm = 10 × 1.013 × 10^5 Pa\r\nWe know,\r\nBulk modulus of glass, B = 37 × 10^9 Nm^–2\r\n=> Bulk modulus, B = p / (∆V/V)\r\nWhere,\r\n∆V/V = Fractional change in volume\r\n∴ ∆V/V = p / B\r\n= [ 10 × 1.013 × 10^5] / (37 × 10^9)\r\n= 2.73 × 10^ -4\r\nTherefore, the fractional change in the volume of the glass plate is 2.73 × 10^–4.",
    "Detailed Solution": "Step 1) We are given that the pressure acting on the glass slab, p is 10 atmospheric pressure. This unit of pressure is usually converted to a more standard unit, Pascal (Pa). This is done because using standard units eases calculations and comparisons. So, we convert 10 atm into Pascal using the relation 1 atm = 1.013 x 10^5 Pa, yielding p = 10 x 1.013 x 10^5 Pa. Step 2) Next, we recall that the bulk modulus of glass, denoted as 'B', is a measure of its resistance to uniform compression. The bulk modulus for glass is given to us as 37 x 10^9 Nm^–2. Step 3) We use the formula for Bulk modulus, which is B = p / (∆V/V). Here, ∆V/V is the fractional change in volume we seek. Step 4) We rearrange this equation to isolate the fractional change in volume on one side of the equation. ∆V/V = p / B. This equation provides the method to calculate the volume change ratio under certain pressure applied. Step 5) We then plug the known values into this equation and solve: ∆V/V = [10 x 1.013 x 10^5] / (37 x 10^9). The result is ∆V/V = 2.73 x 10^ -4. This is the fractional change in volume of the glass slab under the given hydraulic pressure.",
    "Solution Outline": "Step 1) Convert the given pressure in atm to Pascal (Pa). Step 2) Recognize that the Bulk modulus of glass is given. Step 3) Use the formula for Bulk modulus, B = p / (∆V/V), where ∆V/V is the unknown variable we are asked to solve for, which is the fractional change in volume. Step 4) Rearrange the equation to isolate ∆V/V on one side to get ∆V/V = p / B. Step 5) Substitute the known values of p and B into the equation to compute ∆V/V. The result of this calculation is the fractional change in the volume of the glass slab when subjected to the given hydraulic pressure."
}