{
    "Question": "2.29. A LASER is a source of very intense, monochromatic, and unidirectional beam of light. These properties of laser light can be exploited to measure long distances. The distance of the Moon from the Earth has already been determined very precisely using a laser as a source of light. A laser light beamed at the Moon takes 2.56 s to return after reflection at the Moon’s surface. How much is the radius of the lunar orbit around the Earth?\r\n",
    "Original Solution": "Time taken for the laser beam to return to Earth after reflection by the Moon’s surface = 2.56 s\r\nThe speed of laser light is c = 3 x 10^8 m/s.\r\nLet d be the distance of the Moon from the Earth,\r\nThe time taken by laser signal to reach the Moon, t = 2d/c\r\nTherefore, d = tc/2 = (2.56 x 3 x 10^8)/2 = 3.84 x 10^8 m",
    "Detailed Solution": "Step 1) The problem gives us the total round-trip time for the laser light to travel from Earth, reflect off the Moon, and return to Earth. This round-trip time is 2.56 seconds. Here, we are interested in finding the one-way travel time, hence we'll need to divide this total round-trip time by 2 to get the time it takes for the laser beam to reach the Moon from Earth. Step 2) Given that the speed of light (which is the speed of the laser light) is known to be c = 3 x 10^8 m/s, we can use the basic formula in physics that distance (d) equals speed (c) times time (t). This is represented by d = c * t. But here, we're trying to find the distance that the laser travels to the Moon, not the total round-trip distance. Also, because we've already divided the total round-trip time by 2 in the first step to get the one-way travel time, our equation becomes d = c*t/2, meaning that the distance the light travels is half of the product of the speed of light and the total time. Step 3) Now we can substitute the known values into this equation to get our answer. Plugging in c = 3 x 10^8 m/s for the speed of light and t = 2.56 seconds for the total travel time, we get: d = (2.56 s * 3 x 10^8 m/s) / 2 = 3.84 x 10^8 meters. This is the radius of the lunar orbit around the Earth. Note that we did not need to convert units here as they were already in the standard units of seconds and meters.",
    "Solution Outline": "Step 1) We start by dividing the given round-trip time of the laser light by 2 to get the one-way travel time to the Moon's surface. Step 2) Using the speed of light and this one-way time, we apply the distance formula d = c*t. To reflect that we want the one-way distance, we modify this equation to be d = c*t/2. Step 3) Plug in the known values for the speed of light and the travel time to calculate the radius of the lunar orbit which turns out to be 3.84 x 10^8 meters."
}