{
    "Question": "Q23. A man stands on a rotating platform, with his arms stretched horizontally, holding a 5 kg weight in each hand. The angular speed of the platform is 30 revolutions per minute. The man then brings his arms close to his body, with the distance of each weight from the axis changing from 90cm to 20cm. The moment of inertia of the man together with the platform may be taken to be constant and equal to 7.6 kg m^2.\r\n(a) What is his new angular speed? (Neglect friction.)\r\n(b) Is kinetic energy conserved in the process? If not, from where does the change come about?",
    "Original Solution": "( a ) Given,\r\nMass of each weight = 5 kg\r\nMoment of inertia of the man-platform system = 7.6 kg m2\r\nMoment of inertia when his arms are fully stretched to 90 cm\r\n2 × m r^2\r\n= 2 × 5 × ( 0.9 )^2\r\n= 8.1 kg m^2\r\nInitial moment of inertia of the system, Ii = 7.6 + 8.1= 15.7 kg m^2\r\nAngular speed, ωi = 30 rev / min\r\n=> Angular momentum, Li = Iiωi  =  15.7 × 30\r\n=     471    . . . . .  . . (i)\r\nMoment of inertia when he folds his hands inward to 15 cm\r\n2 × mr^2\r\n= 2 × 5 x  (0.2)^2 = 0.4kg m^2\r\nFinal moment of inertia, If = 7.6 + 0.4 = 8.0 kg m^2\r\nLet final angular speed = ωf\r\n=> Final angular momentum, Lf = Ifωf = 8.0ωf . . . . . .  (ii)\r\nAccording to the principle of  conservation of angular momentum,\r\nIiωi  =  Ifωf\r\n∴ ωf = 471/ 8  =  58.88 rev/min\r\n(b) There is a change in kinetic energy, with the decrease in the moment of inertia, kinetic energy increases. The extra kinetic energy is supplied to the system by the work done by the man folding his arms inside.",
    "Detailed Solution": "Step 1) Begin by identifying and stating the known quantities provided within the problem. These include: mass of each weight (5 kg), moment of inertia of man-platform system (7.6 kg m^2), initial and final distance of weights from the axis (90cm and 20cm accordingly), and the initial angular speed (30 revolutions/minute).\nStep 2) Calculate the initial moment of inertia when his arms are fully stretched to 90 cm using the formula for the moment of inertia of a point mass, which is I = 2 * m * r^2. Plugging the known values, we get 2 * 5 * (0.9)^2 = 8.1 kg m^2.\nStep 3) Add this value of moment of inertia to the moment of inertia of the man-platform system. The total initial moment of inertia (denote it as Ii) turns out to be 7.6 + 8.1 = 15.7 kg m^2.\nStep 4) Use the fact that the angular momentum Li equals the moment of inertia times the angular speed (Li = Ii * ωi). The initial angular momentum is therefore 15.7 * 30 = 471.\nStep 5) The man now brings his arms inwards. We calculate the new moment of inertia in a similar fashion to Step 2. Following the same formula, I = 2 * m * r^2, and substituting known values, we obtain 2 * 5 * (0.2)^2 = 0.4 kg m^2.\nStep 6) Adding this number to the moment of inertia of the man-platform system, the final moment of inertia (If) becomes 7.6 + 0.4 = 8.0 kg m^2.\nStep 7) The final angular momentum, Lf, is given by If * ωf (where ωf is the final angular speed we are trying to find).\nStep 8) From the conservation of angular momentum, we know that the initial and final angular momenta should be equal, meaning Li = Lf, or Iiωi = Ifωf. Solving this equation for ωf yields ωf = 471/8 = 58.88 rev/min.\nStep 9) In part (b), we recognize that kinetic energy of rotation changes due to the change in moment of inertia. An increase in rotational speed implies an increase in kinetic energy. As energy must be conserved, we conclude that the increase in kinetic energy must have originated from the work done by the man when he pulled his arms inwards.",
    "Solution Outline": "Step 1) Identify and state the known variables from the problem. Step 2) Calculate the initial moment of inertia when arms are fully stretched using the formula I = 2 * m * r^2. Step 3) Add this value to the moment of inertia of the man-platform system to obtain the total initial moment of inertia. Step 4) Calculate the initial angular momentum being the product of moment of inertia and angular speed. Step 5) Find the new moment of inertia when arms are brought inward using the same formula as in Step 2. Step 6) Get the final moment of inertia by adding this to the moment of inertia of the man-platform system. Step 7) Set up the equation for final angular momentum. Step 8) Apply the principle of conservation of angular momentum to find the final angular speed. Step 9) Finally, interpret the implications on kinetic energy conservation in the light of the change in moment of inertia."
}