{
    "Question": "16. Assuming the earth to be a sphere of uniform mass density, how much would a body weigh halfway down to the centre of the earth if it weighed 250 N on the surface?",
    "Original Solution": "Weight of a body on the Earth’s surface, W=mg=250 N\r\nRadius of the Earth = Re\r\nLet d be at a distance halfway to the centre of the earth, d=Re/2\r\nAcceleration due to gravity at d is given by the relation\r\ngd=(1− d/Re)g\r\ngd=(1−Re/2Re)g​\r\n=g/2\r\nWeight of the body at depth d\r\nW′=mgd\r\n=mg/2 = W/2 = 250/2\r\n=125 N",
    "Detailed Solution": "Step 1) We understand from the problem that the weight of the body on the Earth's surface is given as 250 N, denoted as W. By formula, weight W = mass (m) times gravity (g) i.e., W=mg. Here, g refers to the acceleration due to gravity on Earth's surface. Step 2) Since the Earth is a sphere, it's simply modeled by considering its radius as Re. Step 3) We want to find the weight of the body when it is halfway to the center of the Earth. Let's denote this distance as 'd'. Given that 'd' is halfway to the center, it is half the radius of the Earth (Re), i.e., d=Re/2. Step 4) The acceleration due to gravity is different at different depths within the Earth. It is given by the relation gd=(1- d/Re)g, where gd represents the acceleration due to gravity at a particular interior point 'd'. Step 5) Substituting d=Re/2 into the formula from step 4, we get gd=(1 - Re/2Re)g, which simplifies further to gd=g/2. This means that the acceleration due to gravity halfway down to the center is half of what it is at the surface. Step 6) The weight of the body at depth 'd' is given by W' = m * gd. Using the value of 'gd' from step 5, this means that W' = m * g/2, or that the weight is halved when it's halfway to the center of the Earth. Step 7) Hence the body weighs W/2 = 250/2 = 125 N halfway down to the center of the earth. This is half of the body's surface weight.",
    "Solution Outline": "Step 1) Identify weight (W) of the body on Earth's surface as 250 N, using the formula W = mass * gravity. Step 2) Model the Earth as a sphere with radius Re. Step 3) Recognize that halfway into the Earth would be a distance d equal to Re/2. Step 4) Acknowledge that acceleration due to gravity, gd, changes with Earth's depth. This is given by the formula gd=(1 - d/Re)g. Step 5) Substitute in the value for 'd' from step 3 into the formula to find that gd=g/2. Step 6) Use the value of 'gd' to calculate the weight W' of the body at depth 'd'. Consequently, W' = W/2, meaning the weight halfway down is half that on the surface. Step 7) Thus, the body weighs 125 N halfway down based on the original weight of 250 N."
}