{
    "Question": "13: How will you ‘weigh the sun’, that is, estimate its mass? The mean orbital radius of the earth around the sun is 1.5 × 10^8 km.",
    "Original Solution": "Given:\r\nEarth’s orbit, r = 1.5 × 10^11 m\r\nTime taken by the Earth for one complete revolution\r\nT = 1 year = 365.25 days\r\ni.e. T = (365.25 × 24 × 60 × 60) seconds\r\nSince, Universal gravitational constant G = 6.67 × 10^(–11) Nm^2 kg^(–2)\r\nTherefore, mass of the Sun M = \\(\\begin{array}{l}\\frac{4\\;\\pi ^{2}r^{3}}{G\\;T^{2}}\\end{array} \\)\r\n\\(\\begin{array}{l}\\\\\\Rightarrow M =\\frac{4\\times (3.14)^{2}\\times (1.5\\times 10^{11})^{3}}{(6.67\\times 10^{-11})\\times (365.25\\times 24\\times 60\\times 60)^{2}}\\end{array} \\)\r\n\\(\\begin{array}{l}\\\\\\Rightarrow M =\\frac{4\\times (3.14)^{2}\\times (1.5\\times 10^{11})^{3}}{(6.67\\times 10^{-11})\\times (365.25\\times 24\\times 60\\times 60)^{2}}\\end{array} \\)\r\n\\(\\begin{array}{l}\\\\\\Rightarrow\\end{array} \\)   \\(\\begin{array}{l}M=\\frac{1.331\\times 10^{35}}{66.425\\times 10^{3}}=2.004\\times 10^{30}\\;kg\\end{array} \\)\r\nTherefore, the estimated mass of the Sun is 2.004 × 10^30 Kg.",
    "Detailed Solution": "Step 1) The problem gives us the mean orbital radius of the earth around the sun, which is 1.5 × 10^8 km. However, our calculations need to be in meters, so we convert this value to meters, which gives us 1.5 × 10^11 m. Step 2) We also know that the time taken by the Earth for one complete revolution around the sun, T, is one year. This, however, needs to be converted to seconds for our calculations. One year is equal to 365.25 days, one day is equal to 24 hours, one hour is equal to 60 minutes, and one minute is equal to 60 seconds. Thus, one year is equivalent to 365.25 × 24 × 60 × 60 seconds. Step 3) We'll be using the universal law of gravitation to derive the formula to calculate the mass of the sun. The gravitational constant G is a key component in this law and is given as 6.67 × 10^(-11) Nm^2 kg^(-2). Step 4) The formula that calculates the mass of the sun, M, derived from the universal law of gravitation is M = 4π^2r^3 / GT^2. This formula is essentially the force of gravitation rearranged to solve for M, by using the fact that this force keeps the Earth in its orbit around the sun. Step 5) Plugging the known values into this formula, we get: M = (4 * (3.14)^2 * (1.5 * 10^11)^3) / ((6.67 * 10^(-11)) * (365.25 * 24 * 60 * 60)^2). When we simplify this calculation, we get M = 2.004 * 10^30 kg. Hence, the estimated mass of the sun is 2.004 × 10^30 Kg.",
    "Solution Outline": "Step 1) Firstly, convert the given orbital radius of the Earth around the sun from kilometers to meters, which is the unit we need for these calculations. Step 2) Convert the time taken for the Earth to complete one orbit around the sun from years to seconds, which again is the unit we need for these calculations. Step 3) Remember that the calculation involves the gravitational constant G which is a part of the universal law of gravitation. Step 4) Derive or recall the formula to calculate the mass of an object from the universal law of gravitation. Here, the formula is solved for mass, M, such that M = 4π^2r^3 / GT^2. Step 5) Enter the values obtained from Steps 1,2 and the value of G into this derived equation, which provides the formula for the mass of the sun. After simplifying these calculations, we get the mass of the sun in kilograms."
}