{
    "Question": "19. A satellite orbits the earth at the height of 400 km above the surface. How much energy must be expended to rocket the satellite out of the earth’s gravitational influence? Mass of the satellite = 200 kg; mass of the earth = 6.0×10^24 kg; radius of the earth = 6.4 × 10^6 m; G = 6.67 × 10^(–11) N m^2 kg^(–2)",
    "Original Solution": "Height of the satellite, h = 400 km = 4 × 10^5 m\r\nMass of the Earth, M = 6.0 × 10^24kg\r\nMass of the satellite, m = 200 kg\r\nRadius of the Earth, Re = 6.4 × 10^6 m\r\nTotal energy of the satellite at height h = Kinetic energy + Potential energy\r\n= (1/2)mv^2  + [ -GmMe / (Re + h) ]\r\nOrbital velocity of the satellite, \r\n\\begin{array}{l}v = \\sqrt{\\frac{GM_{e}}{R_{e}+h}}\\end{array}\r\nTotal energy of height, h = \\begin{array}{l}= \\frac{1}{2}\\frac{GM_{e}m}{R_{e}+h}-\\frac{GM_{e}m}{R_{e}+h}\\end{array}\r\nTotal Energy= \\begin{array}{l}- \\frac{1}{2}\\frac{GM_{e}m}{R_{e}+h}\\end{array}\r\nThe negative sign indicates that the satellite is bound to the earth. This is known as the binding energy of a satellite.\r\nThe energy required to send the satellite out of its orbit = – (Bound energy)\r\n= \\begin{array}{l}\\frac{1}{2}\\frac{GM_{e}m}{R_{e}+h}\\end{array}\r\nPutting values of all terms,\r\n=\\begin{array}{l}\\frac{6.67 \\times 10^{-11}\\times 6\\times 10^{24}\\times 200}{2(6.4\\times 10^{6}+4\\times 10^{5})}\\end{array} = 5.9 × 10^9 J\r\n ",
    "Detailed Solution": "Step 1) The problem provides quite a bit of information. We know that the satellite orbits the Earth at a height, h = 400 km which is 4 × 10^5 m when converted to meters for consistency. The Mass of the satellite, m = 200 kg and the Mass of the Earth, M = 6.0 × 10^24kg. The Radius of the Earth, Re = 6.4 × 10^6 m and the gravitational constant G = 6.67 × 10^(-11) N m^2 kg^(-2). We are asked to find the energy required to remove the satellite from Earth's gravitational influence.\n\nStep 2) We need to approach this problem thinking about the total energy of the satellite at its height, which is actually a sum of its kinetic and potential energy. This sum is given by the equation, E = (1/2)mv^2 -GmMe / (Re + h). Here, v is the orbital velocity of the satellite.\n\nStep 3) Before we can use this formula, we need to know the orbital velocity, v. We find this using the formula v = sqrt(GMe / (Re + h)). This equation comes from the forces acting on satellites, where gravitational force balances the force required for circular motion.\n\nStep 4) Once we have v, we plug it back into the energy formula and it simplifies to E =  -0.5*GmMe / (Re + h). The negative sign here indicates that the satellite is bound to the earth, and we call this the binding energy. \n\nStep 5) To remove a satellite from the Earth's gravitational influence, the energy required is equal to the magnitude of the binding energy, so it's E = 0.5*GmMe / (Re + h). We plug in our known values to this formula, getting E = 0.5*(6.67 × 10^(-11) N m^2 kg^(-2)) *(6.0 × 10^24kg)*(200 kg) / (6.4 × 10^6 m + 4 × 10^5 m). \n\nStep 6) Evaluating this gives us the energy required to remove the satellite from Earth's gravitational pull: E = 5.9 × 10^9 Joules.",
    "Solution Outline": "Step 1) Identify the known values given in the problem: the height of the satellite's orbit, the mass of the satellite, the mass of the Earth, the radius of the Earth, and the gravitational constant. \n\nStep 2) Recognize that the total energy of the satellite at its height is the sum of its kinetic and potential energy, given by the formula E = (1/2)mv^2 -GmMe / (Re + h).\n\nStep 3) Notice that the orbital velocity (v) is unknown and needs to be calculated using the given formula for the forces acting on satellites, v = sqrt(GMe / (Re + h)).\n\nStep 4) Substitute the calculated v value into the energy formula, letting it simplify to E =  -0.5*GmMe / (Re + h). This negative value denotes the binding energy, or how much the earth is holding onto the satellite. \n\nStep 5) The energy to remove the satellite is equal to the magnitude of the binding energy. So, substitute our known values into the equation E = 0.5*GmMe / (Re + h).\n\nStep 6) Evaluate the equation to find the amount of energy required to overcome the Earth's gravitational pull, which comes out to 5.9 × 10^9 Joules."
}