{
    "Question": "15: A body weighs 63 N on the surface of the earth. What is the gravitational force on it due to the earth at a height equal to half the radius of the earth?",
    "Original Solution": "Given:\r\nWeight of the man, W = 63 N\r\nWe know that acceleration due to gravity at height ‘h’ from the Earth’s surface is\r\ng’ = \\(\\begin{array}{l}\\frac{g}{\\left [ 1+\\left ( \\frac{h}{R_{e}} \\right ) \\right ]^{2}}\\end{array} \\)\r\nWhere g = Acceleration due to gravity on the Earth’s surface\r\nAnd, Re = Radius of the Earth\r\nFor h = \\(\\begin{array}{l}\\frac{R_{e}}{2}\\end{array} \\)\r\ng’ = \\(\\begin{array}{l}\\frac{g}{\\left [ 1+\\left ( \\frac{R_{e}}{2R_{e}} \\right ) \\right ]^{2}}\\end{array} \\)\r\n\\(\\begin{array}{l}\\\\\\Rightarrow\\end{array} \\) g’ = \\(\\begin{array}{l}\\frac{g}{\\left [ 1+\\left (\\frac{1}{2} \\right ) \\right ]^{2}}=\\frac{4}{9}\\;g\\end{array} \\)\r\n\r\nAlso, the weight of a body of mass ‘m’ kg at the height of ‘h’ meters can be represented as\r\nW’ = mg\r\n= m × \\(\\begin{array}{l}\\frac{4}{9}\\end{array} \\)g  =  \\(\\begin{array}{l}\\frac{4}{9}\\end{array} \\)mg\r\n= \\(\\begin{array}{l}\\frac{4}{9}\\end{array} \\)W\r\n= \\(\\begin{array}{l}\\frac{4}{9}\\end{array} \\) × 63  = 28 N",
    "Detailed Solution": "Step 1) Firstly, let's understand the known values. The weight of the body on the surface of the earth is given to us as 63 N. This offers us a starting point for our calculations. Step 2) Next, we need to determine how weight changes with height. For this, we have a formula: g' = g / (1 + (h/Re))^2. This equation describes the acceleration due to gravity at a height 'h' from the Earth's surface. 'g' is the acceleration due to gravity on the Earth's surface and 'Re' signifies the radius of the Earth. Step 3) The given problem specifies the height is half the radius of the Earth. We replace 'h' in the formula with Re/2. So, g' = g / [ 1+ (Re/2Re) ]^2. This instructs us how gravity changes when we are at a height equal to half the radius of the Earth. Step 4) By simplifying this equation, we get g' = g / [ 1+ (1/2) ]^2=4g/9. From this, we learn that the gravitational acceleration at half the Earth's radius is four-ninths of the surface acceleration- a significant reduction! Step 5) Now we determine the weight of the body at that height. Weight is given by the product of mass and gravitational acceleration. Recalling that mass is weight divided by surface gravity, we find that the weight of the body at the required height, W', equals to its mass times g', or W' = m * (4g/9). But since m = W/g, with W being the surface weight, we can write this as W' = (W/g) * (4g/9) = (4/9)*W. That's a weight reduction to four-ninths of the initial weight, consistent with our reduced gravity. Step 6) Lastly, we apply the numbers. Replacing W with the given 63 N, we find that the weight at half the Earth's radius is (4/9)*63 = 28 N.",
    "Solution Outline": "Step 1) Start with the given weight of the body on the Earth's surface, 63 N. Step 2) Apply the equation that describes how gravity changes with height above the Earth's surface, g' = g / (1 + (h/Re))^2. Step 3) Substitute h with Re/2 in the equation as per the problem's instruction. Step 4) Simplify to find that g' equals four-ninths of surface gravity, g. Step 5) Use the definition of weight as mass times gravity to express the new weight at height h in terms of the surface weight, W. Step 6) Substitute the given value of W to find that the weight at half the Earth's radius is 28 N."
}