{
    "Question": "1. Which of the following examples represents periodic motion? \r\n(a) A swimmer completing one (return) trip from one bank of a river to the other and back. \r\n(b) A freely suspended bar magnet displaced from its N-S direction and released. \r\n(c) A hydrogen molecule rotating about its centre of mass. \r\n(d) An arrow released from a bow.",
    "Original Solution": "(a) The swimmers motion is not periodic. The motion of the swimmer between the banks of a river is to and fro. However, it does not have a definite period. This is because the time taken by the swimmer during his back and forth journey may not be the same.\r\n(b) The motion of a freely-suspended magnet, if displaced from its N-S direction and released, is periodic. This is because the magnet oscillates about its position with a definite period of time.\r\n(c) A hydrogen molecule rotating about its centre of mass is periodic. This is because when a hydrogen molecule rotates about its centre of mass, it comes to the same position again and again after an equal interval of time.\r\n(d) An arrow released from a bow moves only in the forward direction. It does not come backward. Therefore, this motion is not periodic.",
    "Detailed Solution": "Step 1) We are firstly provided with four scenarios and asked to determine which of these represent periodic motion. So, we need to understand what periodic motion is. Periodic motion is one that repeats itself at regular intervals or periods. This means, the object in motion returns to its initial position after a fixed time period. It can include to-and-fro motion (or oscillation), circular motion, etc. Step 2) 'A' represents a swimmer making a return trip from one bank of a river to the other. While this is a to-and-fro motion, it doesn't qualify as a periodic motion. Reason being, the time taken by the swimmer to travel from bank to bank may not be the same always due to factors such as the strength of the current, the swimmer's stamina, etc., and hence lacks a definite time period. Step 3) 'B' describes a situation of a bar magnet suspended freely and displaced from its North-South direction before being released. In this case, the magnet tends to come back to its initial position (due to Earth's magnetic field) after being displaced, and this back-and-forth motion repeats after a certain time period. So, this scenario does represent periodic motion. Step 4) 'C' considers a hydrogen molecule rotating about its centre of mass. If we consider the rotation motion, the molecule returns to its original orientation after each full rotation, which happens at regular intervals of time. Thus, this is also a form of periodic motion. Step 5) 'D' relates to an arrow being released from a bow. Once shot, the arrow moves in a forward direction and doesn't return to its original position. There is no motion repeating after regular intervals. Hence, this is not a periodic motion.",
    "Solution Outline": "Step 1) Identify the nature of the motion given in each option, and understand the meaning of periodic motion. Step 2) Analyze the to-and-fro motion of the swimmer in option 'A' and find that it lacks a definite time period hence is not periodic. Step 3) Consider the oscillating motion of the bar magnet in option 'B' and note that this motion repeats after a fixed time period and so is periodic. Step 4) Look at the rotational motion of the hydrogen molecule in option 'C' and conclude that since it returns to the same position after each full rotation, it's a type of periodic motion. Step 5) Examine the forward motion of the arrow in option 'D' and understand that it doesn't return to its original position and doesn't repeat after regular time intervals, hence is not periodic motion."
}