{
    "Question": "Q20. The oxygen molecule has a mass of 5.30 × 10^(-26) kg and a moment of inertia of 1.94×10^(-46) kg m^2 about an axis through its centre perpendicular to the lines joining the two atoms. Suppose the mean speed of such a molecule in a gas is 500 m/s and that its kinetic energy of rotation is two-thirds of its kinetic energy of translation. Find the average angular velocity of the molecule",
    "Original Solution": "Given,\r\nMass of one oxygen molecule, m = 5.30 × 10^(–26) kg\r\nThus, the mass of each oxygen atom = m/2\r\nMoment of inertia of it, I = 1.94 × 10^(–46) kg m^2\r\nVelocity of the molecule, v = 500 m/s\r\nThe distance between the two atoms in the molecule = 2r\r\nThus, the moment of inertia I is calculated as\r\nl =(m/2)r^2 + (m/2)r^2 = mr^2, r = ( I / m)1/2\r\n=> (1.94 × 10^(-46) / 5.36 × 10^(-26) )^(1/2)  =  0.60 × 10^(-10) m\r\nGiven,\r\nK.Erot = (2/3)K.Etrans\r\n(1/2) I ω^2 = (2/3) × (1/2) × mv^2mr^2ω^2 = (2/3)mv^2\r\nTherefore,ω = (2/3)1/2 (v/r)\r\n= (2/3)^(1/2) × (500 / 0.6 × 10^(-10)) = 6.88 × 10^12 rad/s.",
    "Detailed Solution": "Step 1) We are given the mass of one oxygen molecule as m = 5.30 × 10^(–26) kg. Since an oxygen molecule consists of two oxygen atoms, the mass of each oxygen atom would be half the total mass, or m/2. Step 2) The moment of inertia of the molecule, symbolized as I, is also given as 1.94 × 10^(–46) kg m^2. This moment of inertia is about an axis through its centre perpendicular to the lines joining the two atoms. Step 3) The average speed of the molecule, v, is given as 500 m/s. Step 4) Assuming the distance between the two atoms can be represented as 2r. We can use the formula for moment of inertia here to get l = (m/2)r^2 + (m/2)r^2 = mr^2. From this, we can solve for r to find the distance between the atoms as r = (I / m)^(1/2). Hence, r = (1.94 × 10^(-46) / 5.36 × 10^(-26))^(1/2) = 0.60 × 10^(-10) m. Step 5) We also know about kinetic energy. The kinetic energy of rotation (K.Erot) is said to be two-thirds of the kinetic energy of translation (K.Etrans). Mathematically, this can be written as (1/2) I ω^2 = (2/3) × (1/2) × mv^2. We can simplify both sides, leading to mr^2ω^2 = (2/3)mv^2. Step 6) Finally, when we solve this last equation for ω, the average angular velocity, we find ω = (2/3)^(1/2) × (500 / 0.6 × 10^(-10)) = 6.88 × 10^12 rad/s.",
    "Solution Outline": "Step 1) First, identify the given values including the mass of an oxygen molecule and its moment of inertia. Step 2) Determine the mass of an individual oxygen atom (which is half of the molecule's mass). Step 3) Understand and acknowledge the average speed of the molecule that is provided. Step 4) To find the distance between the atoms, use the formula of moment of inertia. Then solve for r in terms of the given values. Step 5) The relationship between the rotational and translational kinetic energy is given. Use this to develop an equation involving the moment of inertia, mass, velocity, and angular velocity. Step 6) Solve the equation for the average angular velocity."
}