{
    "Question": "Q26.​ Earthquakes generate sound waves inside the earth. Unlike a gas, the earth can experience both transverse (S) and longitudinal (P) sound waves. Typically the speed of the S wave is about 4.0 km s^–1, and that of the P wave is 8.0 km s^–1. A seismograph records P and S waves from an earthquake. The first P wave arrives 4 min before the first S wave. Assuming the waves travel in a straight line, at what distance does the earthquake occur?",
    "Original Solution": "Let the speeds of S and P be v1 and v2, respectively. The time taken by the S and P waves to reach the position of the seismograph is t1 and t2, respectively\r\nl = v1t1 = v2t2\r\nThe speed of S wave, v1=4.0 km s^–1\r\nThe speed of P wave, v2= 8.0 km s^–1\r\n4t1 = 8t2\r\nt1 = 2t2\r\nThe first P wave arrives 4 min before the S wave.\r\nt1 – t2 = 4 min = 4 x 60 s = 240 s\r\n2t2 – t2 = 240 s\r\nt2 = 240 s\r\nt1 = 2t2 = 2 x 240 = 480 s\r\nTherefore, the distance at which the earthquake occurs, l = v1t1 = 4 x 480 = 1920 km.",
    "Detailed Solution": "Step 1) Assign the speeds of the S and P waves as v1 and v2, respectively. This allows us to differentiate between the two types of waves since they have different speeds. In this scenario, v1=4.0 km s^–1 and v2=8.0 km s^–1. Step 2) Define the time taken by these waves as t1 for the S wave and t2 for the P wave. This will allow us to establish an equation in terms of these variables. Step 3) We know that the distance traveled by the wave is equivalent to speed multiplied by time. Applying this knowledge, we can form the equation l = v1t1 = v2t2 where l represents the distance of the earthquake. Step 4) Substitute v1 and v2 with their respective values to get the equation 4t1 = 8t2. Rearrange this to get the relationship between t1 and t2, resulting in t1 = 2t2. This equation is telling us that the time taken for the S wave to reach the seismograph is twice the time taken by the P wave. Step 5) It is mentioned that the P wave arrives 4 minutes before the S wave, that is, the difference of their time is 4 minutes or 240 seconds. Hence, we set t1 – t2 = 240s which eventually gives t2 = 240s by substituting the relationship of t1 and t2 from our previous step. Step 6) We substitute back t2 in the equation t1 = 2t2 to get t1 = 480s. Step 7) Finally, we use the distance formula, l = v1t1, substituting the values of v1 and t1 to get l = 1920km which represents the distance the earthquake occurred.",
    "Solution Outline": "Step 1) Start by assigning the speeds of the S and P waves to the variables v1 and v2 respectively. Step 2) Define the time variables, t1 for the S wave and t2 for the P wave. Step 3) Develop an initial equation for distance l, given by l = v1t1 = v2t2. Step 4) From the given wave speed values, derive an equation relating t1 and t2, which is t1 = 2t2. Step 5) Use the given that the P wave arrives 4 minutes before the S wave, thus t1 – t2 = 240s. Solve this equation to get t2 = 240s. Step 6) Substitute t2 back into the equation derived in Step 4 to get t1. Step 7) Substitute the values of v1 and t1 into the distance formula l = v1t1 to finally conclude that the distance the earthquake occurred is 1920km."
}