{
    "Question": "Q16: A cricketer can throw a ball to a maximum horizontal distance of 100 m. How high above the ground can the cricketer throw the same ball?\r\n",
    "Original Solution": "The maximum horizontal distance, R = 100 m\r\nThe cricketer will only be able to throw the ball to the maximum horizontal distance when the angle of projection is 45°, i.e., \\(\\begin{array}{l}\\theta\\end{array} \\) = 33.60°\r\nThe horizontal range for a projection velocity v is given as\r\nR = \\(\\begin{array}{l}\\frac{u^{2}\\sin 2\\theta}{g}\\end{array} \\)\r\n\\(\\begin{array}{l}100 = \\frac{u^{2}}{g}\\sin 90^{\\circ}\\end{array} \\)\r\n\\(\\begin{array}{l}\\frac{u^{2}}{g} = 100\\end{array} \\) —— (i)\r\nThe ball will achieve the max height when it is thrown vertically upward. For such motion, the final velocity v is 0 at the max height H.\r\nAcceleration, a = – g\r\nUsing the 3rd equation of motion\r\n= \\(\\begin{array}{l}H = \\frac{1}{2} \\times 100\\end{array} \\) = 50 m",
    "Detailed Solution": "Step 1) From the question, we know that the maximum horizontal distance a cricketer can throw a ball is 100 m. This is represented in the problem as R, which we know equals 100 m. Step 2) We understand that this maximum horizontal distance is achieved when the ball is thrown at a 45-degree angle. This optimal throw angle is denoted as theta or θ, which in this case is 45 degrees. Step 3) We can extract a physics formula for the horizontal range for a projected object, given a projection velocity (u) and gravity (g). This formula is R = (u²sin(2θ))/g. Step 4) Next, we substitute values we know into this formula, interpreting it for the specific problem given. We plug in 45 degrees for theta and 100 m for R. Then we solve for u²/g, which equals 100 m. That's equation (i). Step 5) The next part of our solution involves considering when the ball reaches its maximum height. When thrown vertically upwards, the final velocity (v) of the ball is 0 m/s at the maximum height (H). Here, the acceleration (a) is equal to -g because the ball is accelerating downwards due to gravity. Step 6) We use the third equation of motion to calculate the height at this point. The formula states v² = u² - 2gH. We know that v equals 0, thus the equation simplifies to 0 = u² - 2gH. We rearrange this equation to find H = u²/2g. However, from our first equation, we found u²/g equals 100 m. Step 7) When we replace this value in our height equation, we find H = 0.5 ×100 = 50 m. Therefore, the cricketer can throw the ball 50m above the ground.",
    "Solution Outline": "Step 1) We start by understanding the maximum horizontal distance a cricketer can throw a ball is 100 m. Step 2) We identify that this maximum distance is reached when the ball is thrown at a 45 degree angle. Step 3) Using the physics formula for horizontal range, R = (u²sin(2θ))/g, and substituting our known values, we calculate u²/g = 100 m. This gives us a more general understanding of the relationship of the projection velocity to gravity. Step 4) We then consider when the ball reaches its maximum height, which occurs when the ball is thrown vertically upwards and velocity v = 0. The acceleration at this point is -g due to gravity. Step 5) We use the third equation of motion, v² = u² - 2gH for calculation of height. We know from the first equation that u²/g is equal to 100 m. Step 6) Substituting these known values into our height equation, we find that the height above the ground that the cricketer can throw the ball is 50 m."
}