{
    "Question": "25. A mass attached to a spring is free to oscillate, with angular velocity ω, in a horizontal plane without friction or damping. It is pulled to a distance x0 and pushed towards the centre with a velocity v0 at time t = 0. Determine the amplitude of the resulting oscillations in terms of the parameters ω, x0 and v0. [Hint: Start with the equation x = a cos (ωt+θ) and note that the initial velocity is negative.]",
    "Original Solution": "The angular velocity of the spring = ω\r\nx = a cos (ωt+θ)\r\nAt t = 0, x = x0\r\nSubstituting these values in the above equation we get\r\nx0 = A cos θ —–(1)\r\nVelocity, v= dx/dt = – Aω sin (ωt+θ)\r\nAt t = 0, v = – v0\r\nSubstituting these values in the above equation we get\r\n– v0 = – Aω sin θ\r\nAsin θ =  v0/ω———-(2)\r\nSquaring and adding (1) and (2) we get\r\n\\(\\begin{array}{l}A^{2}(cos^{2}\\theta+sin^{2}\\theta )=x_{0}^{2}+\\frac{v_{0}^{2}}{\\omega ^{2}}\\end{array} \\)\r\n\\(\\begin{array}{l}A=\\sqrt{x_{0}^{2}+\\frac{v_{0}^{2}}{\\omega^{2}}}\\end{array} \\)",
    "Detailed Solution": "Step 1) We are given that a mass attached to a spring is oscillating with an angular velocity ω. Furthermore, at time t = 0, the spring's displacement is x0 and its velocity is -v0. The displacement of the spring can be represented by the equation x = a cos (ωt+θ), where a is the amplitude, the maximum distance the spring can move away from its equilibrium position. Step 2) We are told that at t = 0, the displacement of the spring is x0. This means we can input these values into our x equation, resulting in x0 = a cos θ. This represents the initial condition of the system. Step 3) The velocity v of the spring at any point in time can be given as the derivative of the displacement equation, which gives v = -aω sin (ωt+θ). We are told that the initial velocity at t = 0 is -v0, which we input into this equation, resulting in -v0 = -aω sin θ. We then simplify this to get Asin θ =  v0/ω. This represents another initial condition of the system. Step 4) We now have two equations relating a, θ, x0, v0, and ω. We square both equations and then add them together. Because of the trigonometric identity sin²θ + cos²θ = 1, the left-hand side simplifies to a². The right-hand side becomes x0² + (v0/ω)². Therefore, a² = x0² + (v0/ω)². Step 5) Solving for a, which is the amplitude we seek, we take the square root of both sides to get a = sqrt(x0² + (v0/ω)²). This is the amplitude of the oscillations of the spring, given the initial conditions and in terms of ω, x0, and v0.",
    "Solution Outline": "Step 1) We begin with the given displacement of the oscillating spring, denoted by the equation x = a cos (ωt+θ), and the known initial conditions: displacement x0 and velocity -v0 at time t=0. This gives us the initial condition in position. Step 2) By taking the derivative of the displacement equation, we obtain the velocity equation as v = -aω sin (ωt+θ). Inputting the initial condition for velocity, we obtain another equation which gives us the initial condition in velocity. Step 3) We now solve the system of equations using a sin θ =  v0/ω and x0 = a cos θ. This is done by squaring both equations and adding them together, taking advantage of the trigonometric identity sin²θ + cos²θ = 1. This results in a² = x0² + (v0/ω)². Step 4) We solve for the amplitude a by taking the square root of both sides, giving a = sqrt(x0² + (v0/ω)²). Therefore, the amplitude of the oscillations of the spring is given by these initial conditions and the angular speed ω."
}