{
    "Question": "Q19. A hoop of radius 2 m weighs 100 kg. It rolls along a horizontal floor so that its centre of mass has a speed of 20 cm/s. How much work has to be done to stop it?",
    "Original Solution": "Given\r\nThe radius of the ring, r = 2 m\r\nMass of the ring, m = 100 kg\r\nVelocity of the hoop, v = 20 cm/s = 0.2 m/s\r\nTotal energy of the loop = Rotational K.E. + Translational K.E.ET = (1/2)mv^2 + (1/2) I ω^2\r\nWe know the moment of inertia of a ring about its centre, I = mr^2ET = (1/2)mv^2 + (1/2) (mr^2)ω^2\r\nAlso, we know v = rω\r\nET = ( 1/2 )mv^2 + ( 1/2 )mr^2ω^2\r\n=> ( 1/2 )mv^2 + ( 1/2 )mv^2 = mv^2\r\nThus, the amount of energy required to stop the ring = Total energy of the loop\r\nThe amount of work required, W = mv2 = 100 × (0.2)^2 = 4 J.",
    "Detailed Solution": "Step 1) Let's start with understanding the problem. The hoop is already in motion, and we need to calculate the amount of work needed to stop it. It's crucial to understand that the moving hoop has two types of kinetic energy: rotational and translational. Thus, we need to account for both of these energies when solving the problem. \nStep 2) We're given the following quantities: the radius of the hoop 'r' is 2 m, the mass of the hoop 'm' is 100 kg, and the speed at the hoop's center of mass 'v' is 20 cm/s (or 0.2 m/s in SI units). \nStep 3) We set up the total energy equation of the hoop. The total energy ET of the hoop is the sum of its rotational kinetic energy and translational kinetic energy, so ET = (1/2)mv^2 (translational) + (1/2)Iω^2 (rotational). 'I' is the moment of inertia, and 'ω' is the angular velocity. \nStep 4) As we know, the moment of inertia 'I' of a hoop about its center is 'mr^2'. Also, we know the velocity of the center of mass v = rω. So we substitute I and ω in the total energy formula. Thus getting ET = (1/2)mv^2 + (1/2)m(r^2)(rω)^2 . This simplifies to ET = (1/2)mv^2 + (1/2)mv^2 = mv^2. \nStep 5) Now, we calculate the actual work required to stop the hoop. We need to equate the total amount of kinetic energy of the hoop to the work done to stop it. So, Work done (W) = mv^2. Substituting known values, we get W = 100 x (0.2)^2 = 4 Joules. Thus, 4 Joules of work has to be done to bring the hoop to rest.",
    "Solution Outline": "Step 1) Understand that the moving hoop has two types of kinetic energy: rotational and translational. We must account for both in our calculations. \nStep 2) Note the given values: radius of hoop 'r' = 2 m, mass 'm' = 100 kg, and speed of hoop 'v' = 20 cm/s or 0.2 m/s. \nStep 3) Use the total energy formula for a moving object with rotational motion ET = (1/2)mv^2 (translational) + (1/2)Iω^2 (rotational). Understand that 'I' is the moment of inertia while 'ω' is the angular velocity. \nStep 4) Substitute the known formula for moment of inertia 'I' of a hoop or ring and angular velocity in terms of linear velocity 'v' into the formula for total energy. This will bring the formula to ET = mv^2. \nStep 5) Calculate the work required to stop the hoop. The work done is equal to the total energy of the hoop. So, Work done (W) = mv^2. Hence, to bring the hoop to rest, we need to do 4 Joules of work."
}