{
    "Question": "Q7. Four identical hollow cylindrical columns of mild steel support a big structure with a mass of 50,000 kg. The inner and outer radii of each column are 30 and 60 cm, respectively. Assuming the load distribution to be uniform, calculate the compressional strain of each column.",
    "Original Solution": "Mass of the big structure, M = 50,000 kg\r\nTotal force exerted on the four columns= Total weight of the structure=50000×9.8N\r\nThe compressional force on each column = Mg/4 = (50000×9.8)/4 N= 122500 N\r\nTherefore, Stress = 122500 N\r\nYoung’s modulus of steel, Y=2×10^11 Pa\r\nYoung’s modulus, Y= Stress/Strain\r\nStrain = Young’s modulus/Stress\r\nStrain = (F/A)/Y\r\nInner radius of the column, r = 30 cm = 0.3 m\r\nOuter radius of the column, R = 60 cm = 0.6 m\r\nWhere,\r\nArea, A=π(R^2−r^2)=π((0.6)^2−(0.3)^2) = 0.27 π m^2\r\nStrain =122500/[0.27 x 3.14×2×10^11]=7.22×10^−7\r\nHence, the compressional strain of each column is 7.22×10^−7.",
    "Detailed Solution": "Step 1) We are given the mass (M) of the structure to be 50,000 kg. Knowing that weight is mass times gravity, we multiply the mass of the structure by the acceleration due to gravity (g), which is 9.8 m/s^2, to find that the total force (F) exerted on the four columns is equal to the total weight of the structure (Mg), giving us F = 50000 kg * 9.8 m/s^2 = 490,000 N. Step 2) As the load of the structure is uniformly distributed, the force on each column is this total force divided by four. This gives us the compressive force (f) on each column, f = F/4 = 490,000 N / 4 = 122,500 N. Step 3) The stress (σ) exerted on each column is thus also this force value, σ = 122,500 N. Step 4) As given, the Young’s modulus of steel (Y) is 2 x 10^11 Pa. Young’s modulus is a measure of the ability of a material to withstand changes in length when under lengthwise tension or compression. It is the ratio of stress (σ) to strain (ε) in a material, Y = σ / ε. From this definition, we can rearrange to get the value of strain as ε = σ / Y. Step 5) The strain can also be represented as ε = f/a / Y, where a is the cross-sectional area. Now we just need to find the cross-sectional area of the hollow cylindrical column. Step 6) Given that inner and outer radii of the column are 30 cm (or 0.3 m) and 60 cm (or 0.6 m) respectively, the area of the cylindrical column (A) is π(R^2−r^2) where R is the outer radius and r is the inner radius. So, A = π(0.6^2−0.3^2) = 0.27 π m^2. Step 7) Substituting the values of f, a and Y back into the equation, the compressional strain (ε) is found to be 122500 N / (0.27 * π * 2 x 10^11 Pa) which results in  ε = 7.22 x 10^−7. Hence, the compressional strain of each column is 7.22 x 10^−7.",
    "Solution Outline": "Step 1) Identify the known values from the problem: the mass (M) of the structure and the inner (r) and outer (R) radii of the columns. Step 2) Calculate the total force exerted on the columns, which is equal to the total weight of the structure (M x g). This uses the equation for weight, F = Mg. Step 3) As the load is uniformly distributed, find the compressive force on each column by dividing the total force by the number of columns, giving us the equation f = F/4. Step 4) We recognise that the stress on each column is equal to this force. Step 5) Using the known Young's modulus of steel (Y), we use the rearranged equation for Young's modulus to find the strain, ε = σ / Y, where σ is the stress. Step 6) We recognise the need to determine the cross-sectional area of the column to more directly calculate the strain. Using the formula for the area of a hollow cylinder, A = π(R^2−r^2), calculate the area. Step 7) Substitute these values back into the equation for strain. The result is the compressional strain of each column."
}