{
    "Question": "2.18 Explain this common observation clearly: If you look out of the window of a fast-moving train, the nearby trees, houses etc., seem to move rapidly in a direction opposite to the train’s motion, but the distant objects (hilltops, the Moon, the stars etc.) seem to be stationary (In fact, since you are aware that you are moving, these distant objects seem to move with you).",
    "Original Solution": "An imaginary line which joins the object and the observer’s eye is called the line of sight. When we observe the nearby objects, they move fast in the opposite direction as the line of sight changes constantly, whereas the distant objects seem to be stationary as the line of sight does not change rapidly.",
    "Detailed Solution": "Step 1) Understand the basic scenario: When you are in a fast-moving train, you observe that the trees and houses near the railway tracks seem to move swiftly in the opposite direction of your motion. In contrast, distant objects such as hilltops, moon and stars appear to be stationary. Since you know you are moving, it might even seem like these distant objects are moving with you.\n\nStep 2) Comprehend the concept of 'Line of Sight': An imaginary line connecting an object you're observing and your eye is known as the line of sight. It is essentially the direction in which you are looking to observe the object.\n\nStep 3) Visualize the motion: Here, your train, your moving eyes and the outside stationary objects are part of three different frames of reference. When your train (and consequently you) moves rapidly forwards, your line of sight for near objects like trees and houses changes rapidly as they pass quickly by your windows, making them seem to move swiftly in the opposite direction. \n\nStep 4) Line of Sight and distance: For very distant objects like the Moon or hilltops, the angles subtended by these objects at your eye (angle between your lines of sight) change very slowly. That’s because, despite your train's speed, the distance between you and these far off objects barely changes, which keeps your line of sight almost unaltered. Hence, these objects appear to be stationary to you.",
    "Solution Outline": "Step 1) Understand that while being in a train, nearby objects seem to move in the opposite direction swiftly, and distant objects appear stationary. This is because of your train's fast forward movement.\n\nStep 2) Learn about the 'Line of Sight', which is an imaginary line connecting your eye and the object you’re looking at and represents the direction you're observing in.\n\nStep 3) Understand that your forward-moving train rapidly changes your line of sight for nearby objects, making them seem to move in the opposite direction.\n\nStep 4) For far off objects, due to their substantial distance, your train's movement doesn't significantly alter your line of sight, making those objects appear stationary."
}