{
    "Question": "17. A simple pendulum of length l and having a bob of mass M is suspended in a car. The car is moving on a circular track of radius R with a uniform speed v. If the pendulum makes small oscillations in a radial direction about its equilibrium position, what will be its time period?",
    "Original Solution": "The bob of the simple pendulum will experience the centripetal acceleration provided by the circular motion of the car and the acceleration due to gravity.\r\nAcceleration due to gravity = g\r\nCentripetal acceleration = v^2 / R\r\nWhere,\r\nv is the uniform speed of the car\r\nR is the radius of the track\r\nEffective acceleration (g’) is given as\r\ng‘ = √g2 + (v^4 / R^2)\r\nHence,\r\nTime period, t = 2π√l / g’\r\n= 2π √(l / √g^2 + v^4 / R^2)\r\nTherefore, its time period will be 2π √(l / √g^2 + v^4 / R^2)",
    "Detailed Solution": "Step 1) We start by understanding what is happening in this problem. The bob of the simple pendulum is in a car. This car is going in a circle at uniform speed. Hence, the bob is experiencing two accelerations: the regular gravity (downwards) and the centripetal acceleration (towards the center of the circular path of the car). These two accelerations are perpendicular to each other. Step 2) We need to calculate both accelerations. The acceleration due to gravity is given as g. But since the car is also moving in a circular path, there is a centripetal acceleration which equals v^2 / R where v is the uniform speed of the car and R is the radius of the track. Step 3) These two individual accelerations can together be understood as a single net or 'effective acceleration'. We denote this as g'. We calculate g' by taking the square root of the sum of the squares of the two individual accelerations. This is taken from the Pythagorean theorem, as these accelerations form a right-angle triangle. Hence g’ = √(g^2 + (v^4 / R^2)). Step 4) After finding the effective acceleration, we use it to calculate the time period of our pendulum. The time period formula for a simple pendulum is t = 2π√l / g where l is the length of the pendulum, and g is the acceleration due to gravity. But since we are considering the effective acceleration, we replace g with g', thus obtaining t = 2π √(l / √g^2 + v^4 / R^2).",
    "Solution Outline": "Step 1) Recognize that the bob of the pendulum is experiencing two perpendicular accelerations: gravity and centripetal acceleration due to the car moving in a circular path. Step 2) Calculate both accelerations: g for gravity and v^2 / R for the centripetal acceleration. Step 3) Combine them into a single net or 'effective acceleration' using the Pythagorean Theorem: g’ = √(g^2 + (v^4 / R^2)). Step 4) Use the effective acceleration 'g'' to find the time period of the pendulum's oscillations using the formula t = 2π √(l / √g^2 + v^4 / R^2)."
}