{
    "Question": "Q10. A rigid bar of mass 15 kg is supported symmetrically by three wires, each 2.0 m long. Those at each end are of copper, and the middle one is of iron. Determine the ratios of their diameters if each is to have the same tension.",
    "Original Solution": "As the tension on the wires is the same, the extension of each wire will also be the same. Now, as the length of the wires is the same, the strain on them will also be equal.\r\nNow, we know\r\nY = Stress / Strain\r\n= (F/A) / Strain  =  (4F/πd^2) / Strain     . . . . . . . . . . ( 1 )\r\nWhere,\r\nA = Area of cross-section\r\nF = Tension force\r\nd = Diameter of the wire\r\nWe can conclude from equation ( 1 ) that Y ∝ (1/d^2).\r\nWe know that Young’s modulus for iron, Y1 = 190 × 10^9 Pa\r\nLet the diameter of the iron wire = d1\r\nAlso, Young’s modulus for copper, Y2 = 120 × 10^9 Pa\r\nLet the diameter of the copper wire = d2\r\nThus, the ratio of their diameters can be given as\r\n= \\(\\begin{array}{l}\\sqrt{\\frac{190×10^{9}}{120×10^{9}}}\\end{array} \\) =1.26 : 1",
    "Detailed Solution": "Step 1) We begin by recognizing a key fact: because the tension in the wires is the same, the extension of each wire (how much it stretches) will also be the same. This fact comes from the underlying physics principle that materials will deform in a directly proportional way to the force applied, provided the deformation is within elastic limits. This is the principle of Hooke's law. Step 2) Now, since all the wires have an identical length of 2.0 m, it follows that the strain on the wires (a measure of how much they have deformed, which is the deformation/original length) must also be equal. Step 3) We then use the defining formula for Young's modulus (Y), which is stress (force / area) divided by strain. This can be rewritten as (F/A) / strain, and substituting A as πd^2 /4 (where d is the diameter of the wire), it simplifies to (4F/πd^2) / strain. Step 4) From this equation (let's call it Equation 1), we deduce that Young's modulus, Y, is inversely proportional to the square of the wire's diameter (1/d^2). This implies that the diameter of the wire determines the amount of tension it can withstand to an extent. Step 5) We then use the Young's modulus values for iron and copper, given as 190 × 10^9 Pa and 120 × 10^9 Pa respectively. Let's denote the diameter of the iron wire as d1 and that of the copper wire as d2. Step 6) Then, we calculate the ratio of their diameters, which would give us the proportion of the diameters that ensures the tension in each wire is the same. This can be calculated as the square root of (190 × 10^9) / (120 × 10^9), which gives us 1.26. Thus, the ratio of the diameters of the iron wire to the copper wire is 1.26 to 1.",
    "Solution Outline": "Step 1) Understand that because the tension in all wires is the same, the amount each wire stretches (extension) would also be the same. Step 2) Conclude that because all wire lengths are identical, the strain on each wire (deformation/original length) must also be equal. Step 3) Employ the formula for Young's modulus, which is Stress (Force/ Area) divided by Strain, re-written as (4F/πd^2) / Strain, Arrival at equation 1. Step 4) From equation 1, deduce that Young's modulus, Y, is inversely proportional to the square of the wire's diameter. This shows that the wire's diameter plays a role in determining the strain. Step 5) Use the values of Young's modulus for the iron and copper wires, which have different capacities to withstand tension. Label the diameter of the iron wire as d1 and the copper wire as d2. Step 6) Calculate the diameters ratio that will balance the tensions in the wires. This is calculated as the square root of the Young's Modulus of iron divided by the Young's Modulus of copper, and it results in a ratio of 1.26 : 1."
}