{
    "Question": "Q9. A steel cable with a radius of 1.5 cm supports a chairlift in a ski area. If the maximum stress is not to exceed 10^8 Nm^-2.What is the maximum load the cable can support?",
    "Original Solution": "Radius of the steel cable, r=1.5 cm = 0.015 m\r\nCross-sectional area of the cable = πr2= 3.14 x ( 0.015)^2\r\n= 7.06 x 10^-4 m\r\nMaximum stress allowed on the steel cable = 10^8 N/m^2\r\nMaximum load the cable can support = Maximum stress × Area of cross-section\r\n= 108 x 7.06 x 10^-4\r\n= 7.065×10^4 N\r\nHence, the cable can support the maximum load of 7.065×10^4 N.",
    "Detailed Solution": "Step 1) The problem provides us with the radius of the steel cable which is 1.5 cm. But as our final units need to be in Newtons (Nm^-2), we must convert the radius to meters. We know that 1 cm is equal to 0.01 m, so by multiplying 1.5 cm by 0.01, we get the radius in meters which is 0.015 m. This step is crucial to ensure consistency of units in all our calculations. Step 2) After we have the radius in appropriate units, we need to find out the cross-sectional area of the cable. We know that the area of a circle (which is the shape of the cross-section of the cable) is given by the formula Area = πr^2. Substituting our radius value into this equation, we get the area as π*(0.015)^2, which equals 7.06 x 10^-4 m^2. Step 3) Now that we have the area, we use the given information about the maximum allowed stress on the cable, which is 10^8 Nm^-2. Stress is defined as the force experienced per unit area. Step 4) We can now find the maximum load (force) that the cable can support. This can be calculated by rearranging the stress formula. The formula is Stress = Force/Area. Rearranging for Force gives us Force = Stress*Area. Substituting our values for stress and area into this formula, we get Force = (10^8)*(7.06 x 10^-4) which equals 7.065×10^4 N. Therefore, the cable can support a maximum load of 7.065×10^4 N.",
    "Solution Outline": "Step 1) Start by converting the given radius of the steel cable from cm to m, since we require our final units in Nm^-2. Step 2) Calculate the cross-sectional area of the cable using the formula for the area of a circle, πr^2, with the radius in meters. Step 3) Identify from the problem that the maximum stress allowed on the steel cable is 10^8 N/m^2. This is defined as force per unit area. Step 4) Calculate the maximum load (force) that the cable can support by rearranging the formula for stress to solve for force, giving us Force = Stress*Area. By substituting the values for stress and area we have calculated, we find that the cable can support a maximum load of 7.065×10^4 N."
}