{
    "Question": "6. Choose the correct alternative.(a) If the zero of potential energy is at infinity, the total energy of an orbiting satellite is negative of its kinetic/potential energy.(b) The energy required to launch an orbiting satellite out of the earth’s gravitational influence is more/less than the energy required to project a stationary object at the same height (as the satellite) out of the earth’s influence.",
    "Original Solution": "(a) If the zero potential energy is at infinity, the total energy of an orbiting satellite is negative of its kinetic energy.\r\n(b) The energy required to launch an orbiting satellite out of Earth’s gravitational influence is less than the energy required to project a stationary object at the same height (as the satellite) out of Earth’s influence.",
    "Detailed Solution": "Step 1) The first part of our problem deals with understanding some basic physics concepts, namely potential energy, kinetic energy, and total energy. In physics, potential energy at a reference point, such as infinity in our case, is often taken to be zero. Step 2) On this basis, the total energy of an orbiting satellite is actually the sum of its kinetic and potential energies. But, since the potential energy is zero at infinity, total energy is only constituted by the kinetic energy of the satellite. Step 3) Consequently, if total energy is equal to kinetic energy, the condition attached in the problem statement where total energy is negative indicates that the kinetic energy should be a negative value (because a positive added to a negative gives a negative). Thus, the negative of kinetic energy (a negative value) would be a positive, equating to the total energy of the satellite that is: Total Energy = -Kinetic Energy. Step 4) For the second part of the question, it revolves around the amount of energy required to escape Earth's gravitational influence. For an orbiting satellite, it already has significant kinetic energy (as it is moving) that can be used to overcome some of the Earth's gravitational force. Step 5) In contrast, a stationary object at the same height as the satellite would require more energy to achieve the same result, as it does not have this initial kinetic energy to help it overcome gravity. Therefore, it takes less energy to launch an orbiting satellite out of Earth’s gravitational influence than it would to project a stationary object at the same height out of Earth’s influence.",
    "Solution Outline": "Step 1) Conceptualize the problem by understanding the principles of potential energy and kinetic energy. Here potential energy is zero at infinity according to conventional physics principles. Step 2) Recognize that our total energy is defined as the sum of kinetic and potential energies. Hence, total energy equals kinetic energy in this scenario. Step 3) We ascertain that total energy is negative, hence this implies that kinetic energy is negative. So the total energy of the satellite is -Kinetic Energy. Step 4) To interpret the second part of the problem, we realize that an orbiting satellite already possesses significant kinetic energy due to its motion which aids it in negating some gravitational force. Step 5) Understand that a stationary object requires more energy to overcome gravity as it lacks the initial kinetic energy that the satellite has. Hence, launching a satellite needs less energy compared to projecting a stationary object at the same height out of gravitational influence."
}