{
    "Question": "12. A bob of mass 0.1 kg hung from the ceiling of a room by a string 2 m long is set into oscillation. The speed of the bob at its mean position is 1 ms^(-1). What is the trajectory of the bob if the string is cut when the bob is (a) at one of its extreme positions, (b) at its mean position?",
    "Original Solution": "(a) When the bob is at one of its extreme positions, the velocity is zero. So, if the string is cut the bob will fall vertically downward under the force of its weight F = mg.\r\n(b) At its mean position the bob has a horizontal velocity. If the string is cut, the bob will behave like a projectile and will fall on the ground after taking a parabolic path.",
    "Detailed Solution": "Step 1) Let us begin by understanding the nature of our problem: a bob of mass 0.1 kg is hinged from a ceiling and is set into oscillation. The known parameters are the mass of the bob (m = 0.1 kg), the length of the string (2 m), and the speed of the bob in its mean position (1 m/s). Step 2) The question then asks us to examine two different situations: a) when the string is cut at one of its extreme positions and b) when the string is cut at its mean position. Step 3) For part (a), at one of its extreme positions, we are aware that the bob's speed is zero since it momentarily comes to rest before changing direction. Hence, there is no horizontal or vertical component of velocity. Step 4) This lack of horizontal or vertical speed will cause the bob to simply fall straight downwards once the string is cut due to the force of gravity, and it can be illustrated as F = mg, where g is the acceleration due to gravity. Step 5) Now, let us tackle part (b) of the question: when the bob is at its mean position. At this point, the bob has the greatest speed, which is entirely horizontal. Step 6) Therefore, if the string is cut at this position, the bob will have an initial horizontal velocity and no vertical velocity. Step 7) The bob will then behave as a projectile undergoing horizontal motion (due to its initial speed) and simultaneously falling downward due to gravity. Step 8) This combination of motions generates a characteristic trajectory shape—specifically, a parabolic path.",
    "Solution Outline": "Step 1) Recognize that we are given the bob's mass, the string's length, and the bob's speed at its mean position. Step 2) Understand that for part (a), at extreme positions the bob's speed is zero, causing it to drop directly downwards due to gravity if the string is cut. (Application of: F = mg) Step 3) For part (b), at the bob's mean position, it has its maximum speed which is all horizontal, and if the string is cut at this point, it will start moving horizontally while simultaneously falling downwards due to gravity. Step 4) This simultaneous motion forms a parabolic trajectory."
}