{
    "Question": "Q5. A jet aeroplane travelling at the speed of 500 km/h ejects its products of combustion at the speed of 1500 km/h relative to the jet plane. What is the speed of the latter with respect to an observer on the ground?",
    "Original Solution": "Speed of the jet aeroplane, VA= 500 km/h\r\nThe speed at which the combustion products are ejected relative to the jet plane, VB – VA\r\n= – 1500 km/h\r\n(The negative sign indicates that the combustion products move in a direction opposite to that of the jet)\r\nSpeed of combustion products w.r.t. observer on the ground, VB – 500 = – 1500\r\nVB = – 1500 + 500 = – 1000 km/h",
    "Detailed Solution": "Step 1) The first step is to identify the known quantities. The speed of the jet aeroplane, denoted by 'VA', is given as 500 km/h. Step 2) We also know that the speed of the combustion products, as seen from the jet plane (VB - VA), is -1500 km/h. The negative sign represents that the direction of the combustion products is opposite to the direction of the jet. Step 3) To find the speed of the combustion products with respect to an observer on the ground, we can denote this speed as 'VB'. Since VB - VA = -1500 km/h, we can rearrange this equation to solve for VB. So, VB = VA - 1500. Step 4) Now we replace VA with the speed of the aeroplane. Substituting 500 km/h in place of VA, we get VB = 500 - (-1500) which simplifies to VB = 500 + 1500. Step 5) Finally, performing the addition, we find that VB equals -1000 km/h. This means that the combustion products are moving at a speed of 1000 km/h in the direction opposite to the motion of the plane, as seen by an observer on the ground.",
    "Solution Outline": "Step 1) Identify the known quantities. The speed of the jet aeroplane, VA, is 500 km/h, and the speed of the combustion products relative to the jet, VB - VA, is -1500 km/h. Step 2) Determine the speed of the combustion products (VB) as viewed from the ground. Use the equation VB - VA = -1500 km/h and rearrange to find VB = VA - 1500. Step 3) Substitute VA with the aeroplane's speed, giving VB = 500 - (-1500). Simplify this to VB = 500 + 1500. Step 4) Calculate VB to find the speed of the combustion products as observed from the ground, giving VB = -1000 km/h. This is the speed of the combustion products relative to the ground, moving in the direction opposite of the plane."
}