{
    "Question": "Q18: An aircraft executes a horizontal loop of radius 1 km with a steady speed of 900 km h-1.Compare its centripetal acceleration with the acceleration due to gravity.",
    "Original Solution": "Radius of the loop, r = 1 km = 1000 m\r\nSpeed, v = 900 km h^-1 = \\(\\begin{array}{l}900 \\times \\frac{5}{18}\\end{array} \\) = 250 ms^-1\r\nCentripetal acceleration: \\(\\begin{array}{l}a_{c} = \\frac{v^{2}}{r}\\end{array} \\)\r\n= \\(\\begin{array}{l}\\frac{\\left (250 \\right )^{2}}{1000}\\end{array} \\) = 62.5 ms^-2\r\nAcceleration due to gravity, g = 9.8 ms^-2",
    "Detailed Solution": "Step 1) Identify the known values: We're given that the radius of the plane's loop is 1km, so r = 1 km = 1000 m (we convert the radius into meters because in physics, it's generally beneficial to work with SI units). The speed is 900 km h^-1, and we'll need to convert this into meters per second, v = 900 km h^-1 = 900 * 5/18 = 250 m/s. The acceleration due to gravity is a standard constant, g = 9.8 m/s^2. Step 2) We're asked to compare the centripetal acceleration of the plane with gravity. The formula for centripetal acceleration is a_c = v^2/r. We already know the values for v and r, so we can simply substitute these into the equation to get the value of centripetal acceleration. Step 3) The calculation of centripetal acceleration will be a_c = (250)^2/1000 = 62.5 m/s^2. Step 4) Now that we have both the value of the centripetal acceleration and the acceleration due to gravity, we can compare the two. When we look at the acceleration due to gravity (g = 9.8 m/s^2) and the centripetal acceleration (a_c = 62.5 m/s^2), we can see that the centripetal acceleration is significantly greater. The plane is experiencing forces around 6.4 times greater than the force of gravity when executing the loop.",
    "Solution Outline": "Step 1) Convert all given values to SI units: the radius (r) of the plane's loop is 1km, which is 1000 m in SI units. The speed (v) is given as 900 km h^-1 but we want it in m/s, so we convert to get 250 m/s. The acceleration due to gravity (g) is a constant 9.8 m/s^2. Step 2) Use the formula for centripetal acceleration: a_c = v^2/r. This formula relates the speed of an object moving in a circular path to its acceleration towards the centre of that circle, which is what we're looking for in this problem. Step 3) Substitute v and r into the formula to calculate the centripetal acceleration. Step 4) Compare this centripetal acceleration to the acceleration due to gravity. Notice that the plane experiences forces multiple times greater than the acceleration due to gravity when it is executing the loop."
}