{
    "Question": "20. A body of mass 0.5 kg travels in a straight line with velocity v =ax^(3/2) where a = 5 m^(–1/2) s^(–1). What is the work done by the net force during its displacement from x = 0 to x = 2 m?",
    "Original Solution": "Mass of the body, m = 0.5 kg\r\nVelocity of the body, v=ax^(3/2)\r\nHere, a = 5 m^(-1/2) s^(-1).\r\nInitial velocity at x = 0, v1 = a x 0 = 0\r\nFinal velocity at x = 2, v2 = a (2)^(3/2) = 5 x (2)^(3/2)\r\nWork done by the system= increase in K.E of the body\r\n= 1/2 m((v2)^2-(v1)^2) = 1/2 x 0.5[(5 x (2)^(3/2))^2 – 0]\r\n\r\n= (1/2) x 0.5 x (25 x 8)=50 J",
    "Detailed Solution": "Step 1) The problem first states that the body in motion has a mass of 0.5 kg. It is important to note the mass as it will later be used to calculate the work done on the body by assessing the change in kinetic energy. Step 2) The problem then introduces the relationship between the body's velocity and its position. The velocity is equal to a times x to the power of 3/2, where a here is equal to 5 m^(-1/2) s^(-1). This relationship is specific to the motion of the body. Step 3) Now, determine the initial velocity of the mass at x = 0. It's given as v1 = a x 0, which calculates to 0 because any number multiplied by zero equals zero. Thus, at the starting point, the velocity of the body is zero. Step 4) Determine the final velocity at x = 2 m. By substituting this x value into velocity formula, v2 = a x (2)^(3/2), we find out exactly how fast the body is moving at x = 2 m which turns out to be 5 x (2)^(3/2). Step 5) The work done by the system is equal to the increase in the body's kinetic energy, since work is essentially energy transferred by a force. In this case, the energy is being transferred to the body and causing it to move. The increase in kinetic energy is calculated as 1/2 times m times ((v2)^2-(v1)^2). We get this by subtracting the initial kinetic energy from the final kinetic energy. Step 6) Start plugging the known values into the equation for the difference in kinetic energy. This gives us 1/2 times 0.5 times [ (5 x (2)^(3/2))^2 – 0]. After performing the calculations, it turns out to be 50 Joules. This is the work done by the system on the body.",
    "Solution Outline": "Step 1) Identify the mass of the body as 0.5 kg. Step 2) Understand the relationship between the body's velocity and its position, given by the equation v = a x^3/2 where a is equal to 5 m^(-1/2) s^(-1). Step 3) Compute the initial velocity, v1, at the starting point x = 0, which is 0. Step 4) Calculate the final velocity, v2, when the body's position is at x = 2 m, which turns out to be 5 x (2)^(3/2). Step 5) Correlate that the work done by the system is equal to the change in kinetic energy, which can be calculated using the formula 1/2 times m times ((v2)^2 - (v1)^2). Step 6) Substitute the known values into this work-energy equation which provides us the work done on the body, yielding the value 50 J."
}