{
    "Question": "3: Suppose there existed a planet that went around the Sun twice as fast as the earth. What would be its orbital size as compared to that of the earth?",
    "Original Solution": "Time taken by the earth for one complete revolution, TE = 1 Year\r\nThe radius of Earth’s orbit, RE = 1 AU\r\nThus, the time taken by the planet to complete one complete revolution\r\nTP = \\(\\begin{array}{l}\\frac{1}{2}\\end{array} \\)TE  = \\(\\begin{array}{l}\\frac{1}{2}\\end{array} \\) year\r\nLet the orbital radius of this planet = RP\r\nNow, according to Kepler’s third law of planetary motion,\r\nTherefore, the radius of the orbit of this planet is 0.63 times smaller than the radius of the orbit of the Earth.",
    "Detailed Solution": "Step 1) We start by establishing known facts. The Earth takes 1 year to complete a revolution around the sun and the radius of Earth's orbit is known to be 1 Astronomical Unit (AU). Step 2) Next, given that the hypothetical planet moves twice as fast as Earth, it would complete a revolution in half the Earth's time, i.e., 0.5 years or 1/2 TE, where TE represents the Earth's revolutionary period. Step 3) Now, let's define RP as the radius of this planet's orbit. Our task is to find the relationship between RP and RE (the radius of Earth's orbit). Step 4) For this, we use Kepler's third law. This law states that the square of the period of a planet's revolution (T) is directly proportional to the cube of the semimajor axis of its orbit (R). Mathematically, this is expressed as T^2 ∝ R^3. Step 5) We can adjust this equation to solve for R to find a relationship between the planet's orbital radius and the Earth's. We do so by rewriting the relationship as R = (T^2)^(1/3). Step 6) Finally, we plug the planet's period of revolution (TP = 0.5 years) into the newly organized formula: RP = (TP^2)^(1/3), and realize that the radius of the orbit of this planet would be about 0.63 times the radius of Earth's orbit. Hence, this planet's orbit is smaller than that of the Earth.",
    "Solution Outline": "Step 1) State the known values of Earth's orbital period and radius. Step 2) Deduce the hypothetical planet's period given its speed relative to Earth. Step 3) Define the planet's orbital radius which we need to find. Step 4) Introduce Kepler's third law linking the period of revolution and semimajor axis of a planet's orbit. Step 5) Rearrange this law to express the semimajor axis (or radius) in terms of the period of revolution. Step 6) Apply this new formula to the hypothetical planet using its period of revolution, thus calculating its orbital size relative to Earth's orbit."
}