{
    "Question": "Q6. A car moving along a straight highway with a speed of 126 km h–1 is brought to a stop within a distance of 200 m. What is the retardation of the car (assumed uniform), and how long does it take for the car to stop?\r\n",
    "Original Solution": "The initial velocity of the car = u\r\nThe final velocity of the car = v\r\nDistance covered by the car before coming to rest = 200 m\r\nUsing the equation,\r\nv = u + at\r\nt = (v – u)/a = 11.44 sec.\r\nTherefore, it takes 11.44 sec for the car to stop.",
    "Detailed Solution": "Step 1) Start by defining the values that are given in the problem. In this case, we know that the initial velocity of the car (u) is 126 km/h, we know that the final velocity of the car (v) is 0 km/h because it comes to a stop, and we know that the total distance that the car travels before stopping (s) is 200 m. Step 2) We need to change the unit of the initial velocity from km/hr to m/s because in our equations of motion we use the latter. To do this, we multiply the initial velocity by 1000 to convert kilometers into meters, then divide by 3600 to convert hours into seconds. So our initial velocity in m/s would be (126*1000)/3600 = 35 m/s. Note that no separate calculation is provided in your textbook solution for this step. Step 3) To find the deceleration of the car, we can use the equation v^2 = u^2 + 2as, where a is the acceleration, or in this case deceleration. Since the car is stopping, its final velocity is 0, so we rearrange the equation to solve for 'a' and get a = (v^2 - u^2) / (2s). Substituting v = 0, u = 35 and s = 200, we find a = 3.0875 m/s^2. This is the retardation of the car, and it's negative because it's slowing down. Again, the exact calculation is not provided in your textbook solution. Step 4) To find the time it took for the car to stop, we use the equation v = u + at. Since we know that the final velocity (v) is 0, we can rearrange the equation to solve for 't', the time, as t = (v - u) / a. Therefore t = (0 - 35) / -3.0875 = 11.344 seconds, which is the time it takes for the car to stop.",
    "Solution Outline": "Step 1) Start by identifying the initial velocity (u), final velocity (v), and the total distance (s) that the car covers before coming to a stop. Step 2) Convert the initial velocity from km/h to m/s for consistency in our calculations. Step 3) Use the equation v^2 = u^2 + 2as to solve for the deceleration (a) of the car. The 'a' here actually depicts retardation as the car is slowing down. We rearrange this equation to find 'a' and substitute in the known values. Step 4) Use the equation v = u + at to find the time it takes for the car to stop. We rearrange this equation to solve for 't' and substitute in the known values, including the deceleration we calculated in step 3."
}