{
    "Question": "31. A train runs along an unbanked circular track of radius of 30 m at a speed of 54 km/h. The mass of the train is 10^6 kg. What provides the centripetal force required for this purpose the engine or the rails? What is the angle of banking required to prevent wearing out of the rail?",
    "Original Solution": "Radius of the track = 30 m\r\nVelocity of the train = 54 km/h = 54 x (5/18) = 15 m/s\r\nMass of the train = 10^6kg\r\nThe required centripetal force is provided by the force of lateral friction due to the rails on the wheels of the train\r\nThe angle of banking required to prevent wearing out of the rails\r\ntanθ= v2/rg = (15 x 15)/ (30 x 10) = 0.75\r\nθ = tan^(-1) (0.75) = 37degrees",
    "Detailed Solution": "Step 1) The problem states that the train is running along an unbanked circular track of radius 30 m at a speed of 54 km/h. We note down these values. Step 2) We need to convert the velocity of the train from km/h to m/sec because the unit of radius is in meters. To do so, we multiply 54 km/h by the conversion factor (5/18) to get 15 m/s. Step 3) The mass of the train is given as 10^6 kg. Step 4) We are asked which force provides the centripetal force required for the train to continue on its path. The centripetal force is provided by the force of lateral friction between the train's wheels and the rails on the track. Step 5) We want to find the angle of banking required to prevent wear on the rails. The angle of banking is that which would eliminate the requirement for any sideways force between the wheels and the rails. This can be determined using the formula for banking angle, tan(θ)= v^2/rg, where v is the velocity of the train, r is the radius of the circular track, and g is the gravitational acceleration constant (approximately 10 m/s^2). Step 6) Substituting our known values into this equation, we find that tan(θ) = (15^2) / (30*10) = 0.75. Solving this equation, we find that θ = tan^(-1) (0.75) = 37 degrees. So, to prevent wearing out of the rails, the track should be banked at an angle of 37 degrees.",
    "Solution Outline": "Step 1) The problem provides the radius of the track, the train's velocity, and the mass of the train. Step 2) We convert the given velocity from km/h to m/s to align with the units of the radius. Step 3) To resolve the first question of where the centripetal force comes from in this situation, we explain that it is provided by the lateral friction between the wheels and the train track rails. Step 4) To find the banking angle needed to prevent rail wear, we will use the formula for the banking angle tan(θ)= v^2/rg, where v is velocity, r is the radius, and g is gravity. Step 5) We substitute these values into the equation to find the angle theta that will prevent rail wear. From using the inverse tangent function tan^(-1), we calculate the angle to be 37 degrees."
}