{
    "Question": "Q23. A three-wheeler starts from rest, accelerates uniformly with 1 m s–2 on a straight road for 10 s, and then moves with uniform velocity. Plot the distance covered by the vehicle during the nth second (n = 1,2,3….) versus n. What do you expect this plot to be during accelerated motion: a straight line or a parabola? \r\n",
    "Original Solution": "For a straight line, the distance covered by a body in nth second is:\r\nSN = u + a (2n – 1)/2 \r\nWhere,\r\na = Acceleration\r\nu = Initial velocity\r\nn = Time = 1, 2, 3, . . . . . , n\r\nIn the above  case,\r\na = 1 m/s^2 and u = 0.\r\n∴ SN = (2n – 1) / 2\r\nThis relation shows that:\r\nSN ∝ n\r\nThis plot is expected to be a straight line.",
    "Detailed Solution": "Step 1) We start with identifying the known values from the problem statement. Here, the initial velocity, u, is given as 0 (since the three-wheeler starts from rest), and the acceleration, a, of the three-wheeler is provided as 1 m/s^2. Also, time, n, is presented as a continuous range of integer seconds: 1, 2, 3, ..., n. Step 2) We are tasked with finding the distance covered during the nth second, which will be denoted as SN. According to the laws of motion, this can be calculated using the formula: SN = u + a (2n – 1)/2. This equation accommodates both the initial velocity and uniform acceleration while considering the specific 'nth' second. Step 3) Considering our values a = 1 m/s^2 and u = 0, we replace these in the above formula to calculate SN which gives us: SN = (2n – 1) / 2. Step 4) This equation shows that SN is directly proportional to n ( SN ∝ n), which suggests that the distance covered in the nth second increases linearly with time. Step 5) We should expect a plot of SN versus n to be a straight line, as a straight line is characteristic of a direct proportionality in physics.",
    "Solution Outline": "Step 1) Identify known variables from question: initial velocity (u = 0), acceleration (a = 1 m/s^2), and time (n). Step 2) Use the formula SN = u + a (2n – 1)/2, which is derived from laws of motion, to calculate the distance covered (SN) in the nth second. Step 3) Substitute u = 0 and a = 1 m/s^2 into the formula to get SN = (2n – 1) / 2. Step 4) Understand the relationship SN ∝ n which implies that the distance covered in the nth second increases linearly with time. Step 5) Recognise that a direct proportionality yields a straight line when plotted, so a graph of SN versus n for this situation will be a straight line."
}