{
    "Question": "Q.17: A ‘thermacole’ icebox is a cheap and efficient method for storing small quantities of cooked food in summer in particular. A cubical icebox of side 30 cm has a thickness of 5.0 cm. If 4.0 kg of ice is put in the box, estimate the amount of ice remaining after 6 h. The outside temperature is 45 C, and the co-efficient of thermal conductivity of thermacole is 0.01 J s^–1 m^–1 K^–1. [Heat of fusion of water = 335 × 10^3 J kg^–1]\r\n",
    "Original Solution": "The side of the cubical icebox, s =30 cm=3 x 10^(-2) m\r\nThe thickness of the icebox, L =5.0 cm=0.05 m\r\nThe mass of ice kept in the icebox, m=4 kg\r\nTime, t=6 h=6×60×60 = 21600\r\nOutside temperature, T1= 45 C\r\nThe temperature of the icebox = 0C\r\nThe temperature difference = T1 – T2 =45 C – 0 C\r\nThe surface area of the icebox = 6 x (0.30)^2= 0.54\r\nThe coefficient of thermal conductivity of thermacole, K=0.01 Js^−1 m^−1 k^−1\r\nThe heat of fusion of water, L= 335×10^3 Jkg^−1\r\nThe total heat entering the icebox in 6 hours is\r\nQ = KA(T1−T2)t/L\r\n= (0.01 Js^(-1) m^(-1)C^(-1) x 0.54 m^2 x 450 C x 21600 s)/0.05 m\r\n= 1.05 x 10^5 J\r\nLet m be the total amount of ice that melts in 6 h.\r\nBut Q= mL\r\nTherefore, m = Q/L\r\n=1.05 x 10^5 /(335×10^3)=0.313 kg\r\nAmount of ice remaining after 6 h = 4–0.313=3.687 kg",
    "Detailed Solution": "Step 1) The first thing we do is to convert all the given measures to the standard SI units. For facilitating the calculation, the side of the cubical icebox and the thickness of the icebox were converted from centimeters to meters. Given that 1 meter equals 100 centimeters, we turn 30 cm into 0.30 m and 5 cm into 0.05m. Time was converted from hours to seconds, with 1 hour equal to 60 minutes and 1 minute has 60 seconds, therefore multiplying 6 hours by 60 we get the minutes and then again multiplied by 60 to get the final time in seconds which turns out to be 21600 seconds.\nStep 2) We then calculate the temperature difference. Knowing that the temperature inside the icebox remains at the freezing point of 0 degrees Celsius, and the given outside temperature is 45 degrees Celsius, the temperature difference is simply 45°C - 0°C = 45°C.\nStep 3) To find the amount of heat entering the icebox, we'll first determine the surface area of the icebox. A cube has 6 equal sides so the total surface area is 6 times the area of each side, which is 0.30^2.  This gives a total surface area of 0.54 m^2.\nStep 4) We now have all the values needed to substitute into the formula for heat conduction which is Q = KA(T1−T2)t/L. Q is the total heat entering the icebox, K is the thermal conductivity, A is the surface area, (T1−T2) is the temperature difference, t is the time, and L is the thickness of the material.\nStep 5) Substituting the known values into this formula, we obtain Q = 1.05 x 10^5 Joules.\nStep 6) In calculating how much ice melts, we'll use the formula Q= mL where m is the mass of the ice that melts and L is the latent heat of fusion. Rearranging this equation to m = Q/L and plugging in our values, we find that m is equal to 0.313 kg. This represents the amount of ice that melts over the 6 hour period.\nStep 7) The final step is to find the amount of remaining ice. We subtract the amount of ice that melts (0.313 kg) from the initial quantity of ice (4 kg), which gives us 3.687 kg of ice remains after 6 hours.",
    "Solution Outline": "Step 1) Convert all measures to standard units: Lengths are converted from cm to meters and time from hours to seconds.\nStep 2) Calculate the temperature difference, which is 45°C - 0°C = 45°C.\nStep 3) Determine the surface area of the icebox which is calculated by the formula for the area of a cube.\nStep 4) Substitute known values into the formula for heat conduction Q = KA(T1−T2)t/L. This gives the total heat entering the box.\nStep 5) Use the latent heat formula Q= mL to find m, the amount of melted ice. \nStep 6) Finally, you subtract the melted ice from the initial quantity to find the remaining ice."
}