{
    "Question": "35. A block of mass 15 kg is placed on a long trolley. The coefficient of static friction between the block and the trolley is 0.18. The trolley accelerates from rest with 0.5 ms^(-2) for 20 s and then moves with uniform velocity. Discuss the motion of the block as viewed by (a) a stationary observer on the ground (b) an observer moving with the trolley.",
    "Original Solution": "Mass of the block = 15 kg\r\nCoefficient of static friction between the block and the trolley, p= 0.18\r\nAcceleration of the trolley = 0.5 m/s^2\r\n(a) Force experienced by block, F = ma = 15 x 0.5 = 7.5 N, this force acts in the direction of motion of the trolley\r\nForce of friction, Ff= p mg = 0.18 x 15 x 10 = 27 N\r\nForce experienced by the block will be less than the friction. So the block will not move. So, for a stationary observer on the ground, the block will be stationary.\r\n(b) The observer moving with the trolley has an accelerated motion. He forms a non-inertial frame in which Newton’s laws of motion are not applicable. The trolley will be at rest for the observer moving with the trolley",
    "Detailed Solution": "Step 1) Begin by identifying one of the known values. The mass of the block is given as 15 kg. This is the object that we're analyzing throughout the problem. Step 2) In this same vein, we note other given values. The coefficient of static friction between the block and the trolley is provided as 0.18. This number tells us about the frictional forces the block experiences when it's sitting idle. Step 3) Furthermore, the acceleration of the trolley is given as 0.5 m/s^2. Acceleration refers to how the speed of the trolley changes over time, and in this case, it's an input for later calculations. Step 4) For part (a) of the problem, we need to compute the force experienced by the block. To do so, we use the formula F = ma, where 'F' denotes the force, 'm' refers to the mass of the block, and 'a' represents the acceleration of the trolley. Substituting the given values, we get that F = 15 kg * 0.5 m/s^2 = 7.5 N. This force acts in the same direction as the trolley motion. Step 5) We also calculate the force of friction using the formula Ff = mg, where 'Ff' stands for the force of friction, 'm' is the mass of the block, and 'g' is the gravitational force, commonly taken as 10 m/s^2. The computed frictional force is Ff = 0.18 * 15 kg * 10 m/s^2 = 27 N. Step 6) We then compare the two forces computed. The resulting force on the block is less than the friction force, which means that the block won't move in relation to the ground. Hence, for an observer stationed on the ground, the block appears stationary. Step 7) For part (b), we consider an observer moving with the trolley. In such a case, the observer is in a non-inertial frame and Newton’s laws of motion do not apply since the observer is moving along with the trolley. Hence, the observer sees the trolley (and therefore, the block on it) as stationary.",
    "Solution Outline": "Step 1) Recognize the given values: mass of the block, coefficient of static friction, and acceleration of the trolley. Step 2) For an observer on the ground, compute the force experienced by the block using Newton's second law, F = ma, and substitute known values. Step 3) Calculate the frictional force using the formula Ff = μmg where μ is the coefficient of static friction. Step 4) Compare the two obtained forces. Since the frictional force is more than the force on the block, the block remains stationary. Step 5) For an observer on the trolley, we're in a non-inertial frame of reference, which implies that Newton's laws of motion don't apply. Hence, the observer would see the block as stationary, given they're moving at the same velocity as the block."
}