{
    "Question": "Q13: A man can swim with a speed of 4 km/h in still water. How long does he take to cross a river 1 km wide if the river flows steadily at 3 km/h and he makes his strokes normal to the river current? How far down the river does he go when he reaches the other bank?\r\n",
    "Original Solution": "Speed of the man \\(\\begin{array}{l}v_{m}\\end{array} \\) = 4 km/h\r\nWidth of the river = 1 km\r\nTime taken to cross the river = \\(\\begin{array}{l}\\frac{Width \\; of \\; the \\; river }{Speed \\; of \\; the \\; river}\\end{array} \\)\r\n\r\n= \\(\\begin{array}{l}\\frac{1}{4}\\end{array} \\) h\r\n= \\(\\begin{array}{l}\\frac{1}{4} \\times 60\\end{array} \\) = 15 min\r\nSpeed of the river, \\(\\begin{array}{l}v_{r}\\end{array} \\) = 3 \\(\\begin{array}{l}\\frac{km}{h}\\end{array} \\)\r\n\r\nDistance covered with flow of the river = \\(\\begin{array}{l}v_{r} \\times t\\end{array} \\)\r\n= \\(\\begin{array}{l}3 \\times \\frac{1}{4}\\end{array} \\)\r\n= \\(\\begin{array}{l}\\frac{3}{4}\\end{array} \\)\r\n= \\(\\begin{array}{l}\\frac{3}{4} \\times 1000\\end{array} \\) = 750 m",
    "Detailed Solution": "Step 1) We start by identifying what we know. The man still water speed is 4 km/h, the width of the river is 1 km, and the river speed is 3 km/h. Step 2) We need to find out how long the man takes to cross the river. Here, we are interested in the time he takes to cross the river perpendicular to the current -- from one bank to the opposite bank. Step 3) By applying the basic formula time = distance/speed, we can calculate this. For our case, the distance is the width of the river (1 km), and the speed is the man’s speed in still water(4 km/h), because he is swimming perpendicular to the river current. Using d=1 km and v=4 km/h in the formula yields time = 1/4 hour. Step 4) We usually measure time in minutes, so we convert hours into minutes: 1/4 hour is 15 minutes. Step 5) Next, we need to find out how far down the river the man goes when he crosses the river. This distance is due to the river flow. Step 6) Again, using the basic formula for distance (distance = speed x time), we can calculate the man's distance down the river. Here, the speed is the speed of the river (3 km/h) and the time is the time the man spends crossing the river (1/4 hour). So, using v_r=3 km/h and t=1/4 hour, we find the distance down the river to be 3/4 km. Step 7) We typically express distances in meters, so we need to convert kilometers into meters: 1 kilometer equals 1000 meters, so 3/4 kilometers is 750 meters.",
    "Solution Outline": "Step 1) Identify the known quantities: The man's speed, the river's width and speed. Step 2) Use the formula time = distance/speed to find the time it takes the man to cross the river. As he is swimming perpendicular to the river current, use the man's speed in still water as the speed. Step 3) Convert the time to minutes for ease of understanding. Step 4) To find out how far the man is swept down the river, use the formula for distance, which is distance = speed x time. Here, use the river's speed and the time it takes the man to cross the river. Step 5) Convert the distance into meters for ease of understanding."
}