{
    "Question": "Q25. Two discs of moments of inertia I1 and I2 about their respective axes (normal to the disc and passing through the centre), and rotating with angular speeds ω1 and ω2 are brought into contact face to face with their axes of rotation coincident.\r\n(a) What is the angular speed of the two-disc system?\r\n(b) Show that the kinetic energy of the combined system is less than the sum of the initial kinetic energies of the two discs. How do you account for this loss in energy? Take ω1 not equals to ω2.",
    "Original Solution": "( a )Given,\r\nLet the moment of inertia of the two turntables be I1  and I2, respectively.\r\nLet the angular speed of the two turntables be  ω1  and ω2, respectively.\r\nThus, we have\r\nAngular momentum of turntable 1, L1 = I1ω1\r\nAngular momentum of turntable 2, L2 = I2ω2\r\n=> Total initial angular momentum Li = I1ω1 + I2ω2\r\nWhen the two turntables are combined together,\r\nMoment of inertia of the two turntable systems, I = I1 + I2\r\nLet ω be the angular speed of the system.\r\n=>  Final angular momentum, LT = (I1 + I2) ω\r\nAccording to the principle of conservation of angular momentum, we have\r\nLi = LT\r\nI1ω1 + I2ω2 = (I1 + I2)ω\r\nTherefore , ω = (I1ω1 + I2ω2) / (I1 + I2) . . . . . . . . . .  ( 1 )\r\n( b ) Kinetic energy of turntable 1, K.E1 = ( 1/2 ) I1(ω1)^2\r\nKinetic energy of turntable 2, K.E1 = ( 1/2 ) I2(ω2)^2\r\nTotal initial kinetic energy, KEI = (1/2) ( I1(ω1)^2 + I2(ω2)^2)\r\nWhen the turntables are combined together, their moments of inertia add up.\r\nMoment of inertia of the system, I = I1 + I2\r\nAngular speed of the system = ω\r\nFinal kinetic energy KEF  =  (1/2) ( I1 + I2) ω2 Using the value of ω from  (1)\r\n=  (1/2) ( I1 + I2) [ (I1ω1 + I2ω2) / (I1 + I2) ]2\r\nKEF = (1/2) (I1ω1 + I2ω2)^2 / (I1 + I2)\r\nNow, KEI – KEF\r\n= ( I1(ω1)^2 + I2(ω2)^2) (1/2) – [ (1/2) (I1ω1 + I2ω2)^2 / (I1 + I2) ]\r\n\r\nSolving the above equation, we get\r\n= I1 I2 (ω1 – ω2)^2 / 2(I1 + I2)\r\nAs (ω1 – ω2)^2  will only yield a positive quantity, and I1 and I2  are both positive, so RHS will be positive.\r\nWhich means KEI – KEF > 0\r\nOr, KEI > KEF\r\nSome of the kinetic energy was lost, overcoming the forces of friction when the two turntables were brought in contact.",
    "Detailed Solution": "Step 1) Begin with understanding the given values in the problem. We have two discs with moments of inertia I1 and I2 respectively. They are rotating with angular speeds ω1 and ω2 respectively. Step 2) Calculate the initial angular momenta of the individual discs. The angular momentum of a rotating object is given by the product of its moment of inertia and its angular speed. So for disc one it is L1 = I1ω1 and for disc two it is L2= I2ω2. Step 3) Sum up the individual momenta to get total initial angular momentum. Li = I1ω1 + I2ω2. Step 4) When these two discs are brought together, their moments of inertia add up, and they rotate with a common angular speed ω. So, the moment of inertia of the combined system (I) is I = I1 + I2. Therefore, the new total angular momentum (LT) is LT = (I1 + I2) ω. Step 5) Apply the conservation of angular momentum, this principle states that the total angular momentum before the collision is equal to the total angular momentum after. So, LT = Li, which equates to I1ω1 + I2ω2 = (I1 + I2)ω. Step 6) Solve the equation for ω to find the angular speed of the combined system as ω = (I1ω1 + I2ω2) / (I1 + I2) . Step 7) Calculate the initial kinetic energy of each disc using the formula for kinetic energy of rotating objects (K.E = 1/2 I ω^2). K.E1 = 1/2 I1(ω1)^2 for disc one and K.E2 = 1/2 I2(ω2)^2 for disc two. Step 8) Sum these energies to get the total initial kinetic energy, KEI = (1/2) ( I1(ω1)^2 + I2(ω2)^2). Step 9) The final kinetic energy after the discs come together is given by KEF = 1/2 ( I1 + I2) ω^2. Replace ω in this equation with the value found in Step 6. This gives: KEF = 1/2 (I1 + I2) [ (I1ω1 + I2ω2) / (I1 + I2) ]^2. or, KEF = (1/2) (I1ω1 + I2ω2)^2 / (I1 + I2). Step 10) Subtract the final kinetic energy from the initial total kinetic energy: KEI – KEF. This gives the amount of energy lost during the collision. After solving the equation, this equals I1 I2 (ω1 – ω2)^2 / 2(I1 + I2), which proves to be positive. Therefore, the kinetic energy was lost, mostly due to the friction when the two turntables came in contact, as KEI > KEF.",
    "Solution Outline": "Step 1) Identify given values - moments of inertia (I1, I2) and angular speeds (ω1, ω2) for the two discs. Step 2) Calculate initial angular momenta (L1, L2) for each disc. Step 3) Add them together for total initial angular momentum (Li). Step 4) Observe that when discs are brought together, moments of inertia add up, the system rotates with a common angular speed (ω). Calculate the new total angular momentum (LT). Step 5) Apply the principle of conservation of angular momentum to equate Li and LT. Step 6) Solve for ω to find the angular speed of the combined system. Step 7) Calculate initial kinetic energy for each disc (K.E1, K.E2) using kinetic energy formula. Step 8) Sum up the individual kinetic energies for total initial kinetic energy (KEI). Step 9) Calculate final kinetic energy (KEF) for the combined system and substitute ω from step 6 into this equation. Step 10) Find difference between KEI and KEF to understand the loss of energy. Conclude that KEI > KEF shows some kinetic energy lost due to friction."
}