{
    "Question": "27. A helicopter of mass 1000 kg rises with a vertical acceleration of 15 ms^(-2). The crew and the passengers weigh 300 kg. Give the magnitude and direction of\r\n(a) force on the floor by the crew and passengers\r\n(b) the action of the rotor of the helicopter on surrounding air\r\n(c) force on the helicopter due to the surrounding air",
    "Original Solution": "Mass of helicopter = 1000 kg\r\nCrew and passengers weight = 300 kg\r\nVertical acceleration, a = 15 ms^(-2) and g = 10 ms^(-2)\r\nThe total mass of the system, mi = 1000 + 300 = 1300 Kg\r\n(a) Force on the floor of the helicopter by the crew and passengers\r\nR – mg = ma\r\n= m (g+a)\r\n= m (g + a) = 300 (10 + 15) N = 7500 N\r\n(b) Action of the rotor of the helicopter on surrounding air is due to the mass of the helicopter and the passengers.\r\nR’ – mig = mia\r\nR’ = mi (g+a)\r\n= 1300 x (10 + 15) = 32500 N\r\nThis force acts vertically downwards\r\n(c) Force on the helicopter due to the surrounding air is the reaction of the force applied by the rotor on the air. As action and reaction are equal and opposite, therefore, the force of reaction, F = 32500 N. This force acts vertically upwards.",
    "Detailed Solution": "Step 1) We start this problem by identifying the known quantities. The mass of the helicopter is 1000 kg, the weight of the crew and passengers is 300 kg and the vertical acceleration is 15 ms^(-2). Gravitational acceleration, denoted as g, is 10 ms^(-2). These are the values provided and known to us. Step 2) We add up the mass of the helicopter and the weight of the crew and passengers to get the total mass of the system, denoted henceforth as mi. This is done using simple addition: 1000 kg + 300 kg = 1300 kg. Step 3) To find the force exerted on the floor by the crew and passengers (Part a of the question), we use Newton's second law of motion stated as F = ma where F is the force, m is the mass and a is the acceleration. However, we have to consider both the gravitational pull (mg) and the upward acceleration (ma). Therefore, the force equation becomes R - mg = ma where R is the total reaction and we rearrange to get R = m(g+a). Step 4) Inserting the mass of the passengers and crew (m = 300 kg) and given values of gravitational acceleration and the upward acceleration (g + a = 10 ms^(-2) + 15 ms^(-2)) into the equation from Step 3, we compute the value R = 300 x (10+15). This leads to a force of 7500 N. Step 5) For part (b) of the question, we compute the action of the rotor of the helicopter on the surrounding air. This should consider the total mass of the system, mi. So, we use a similar principle as we did in part (a), computing R' - mi*g = mi*a, equivalent to R' = mi*(g+a), where R' denotes the total rotor force. Replacing mi with the total mass of the system, 1300 kg, we get a force of 32500 N acting downwards. Step 6) For part (c), we consider Newton's third law which states that for every action, there's an equal and opposite reaction. Therefore, the force acting on the helicopter due to the surrounding air will be equal and opposite to the force exerted by the helicopter on the surrounding air, which is 32500 N, acting upwards.",
    "Solution Outline": "Step 1) Take note of the given values – mass of the helicopter (1000 kg), weight of crew and passengers (300 kg), and the acceleration (15 ms^-2), and the known gravitational acceleration (10 ms^-2). Step 2) Find total mass of the system by adding the mass of the helicopter to the weight of the crew and passengers. Step 3) Formulate the equation for the force exerted on the floor by the crew and passengers, taking into account the gravitational pull and the upward acceleration (Newton's second law of motion). Step 4) Insert the given values into the equation derived in Step 3 (mass and accelerations), compute the force. Step 5) Use the similar principle to compute the force exerted by the rotor on the surrounding air, taking into account the total mass of the system (helicopter plus crew and passengers). Step 6) Use Newton's third law (for every action, there’s an equal and opposite reaction) to deduce that the force on the helicopter due to the surrounding air will be equal in magnitude but opposite in direction to the value obtained in the previous step."
}